[
    {
        "id": "001",
        "time": "2023-02-13",
        "title": "【玉山主峰】十年後的我們，依舊是三個傻瓜。",
        "desc": "很多人將爬玉山視為人生必須要完成的三件目標，對登山愛好者而言更是如此。然而說來慚愧，其實起初我並沒有這麼崇高的志向，之所以開始爬山，初衷也只是有感自身體態擁腫，被朋友拖去家鄉附近的登山步道才偶爾會去走一些郊山步道。一直到後來和朋友一起參加谷關七雄挑戰活動，才真正算是喜愛上登山過程的各種醍醐味，從來沒想過的百岳，亦慢慢成為嘗試挑戰的對象。雖然玉山不是我的第一座百岳，但是能成功登上這座台灣最知名且極具意義的高山，不僅是我，相信對所有攀登者而言，皆意義非凡。",
        "tags": ["玉山", "百岳", "百名山", "五嶽"],
        "status": true
    },
    {
        "id": "002",
        "time": "2023-03-02",
        "title": "【加里山】三臺疊翠上的美麗稜線",
        "desc": "南賽夏族的聖山──加里山，位於苗栗縣泰安鄉與南庄鄉之間的交界，坐擁「山城」之稱，苗栗縣內山多平原少，在清朝光緒年間的《苗栗縣誌》山川篇曾寫到：「三台山，俗稱嘉璃山，距城東五、六十里，其山高數百丈，在內山，溪東生蕃居之，人不可到」其中「三台山」指的便是加里山。如果從苗栗市區往東眺望，會看見東方的山脈山巒疊起，層次分明。以墨硯山作為山脈的第一層，是為「底臺」，然後是第二層「中臺」的八角崠山，最後則是最高臺的加里山山脈，苗栗八景中的「三臺疊翠」，所指便是如此。",
        "tags": ["加里山", "小百岳", "百名山", "百步道"],
        "status": true
    },
    {
        "id": "003",
        "time": "2023-05-23",
        "title": "【李崠山】崠？棟？深山裡的古堡與山莊",
        "desc": "「莊院無燈等月照，山門不鎖待雲封」，敞開的入口掛著這兩句用亮紅色彩揮亳寫下的對聯，與外觀褪色老舊的木造建築物儼然形成強烈對比。它遺世獨立在馬美道路的深處，任由風聲鳥語在林間擺盪，沒有太多吵雜的人聲，每一道斑駁的痕跡，皆象徵它所經歷的歲月滄桑。這裡是李棟山莊，在尚未因為電影爆紅之前，它曾是新竹人口耳相傳的秘境；而對登山客來說，它則是口袋造訪名單中，必要佔據其中一個欄位的存在。",
        "tags": ["李崠山", "小百岳", "李棟山莊"],
        "status": true
    },
    {
        "id": "004",
        "time": "2023-07-07",
        "title": "【二坪山】宣！聖旨到......水沙漣古道上的土地公鞍嶺",
        "desc": "「銃櫃豬、頭社米、水社魚、貓囒出夥妓、魚池番薯、大林茶米、木屐囒土礱齒」此乃流傳在南投縣魚池鄉的一句台語諺語，這句諺語簡單明瞭地點出當地的出口特色。而過去清朝時期，南投曾有一條長度大約三十公里的道路，貫穿水里與埔里兩地，在當時是貿易往來的重要路線，它，就是水沙漣古道。",
        "tags": ["水沙漣", "二坪山", "土地公鞍嶺"],
        "status": true
    },
    {
        "id": "005",
        "time": "2023-08-11",
        "title": "【玉山前峰】站在岩石瀑布流下，逆游的我們都是登山鮭魚",
        "desc": "玉山在台灣人心中地位不言自明，圍繞在主峰周圍的諸多群峰，是岳界各層級登山人畢生都想挑戰的目標，有些勇腳更是把玉山群峰當作自家後院，春天刷，夏天刷，上個月刷完這個月又刷，想到就刷，一刷再刷，這不單單只是想要突破自我極限，也是因為玉山群峰線地貌多變、景色絕美，總令人一逮到機會，就會想騰出時間再走一回。",
        "tags": ["玉山前峰", "百岳"],
        "status": true
    },
    {
        "id": "006",
        "time": "2023-09-21",
        "title": "【橫屏山】晴空萬里不見雲，走入武界訪雲鄉",
        "desc": "車輛緩緩駛進這處宛如世外桃源的布農族部落，謐靜彷彿籠罩著這片山野，轟隆隆引擎聲都顯得格外刺耳。雲的故鄉，武界，相信這個名字注入多數人眼耳裡並不陌生。武界坐擁美麗壯闊的山川自然奇景、豐富多元的生態樣貌，以及純樸的原鄉文化，儘管不像日月潭或阿里山那樣盛名遠播，卻也是許多酷愛遊山玩水的遊人一生必訪之地。",
        "tags": ["武界山", "獅凸魯山", "橫屏山", "埔里六秀"],
        "status": true
    },
    {
        "id": "007",
        "time": "2023-10-01",
        "title": "【集集大山】做伙來雧雧，地點係集集那邊大山",
        "desc": "每每開車下國道三號名間交流道，接續台１６線往水里方向駛去，遠遠就能看見濁水溪河畔矗立著一座山容基盤寬闊，高聳挺拔，宛如相撲力士般屹立不搖的山岳，祂便是名聞遐邇的「集集大山」。儘管九二一地震嚴重覆蓋世人對集集此地的第一印象，但在過去集集鎮可是中台灣漢人與原住民交易往來的中心，素有「小台北」美譽。而外地商人總會稱小鎮東北面那座聳立的高山為「集集那邊大山」，久而久之，集集大山便成為這座大山的名字。",
        "tags": ["集集大山", "小百岳"],
        "status": true
    },
    {
        "id": "008",
        "time": "2023-10-19",
        "title": "【南觀音山】一步一階涔涔汗，層層疊疊，那便是信仰的高度",
        "desc": "西元１９４０年代是台灣社會動盪不安的年代，二次戰爭末期美軍開始轟炸台灣，島土盡是滿目瘡痍。然而，傳說有居民看見台中大坑一帶的山區，白煙瀰漫之中間浮現出一朵蓮花，接住了美軍飛機投擲下的黑色轟炸物。該朵蓮花所在的位置，正好就在觀音山上，當時僅山頂由日軍設置的觀景台安然無恙外，周遭區域無不受到重創。數十年之後，一名法師於此地興建寺廟，以供信徒祭拜禮佛，據說在那之後各種感應靈驗事蹟頻傳，很快地便成為台中著名的宗教信仰中心之一。",
        "tags": ["南觀音山", "小百岳"],
        "status": true
    },
    {
        "id": "009",
        "time": "2023-10-30",
        "title": "【鳶嘴稍來】上山容易下山難，難過一關又一關",
        "desc": "當與攀岩愛好者開啟台灣有哪些著名天然岩場的話匣子時，北部人可能會回答你皇帝殿、五寮尖、孝子山，或是近年很夯的劍龍稜；南部人則可能給出關子嶺岩場、獵鷹尖等答案。那麼中部呢？「鳶嘴山」這個名字肯定當仁不讓。且不侷限於攀岩界，假如上登山社群發問中級山的推薦名單，鳶嘴山肯定也是榜上有名──不光要面對各種岩石地形的阻礙才能攀上顛峰，下山則還得必須具備足夠的膽識。早在多年前，鳶嘴山已是許多喜愛冒險的登山人倍加推崇的中級山，每逢例假日，前來攀爬鳶嘴山的挑戰者可說是絡繹不絕，總是將狹窄的石道擠得水洩不通，足見這座譽為中部最美中級山之魅力。",
        "tags": ["鳶嘴山", "稍來山", "小百岳", "百名山", "百步道"],
        "status": true
    },
    {
        "id": "010",
        "time": "2023-11-03",
        "title": "【五指山】指尖上的起起落落，五指凌霄的美麗與哀愁",
        "desc": "於風水師形勢法觀點，鵝公髻山與五指山可以分為視為北埔的太祖山與少祖山，為龍脈的發源地，蜿蜒至秀鑾山是為父母山，是為「龍」；北埔慈天宮廟地即胎息與孕育之所在，是為「穴」；廟前兩側皆有崗巒圍護，正前方則有龍鳳髻山為朝山，是為「砂」；大湖與大坪兩溪自秀巒山南北兩麓匯合於前，是為「水」。集齊「龍」、「穴」、「砂」、「水」四大元素，孕育出北埔地區繁榮一時的市況，著名的金廣福墾號便是紮根於此。同時漢人亦將信仰引渡進來，五指山佛道兩教廟宇林立，香火鼎盛，紅極一時。全淡八景、塹南八景、台灣十二名勝、台灣百大名山、小百岳．．．．．．自古以來，五指山便是文人雅士和岳界前輩心目中的名山。",
        "tags": ["五指山", "小百岳", "百名山", "塹南八景", "台灣十二名勝"],
        "status": true
    },
    {
        "id": "011",
        "time": "2023-11-09",
        "title": "【學田山】圳路水源汩汩不絕，海拔一三九的全方位視野",
        "desc": "寶島台灣四面環海，地勢由東西兩側向中央逐漸隆起，孕育出上百座高山，無論何時都不乏試圖攀上顛峰的挑戰者。相較於中央，沿海地區的山麓不僅稀少，高度也不高，比起動輒三千公尺的百岳，絕大多數都是高度不足一千的郊山，卻也因為如此，祂們比起百岳群峰更加平易近人，是許多平民百姓休閒健走的好去處。",
        "tags": ["學田山", "知高圳", "雪蓮步道"],
        "status": true
    },
    {
        "id": "012",
        "time": "2023-12-01",
        "title": "【大橫屏山】大意「吃荊粥」──在重重黃藤陣中尋找登山路",
        "desc": "宋代著名文學家蘇軾一生漂泊，在某次貶途離開黃州，前往汝州路上經過廬山時，曾於西林寺的牆壁上寫了一首詩：「橫看成嶺側成峰，遠近高低各不同；不識廬山真面目，只緣身在此山中。」──這首詩便是著名的《題西林壁》。其中，蘇軾利用前兩句詩詞描述盧山的外觀，意指從不同的角度看，山的形狀會有所不同。強調的是視角變化，從正面看像是一條山脊，從側面看則是山峰，遠近的距離也會影響視覺的感受，這些自然現象說明了不同方向投視的視角，映入眼簾的也會呈現出不同的景象。",
        "tags": ["大橫屏山", "小百岳"],
        "status": true
    },
    {
        "id": "013",
        "time": "2023-12-19",
        "title": "【青年嶺】眼觀飛瀑奔騰，耳聽燕子呢喃，一縷茶香，諸多往事",
        "desc": "２０２２年，台灣學術界的一隅盪漾出一波小小的漣漪。一位畢業於中正大學台灣文學與創意應用研究所的碩士生，同時曾任事過梅山文教基金會執行長的李旭彥先生，於碩士畢業論文發表《瑞里來了個單車客》著作，是該研究所首位以寫小說畢業的學生。該小說敘述一位來到梅山的外科醫生，於梅山市區、太平、太興、太和與瑞里等地生活日常的足跡，雖然故事舞台以梅山為主，論文篇題卻以瑞里落筆，瑞里究竟是什麼樣的地方？夾在梅山與阿里山兩大著名的景區之間，歷史底蘊深厚的瑞里，除了山水好風光之外，亦默默流傳著諸多往事。儘管我不是單車客，而是以一位尋常無名的登山訪客，循著前人的足跡，悄悄走進這片謐靜的山野。",
        "tags": ["青年嶺步道", "蝙蝠洞", "燕子崖", "瑞里"],
        "status": true
    },
    {
        "id": "014",
        "time": "2024-01-17",
        "title": "【仙山】正所謂山不在高，有仙則名。仙水、仙跡，成就一座仙山",
        "desc": "「仙境仙水好雲飄，山中山人樂逍遙，古寺靈洞揚梵唱，道上斜陽林間照。」這是２００９年苗栗縣國際文化觀光局局長甘必通先生，贈送給苗栗仙山靈洞宮的一首藏頭詩。後來廟方請工匠將此詩雕刻在石碑上，供各路香客、遊人造訪廟宇時順道品讀，每一行詩句皆透露著仙山這塊寶地各種氣象萬千，山下層雲深護，山上雲海迷漫撩繞山間，如處身漂渺仙境，令人心生嚮往。而將詩句各行第一個字串聯起來，恰好組成「仙山古道」，凡人若想親身步入仙境，就必須一步一腳印，循古道穩步踏實而上。仙山不止只是景象宛如仙境，其背後流傳的故事更是滿溢著傳奇色彩．．．．．．",
        "tags": ["仙山", "小百岳", "紅毛館山", "仙山南峰", "八仙古道"],
        "status": true
    },
    {
        "id": "015",
        "time": "2024-02-01",
        "title": "【貓囒山】日月潭四兄妹，貓囒山上真的有貓？",
        "desc": "「明潭四秀」，指的是環繞日月潭的四座中級山，也有人用比較親切的「日月潭四兄妹」來稱呼祂們，這四座山以「水社大山」為首，然後依序是「大尖山」、「貓囒山」與「後尖山」，每一座山的海拔高度皆超過一千公尺，山勢巍峨高聳，宛如衛士般守護著日月潭。",
        "tags": ["貓囒山", "小百岳", "明潭四秀"],
        "status": true
    },
    {
        "id": "016",
        "time": "2024-02-10",
        "title": "【崁頭山】想像力就是你的超能力！伏臥步道上的石蟾蜍",
        "desc": "當中、低海拔的山區步道越走越多，由內心滋生的某一個想法也越來越強烈──那就是這些山必定標配香火鼎盛的廟宇。其實這在之前遊台中南觀音山一文就曾提過，山在中華文化裡被視為接近天界的地方，是神聖和清靜的象徵，所以許多修仙、修道者，往往會隱入人跡罕至的山中修行，堅定信仰以更親近神明。",
        "tags": ["崁頭山", "小百岳", "百步道", "石蟾蜍"],
        "status": true
    },
    {
        "id": "017",
        "time": "2024-02-27",
        "title": "【龍崀頂】三灣也有火炎山？走在龍脈頂端的樟之細路",
        "desc": "峎，漢語辭典記載其發音同為三聲「恩」字音，而在客家話中則念作「跟」，此字有著山頂的含義，也有一說指的是低矮山丘的斜坡，雖然兩者字義皆與山有關，但是放眼中華文化圈，鮮少有以此字做為地理名稱，甚至現代字典參考的鼻祖之一──《玉篇》，也只是簡短地記述峎為山名爾爾，資訊極少。不過在台灣苗栗縣三灣鄉的內灣村，仍存在著這麼一個古老地名，名喚「龍崀頂」，它所處位置為內灣村當地人視為龍脈的制高點，故而得名。",
        "tags": ["龍崀頂", "龍崀頂步道", "火炎山", "樟之細路"],
        "status": true
    },
    {
        "id": "018",
        "time": "2024-03-05",
        "title": "【巴塱衛山】與晨曦同行，在巴塱衛山山頂俯瞰太平洋海岸",
        "desc": "今年中秋連假，我們一行人臨時起意，決定繞半個台灣驅車前往花東，擺脫平日在都市叢林裡承受的喧囂，徜徉於東部山海間，感受東台灣慢活步調。不過因為是放假前幾天才突然下的決定，預算內的飯店民宿基本上都已經客滿，於是我們轉念一想，不如就找個人煙罕至的地方野營，愜意地度過連續假期。",
        "tags": ["巴塱衛山", "小百岳", "利嘉林道"],
        "status": true
    },
    {
        "id": "019",
        "time": "2024-03-20",
        "title": "【奇萊南峰】萌芽自大草原上的第一株夢",
        "desc": "２０１８年的夏季尾聲，聊天群組捎來其中一名友人的訊息，大意是說今年國慶那週是否要挑戰為期兩天的高山縱走行程？雖然在那之前，我就有時不時去走登山步道的習慣，但多半都在住處附近的郊山活動，對登山這個項活動處於不排斥，但也沒有到很喜歡的階段，單純將其視作消耗卡路里的運動，頻率也不高。",
        "tags": ["奇萊南峰", "百岳", "十崇", "天池山莊", "能高越嶺古道"],
        "status": false
    },
    {
        "id": "0xx",
        "time": "2023-12-30",
        "title": "【瑞太古道】風裡有心有夢，而山林也有情有義",
        "desc": "",
        "tags": ["瑞太古道", "瑞里"],
        "status": false
    }
]