<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：東埔山莊' },
    { id: 2, title: '2K：玉山登山口' },
    { id: 3, title: '3K：玉山西峰' },
    { id: 4, title: '4K：大鐵籠' },
    { id: 5, title: '5K：玉山主峰' },
    { id: 6, title: '6K：歸途' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="1" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2021-01-11</strong></p>
        <p><span>行走總長：</span><strong>約 24 KM</strong></p>
        <p><span>累計耗時：</span><strong>兩天一夜</strong></p>
        <p><span>路程總覽：</span><strong>東埔山莊 → 排雲登山服務中心 → 大鐵杉 → 玉山登山口 → 白木林觀景台 → 玉山大峭壁 → 排雲山莊 → 玉山主峰</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <h2 v-text="catalog[0].title"></h2>
        <p>很多人將爬玉山視為人生必須要完成的三件目標，對登山愛好者而言更是如此。然而說來慚愧，其實起初我並沒有這麼崇高的志向，之所以開始爬山，初衷也只是有感自身體態擁腫，被朋友拖去家鄉附近的登山步道才偶爾會去走一些郊山步道。一直到後來和朋友一起參加谷關七雄挑戰活動，才真正算是喜愛上登山過程的各種醍醐味，從來沒想過的百岳，亦慢慢成為嘗試挑戰的對象。雖然玉山不是我的第一座百岳，但是能成功登上這座台灣最知名且極具意義的高山，不僅是我，相信對所有攀登者而言，皆意義非凡。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <h2 v-text="catalog[1].title"></h2>
        <p>其實早在一年前，我們就已幸運抽到排雲山莊的床位，那時天時地利人和什麼條件都好，感覺會是一趟一次到位且不須補考的玉山之旅。然而，暈車不適、睡眠不足，以及典型的高山症初期症狀，即便按照預定計畫於凌晨兩點起登，但最終仍在孟祿亭前，因為身體狀況欠佳，黯然宣布撤退。眾所周知，摒除掉「單攻」這個選項，爬玉山首先要面對的難題就是「抽到排雲山莊」，其機率之低甚至堪比國考錄取率，只花幾個月就中籤的我們已屬幸運，下次若要再中籤，不知道得累積多長時間多少數量的人品，才能集齊兌換印花。</p>
        <p>殊不知，數月後的某日，友人在群組內興高采烈地宣布再次抽到排雲山莊的喜訊，使得原本逐漸沉澱到行程清單底層的玉山行，又重新抽出來攤在檯面上。只是，此次抽到排雲山莊床位的日期，是有些尷尬的一月底。</p>
        <figure>
            <img src="/images/mtlogs/001/01.jpg">
        </figure>
        <p>甫整修完的東埔山莊，整體沒有太大的改變，卻一改以往給人陳舊老樸的印象，外牆上雪白的漆色，彷彿要與午後瀰漫在塔塔加的霧氣融為一體似的。</p>
        <p>很快地時序來到冷冽的冬季，本島陸續接受數道寒流的洗禮後，三千公尺級的高山紛紛撒上粉白粉白的糖霜。始終踟躕不定的我們，確認氣象預報後還是決定採取一套且戰且走的戰法，依原定計畫出發，一旦狀況不允許便立刻撤退。有了前次開夜路，世界彷彿天地倒轉的慘痛經驗，這次將第零日的時間大幅提前，令一早就集合完畢的我們，得以在車行索取避免輪胎在結冰山路打滑的雪鏈後，以一種很不像第零日常與時間賽跑的方式，好整以暇地一路驅車開往第零日住宿的地點──東埔山莊。</p>
        <figure>
            <img src="/images/mtlogs/001/02.jpg">
        </figure>
        <p>東埔山莊位於排雲登山服務中心外，是距離玉山登山口最近的住宿點，長久以來一直都是登山者們登臨玉山群峰的前哨站整備首選。在登山旺季的時候，有時不單單只是抽到排雲山莊而已，必須連帶東埔山莊都申請到才稱得上真正的天選之人。至於雪季就沒有這方面的問題了，這天包含我們三人在內，投宿客目測不超過二十人，比起前次春季座無虛席的盛況，大通鋪空蕩蕩地反倒令人感到有些不習慣。</p>
        <p>相較玉山主峰的三千九百公尺，東埔山莊海拔「兩千六百」公尺左右看似相形失色，但其實也夠嗆的了，入夜後急遽降低的溫度令眾人冷得只打哆嗦，早早便鑽入被窩裡養精蓄銳，當然，也有部分原因是夜晚的山莊毫無娛樂可言，且不便影響其他凌晨就要起登的單攻客寶貴睡眠時間。</p>
        <p>晚間八點左右入寢，在半夢半醒之間，泛白的晨光逐漸從窗縫間探頭進來，提醒我們是時候了。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <h2 v-text="catalog[2].title"></h2>
        <p>假定以玉山主峰作為行程終點目標來說，走單攻行程的登山客通常凌晨兩三點就需要出發，否則很容易因為超時而無法在管制時間前通過排雲山莊。不過現在正值冬季，單攻的人不多，多半是像我們這類排兩天一夜輕鬆登山的人。因為東埔山莊到玉山登山口這段楠溪林道不開放外來車輛通行，有些山友會索性在東埔山莊或排雲登山服務中心等到六點半，直接花一百元搭第一班接駁車前往玉山登山口，大概可以節省二到三公里的步行路程。</p>
        <figure>
            <img src="/images/mtlogs/001/03.jpg">
        </figure>
        <p>不過由於此行其中一名夥伴是第一次挑戰玉山，為了讓他體驗更完整的登山行程，我們在排雲登山服務中心完成報到手續後，決定繼續用走的前往玉山登山口，順便讓還沒完全開機的身體有更多暖機時間。我們抵達玉山登山口時雖然已是八點時分，然而這對兩天一夜的行程來說，時間還算不上晚。</p>
        <figure>
            <img src="/images/mtlogs/001/04.jpg">
        </figure>
        <p>雖說在踢楠溪林道的過程中，就已經看見著名的大鐵杉、路邊的蕨草植物，皆已附上薄薄一層冰霜，心裡對於山景雪白世界的樣貌已有大致的輪廓。然而，當真正踏進通往玉山的登山步道上時，親眼所見又是與想像截然不同的光景。儘管視界並未被純白徹底染透，可是對從未進入雪國的我來說，彷彿已置身在高緯度的北方國度，既綺麗又夢幻。</p>
        <p>包含我們在內，以及其他同路的山友們，一邊猛按快門，一邊慶幸著這是一趟為期兩天的登山行程，意味著有大把時間讓我們揮霍，恣意捕捉不單是冬季，而是雪季限定的罕見風景。相較於當日往返的單攻客，恐怕就沒有那麼多閒情逸致，興許在他們抵達排雲山莊的時候，天才正要明亮起來呢。畢竟玉山國家公園管理處對於玉山單攻的時間控管有著嚴格限制，必須於當日早上十點前通過排雲山莊，否則排雲山莊管理員會請未於表定時間內通過的山友原路折返下山。</p>
        <figure>
            <img src="/images/mtlogs/001/05.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/001/06.jpg">
        </figure>
        <p>重回一年前鍛羽而歸的地方──孟祿亭。從玉山登山口到排雲山莊約８．５Ｋ的路程，如果要將中間分割成幾個休息點，那麼距離起登約１．７Ｋ的孟祿亭通常會是隊伍休息、整備的第一站。</p>
        <p>和台灣登山步道「觀音」、「奉茶」這類常見的涼亭名稱不同，這座孟祿亭的命名可說是別有用心且極具緬懷意義。孟祿亭中的「孟祿」紀念的對象是民國四十一年在玉山攀登過程中不慎失足，摔落崖谷而罹難的孟祿先生（J E Monroe）。因感念其對於台灣財金界的貢獻，當時省政府便於墜崖處附近建蓋一座涼亭，並取名孟祿，以紀念這位因意外逝去的美國財金專家。</p>
        <figure>
            <img src="/images/mtlogs/001/07.jpg">
        </figure>
        <p>雖說包含孟祿先生在內，早年玉山時不時傳出意外，奪走許多有為的生命。但反過來說，也因為這些先烈的犧牲，促成今日玉山愈趨完善安全的登山環境。如今的玉山步道，不僅是每一位台灣登山者趨之若鶩的目標，貴為東北亞第一高峰，儼然也已是外國山友紛沓前來拜訪的國際性山峰步道。</p>
        <p>即便是略具危險性的地形，也已架設好繩索或欄杆確保安全性，除了部分融雪讓棧道有些濕滑，我們一路走來四平八穩，走累了就席地而坐，欣賞怎麼看都不會覺得膩的山景。在藍天與殘雪的相互輝映下，我們甚至認為即便明天天候不佳登不上玉山，光是今天這段往排雲山莊的經歷，就已經十分篤定不虛此行。</p>
        <figure>
            <img src="/images/mtlogs/001/08.jpg">
        </figure>
        <p>之所以會先打「明天天候不佳登不上玉山」的預防針，在於每當我們離山上越近，主峰方向的雲層就越更厚一些，當行至５Ｋ左右的西峰觀景台（白木林亭）時，玉山主峰高聳突出的山頭已泰半隱沒在陰白之中。本來，天氣預報的回暖天氣也只維持到今天，明天開始將又會是另一波寒流南下，屆時高海拔山區都有不低的降雪機率，這也是我們出發前始終處於躊躇狀態的最大隱憂。</p>
        <figure>
            <img src="/images/mtlogs/001/09.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/001/10.jpg">
        </figure>
        <p>但是這份擔憂在抵達排雲山莊時似乎又顯得多餘，我們早上八點自玉山登山口出發，奮戰了五個多小時，於下午一點左右平安抵達山莊，太陽毫無掩飾地朝我們展露熱情，身體頓時產生一股又乾又冷又熱的奇妙感覺。比起數年前曾經造訪的天池山莊，排雲山莊規模雖然略小一些，卻也足夠稱得上是豪華山屋了，這兩座在岳界並列五星級的山莊，不僅落成時間早至可追溯到日治時期，經歷多次整修改建，才有今日充滿現代風格的嶄新面貌。</p>
        <p>至於排雲山莊名稱的由來眾說紛紜，有一說是早年台灣岳界「四大天王」刑天正、丁同三、林文安、蔡景璋四人，在某次相約攀登玉山的過程，在這棟廢棄的建築物歇腳時，臨機而動為其命名「排雲」；另一說則比較依循歷史根據，指排雲山莊前身為日治時期政府蓋設的「新高下駐在所」，後來國民政府接管，改建為提供登山客住宿的山莊，並因山莊時不時能瞭望有如排山倒海而來的雲海，遂以「排雲山莊」稱呼。</p>
        <figure>
            <img src="/images/mtlogs/001/11.jpg">
        </figure>
        <p>２０１３年改建完成的排雲山莊已應有盡有，基礎醫療設施完善，用電也有太陽能供電系統供給，床位更是由過去雙位數提升到一百一十六個名額。只可惜想登臨玉山的訪客實在太多，再多床位依然供不應求，總是可以看到預約網站上，開放預約的一個月期限內，不分平假日總是掛著「額滿」兩個字，底下的「排隊預約」的數字有時甚至超過排雲山莊本身可容納的床數。猶記得之前抱著無聊心態上去玉山宿營地網站觀看排雲山莊七、八月旺季的申請數量，週末的排隊預約人數竟來到三千多人！下巴差點要垂降到地面上，瞠目結舌之餘，也不禁感嘆東北亞第一高峰的魅力竟恐怖如斯。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <h2 v-text="catalog[3].title"></h2>
        <p>抵達排雲山莊第一件事情就是去櫃台進行身分登記，確認房間與床位，報到過程中我們從莊主口中得知，今日入住排雲山莊的人很少──原本冬季就不多的申請人數，因為明日寒流侵襲的關係，導致又有更多人打退鼓，今晚山莊的住宿客估計不會超過三十人......任凡身經百戰的登山客皆不喜歡擁擠，但我們又應該感到高興嗎？其實我們也不知道。總之先就櫃卸下背包，找了個可以曬陽光的位置稍作休整，打算一會兒後啟程去蒐集玉山西峰這座百岳，再來重新檢視明天的原訂計畫。出發前，平時鮮少爬山的其中一位友人突然表示自己膝蓋和大腿不舒服，可能需要留在排雲山莊回血。於是前往西峰撿山頭的任務，剩下我和另外一位友人執行。</p>
        <figure>
            <img src="/images/mtlogs/001/12.jpg">
        </figure>
        <p>以排雲山莊為中心，往玉山西峰的山徑與前往主峰方向的步道相反，雖然爬升有落差，但總里程差不多，玉山西峰距離約２．２Ｋ，玉山主峰則約２．４Ｋ左右。當我們通過山莊人員宿舍時，管理員還貼心囑咐記得要在晚飯前回返，而同一時間前往玉山西峰除了我們兩人，還有另外兩位年約半百的大哥，不過從寒暄中得知他們只是散步，到不到的了西峰則隨緣。不一會兒，我們兩組人變拉開了差距，而之後往返西峰路途間再也沒遇見其他山友。</p>
        <p>雪季，所見之處皆美得目不暇給，卻也使得總是人聲鼎沸的玉山群峰變得孤寂。</p>
        <figure>
            <img src="/images/mtlogs/001/13.jpg">
        </figure>
        <p>在一處視野遼闊之處展望玉山主峰，已依稀可見山頭左側小風口一帶搭建的防風廊道，也就是山友俗稱的「鐵籠子」，鐵籠子前後延伸所勾勒的之字形折線，便是登山者匍匐攀上第一高峰的朝聖之路。</p>
        <p>由於海拔已破三千、大多行走在林蔭下，再加上時間逐漸接近傍晚，即便太陽依舊在藍色布幕間閃耀，而我們也曾未怠慢過腳步，身體卻也漸漸無法驅散前仆後繼蠶食而來的寒意。一身輕裝的我們，一度懊悔應該要大背包一塊兒上肩行走，最起碼背後還有個東西可以抵禦後方的冷空氣大軍。</p>
        <figure>
            <img src="/images/mtlogs/001/14.jpg">
        </figure>
        <p>所幸在我們開始感到支絀之前，便看到刻有「玉山西峰」字樣的鐵牌立在平坦腹地某棵大樹下方，這座滿覆台灣鐵杉，標高３５１８公尺，腹地寬闊的山頭便是此行造訪的第一座百岳──玉山西峰。</p>
        <p>玉山西峰的峰頂幾乎被鐵杉遮覆，展望不佳，但對大多數有做功課的人而言，來西峰也不單只是想蒐集這座百岳就完事那樣簡單而已，玉山西峰最大的特色，在於距離其山頂一百多公尺的山神廟。我們常聽到有人談論全台灣最高的便利超商在哪裡，但若要說到全台灣海拔最高的廟宇，這座位處玉山西峰峰頂西南方的山神廟恐怕是當仁不讓了。該山神廟的前身，乃是日治時期保留下來的「西山神祠」，西山是過去日本人對玉山西峰的稱呼，神祠指的就是日本神社。過去日本政府曾在玉山、雪山等高山設立神社，作為登山者祈求平安之途，但是在二戰結束日本敗撤，國民政府接管台灣後，因皇民化運動在本島廣設的神社幾乎都被拆除，當然也包含了這些高山神社。而我們現在看到的西山神祠，其實是後來玉山國家公園仿日式建築重新建立的廟宇，雖然無法復刻歲月積累遺留的滄桑，卻也重新喚起人們對西峰昔日的點點滴滴。</p>
        <p>說了這麼多，我們在三角點拍完照後並沒有繼續前往西峰神祠！這並非當下我們不曉得這座山神廟，而是因為實在是挺不住寒冷，只想趕快在相機留下自己與西峰的合影然後返程，連短短一百公尺都不想挺進，由此可想而知當下有多寒冷，當然也不排除是我們不耐寒的因素啦。但是如果現在問我們會不會後悔當時沒多堅持那一百公尺......答案顯而易見為「ＹＥＳ」。不過已經過去的事後悔也沒有助益，就當作刻意多留給自己一道下次再訪玉山群峰時的動機。</p>
        <figure>
            <img src="/images/mtlogs/001/15.jpg">
        </figure>
        <p>雖然寫這篇文章當下，排雲山莊已經更換別的經營團隊，供餐也有很大的改變。不過回到２０２１這年，盛裝膳食的容器仍是陶瓷盤子而非現在的鐵盤，晚餐開飯的表定時間為五點，時間一到，山莊工作人員便有如學生時代打飯班，排排站好為飢腸轆轆的登山客打上飯菜，至於味道......就別苛求了吧，稱不上美味，但也絕對不到難吃的地步，考量深山補給不易，對我來說能吃出食物本身的味道，又能吃飽其實已經很滿足了，只要價位不要太誇張就行。但有一說一，甜湯很好喝，最後還裝滿保溫瓶準備留到明天飲用。</p>
        <p>如果無法接受山莊訂餐是自助餐的品質，賣的卻是簡餐的價位，要自己準備食物或背食材上山炊煮也可以，但排雲山莊規劃的自煮區範圍不大，如果同時間自理的隊伍數量多，可能得多等候一些時間，或是盡可能擠出空間，無論如何，用餐品質和花錢向山莊訂餐的人肯定有落差。</p>
        <p>這趟玉山行的首日，在最後一支來自菲律賓的登山隊，入夜後陸續從玉山主峰返回，獲得眾人鼓掌迎接的熱鬧氛圍裡，歡樂地畫下了句點。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <h2 v-text="catalog[4].title"></h2>
        <p>明明天漸漸光，卻絲毫感受不到同寢室裡的山友有打算下床梳理、整裝的意思，至於箇中原因，其實大家也都了然於心。這個半夜的排雲山莊凍到幾乎沒有人睡得安穩，睡袋翻來覆去的摩擦聲此起彼落，遠遠蓋過任何一道鼾聲。縱使我鑽進睡袋前就先拿出備用的小白兔暖暖包，整個晚上也幾乎完全感受不到它的作用，寒意如同頑劣的小惡魔，時不時想往睡袋的空隙裡鑽。</p>
        <p>好不容易熬到預定起床時間，搖了搖睡在隔壁床位的友人，問：要衝嗎？五秒、十秒......「好」。於是，我們像羽化失敗的毛毛蟲，苟延殘喘地從睡袋裡蠕動出來，把所有能穿上的發熱衣、外衣、外套通通往身上包，硬梆梆地爬下床鋪，去大廳一邊吃早餐，一邊整頓裝備。莊主看見我們三人似乎有意上山，便湊了過來關心，聊天過程中得知昨晚山莊外面下起了冰霰，主峰步道可能會結霜，但莊主表示結冰程度應該還不至於影響登山，建議我們如果要上山，出發前記得把冰爪套上即可。</p>
        <p>時間剛過清晨六點，走出山莊門外，迎面吹來的風已經不能用冷冽形容，而是一種穿透骨髓的刺痛，冷冽寒氣彷彿一把尖銳的手術刀，強行將我們的肺部剖開。瞧了瞧掛在牆壁上的溫度計，是今生親眼首見的零下負四度。</p>
        <figure>
            <img src="/images/mtlogs/001/16.jpg">
        </figure>
        <p>通過管制站與步道銜接的我們，上一秒還在幹譙這也未免太凍寒，下一秒卻又馬上被映入眼簾的光景震攝──儘管還不到百分之百的雪白，但極致單調的白色幾乎已將原本土黃、林綠色調吞噬過半，搭配陰沉的天色，前方頓時充斥著詭譎、令人不安的氣氛。然而，我們似是已受到蠱惑，任由冰爪踩在結了一層薄冰的木棧步道上，發出嘎吱嘎吱的聲響，驀然回首，排雲山莊已消失在視線中。</p>
        <figure>
            <img src="/images/mtlogs/001/17.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/001/18.jpg">
        </figure>
        <p>途中，一位頭套毛帽，身上只穿著一件羽絨外套，什麼也沒背的大哥從步道上方悠悠地走了下來，一看就知道是個狠人。不出所料，他是排雲山莊值班的巡山員，一早上山查看步道狀況並回報是他們的例行公事之一。簡單向其請教前方路況，表示路徑還算明顯，不過上面正在下冰霰，提醒我們要多加留意，不要勉強上山。另外根據他的描述，在我們之前還有一組人也嘗試攻頂。</p>
        <p>看樣子我們也不孤單嘛，原本還想著今天該不會只有我們三個蠢蛋不顧寒流還堅持登頂吧？</p>
        <figure>
            <img src="/images/mtlogs/001/19.jpg">
        </figure>
        <p>雖然都是「冰」，但依據形成過程不同，才會衍生出諸如霜、雪、冰霰......等不同的名稱。附著在植物上的冰晶一般稱為「霧淞」，當然也不侷限於植物，只要過冷的水點撞擊在物體表面上迅速凍結，形成白色或乳白色不透明冰粒聚積物，就可以稱之為霧淞。雖然形狀看起來和「霜」雷同，不過霜是水氣遇冷凝華而成，形成過程恰好與霧淞相反。</p>
        <figure>
            <img src="/images/mtlogs/001/20.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/001/21.jpg">
        </figure>
        <p>越往上走，結冰的程度也越浮誇，顏色也越來越單調。我們彷彿穿越回黑白膠片時代的電影世界，不知來自何方的冰霰，正一點、一滴剝奪我們身上的顏色，將我們裝扮與場景相襯的默劇演員，至於言語，早已為呼嘯的飂冽風聲所掩去。</p>
        <p>仔細想想，此時我們正在朝台灣海拔最高的地方前進，對於首次攀登玉山的我們而言，每一步都在刷新個人海拔記錄。雖然，其中一名兼任領隊的友人已經登頂過主峰兩次，此行已是他的第三回玉山主峰巡迴之旅，理論上應該有一定熟悉程度，然而這片白銀世界反倒令他感到陌生，可是與此同時卻又覺得新鮮有趣，同樣的路，不同的季節，不一樣的感觸。</p>
        <figure>
            <img src="/images/mtlogs/001/22.jpg">
        </figure>
        <p>多數分享經驗的前人們通常都會說來到大鐵籠，意味著距離峰頂也不遠了，可說是前往玉山主峰最後一道關卡，但通常這裡也是這２．４Ｋ中最磨人的路段之一。這處風口位於主峰與西峰之間，因地形關係，風會沿著縱谷順勢北上，帶來強勁風勢，加上山徑狹小，在過去鐵籠還未蓋設的時代，時不時發生墜崖意外，後來有關單位在此處建造鐵籠，以確保登山者安全。</p>
        <p>雖然毫無來由，但是當我穿越風口大鐵籠的時候，腦海裡浮現的是上古歐洲時期，穿著盔甲的騎士在冰天雪地裡蜷縮著身軀前行的畫面，他的任務是什麼？欲往何方？又將遭遇什麼樣的際遇呢？一切任憑想像。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[5].id">
        <h2 v-text="catalog[5].title"></h2>
        <p>猶記得距今十年前的大學時期，也恰好是我們三人，暑假一到便騎著野狼去環島，出發前得知有颱風要掠過南臺灣，但我們年輕氣盛，並未因此取消計畫，而是決意和颱風拚個你所我活......當然這樣講是有些過於誇大，其實一方面也是因為氣象局認為這個颱風是個擦邊球，移動速度又快，估計為台灣帶來的影響不會太長，所以我們便想，只要撐過頭一、兩天的南部行程，到東部即可平步青雲，就結果來說也一如氣象局預期，颱風影響台灣天氣的時間很短。</p>
        <p>然而，錯就錯在我們低估其挾帶的雨勢，颱風是走的很瀟灑，卻甩了一大盆的雨給南台灣，我們騎在通往恆春唯一要道的台一線上，不斷地被車輛疾駛而過所濺起的水花洗臉，與其說是水花，不如說幾乎是一道道水浪，才甫被潑滿一身，下一道水浪又隨即撲打上來，我們三人三狼，特是狼狽。</p>
        <p>後來我們決定在台一線海濱的某間景觀餐廳稍做休息，直到店員將菜單遞來，這才發現這間店的名字，就叫做「三個傻瓜」。我們三人見著立即哈哈大笑起來，純屬湊巧？我們不這麼認為。一直到今天，三個傻瓜的事情仍偶爾會在茶餘飯後的閒聊中再次提及，當年的我們確實又蠢又傻，但那段經歷如今想來卻又彌足珍貴。</p>
        <figure>
            <img src="/images/mtlogs/001/23.jpg">
        </figure>
        <p>鑽出狹長的大鐵籠，我們愣愣看著前方無比巨大的冷凍庫，昔時「三個傻瓜」的記憶，又再次連滾帶爬地浮上心頭。山徑幾經為白花花的冰霰覆蓋，幾乎無法辨識路徑延伸向何方，甚至也不敢確定現在腳下踩的，是國家公園鋪設好的石階步道，還是未經琢磨的古老岩層。直到我們循著與風交響的鏗鏘聲中，摸到凍如桿棍的鐵鍊，這才確信腳下所踩的應該是安全的路徑。</p>
        <figure>
            <img src="/images/mtlogs/001/24.jpg">
        </figure>
        <p>在天寒地凍之前，一、兩雙手套也不過是杯水車薪，雙手指尖的知覺早已分不清楚到底是凍還是痛。我們不斷精神喊話鼓舞自己，距離主峰峰頂只剩下不到兩百公尺，只要再撐一下下就到了。沒有想要觸霉頭的意思，但突然想起以前看過一些山難記錄片，很多登山家的罹難，原因不外乎一種在外人眼裡看來毫無意義的「堅持」，但此刻換做自己處於瀕臨極限的環境時，需要付出多少理性，才能毅然抹煞去先前累積的九十九公里努力，坦然放棄眼前僅剩的最後一里路？也許我們還沒到達真正絕境的程度，雖然巴不得想馬上下山，但那也是成功登頂之後再來考慮的事情。有趣的是，儘管滿嘴幹意，但我們偶爾還是能擠出一口黃牙說說笑笑，令這片白茫茫的悲慘世界，增添一些些違和感。</p>
        <figure>
            <img src="/images/mtlogs/001/25.jpg">
        </figure>
        <p>當路徑逐漸趨緩，抬頭再也看不到高於自己眼線的岩壁時，山頂的石碑已堅毅地矗立在正前方。</p>
        <p>２０２１年１月１１日８時４０分，我們終於成功登上玉山主峰，成為當下全台灣陸地上最靠近天空的男人。儘管聲音很快就淹沒在紛飛的風雪之中，但我們仍情緒激昂地發出一聲又一聲的吆喝，像是餓虎撲羊般猛烈撲向玉山主峰的銘刻大石。</p>
        <figure>
            <img src="/images/mtlogs/001/26.jpg">
        </figure>
        <p>台灣第一高山、東北亞第一高峰、百岳之王、五嶽之首、台幣千元大鈔的背面象徵......在中小學地理課本裡，關於玉山之介紹早已是背得滾瓜爛熟，雖然有時會發現民間一些介紹山岳的書籍或網站岳，將一些比較不為常人所知的山岳介紹地十分詳盡，與之相較玉山卻只有用寥寥幾行文字撇過，還以為是否玉山就只是座徒有虛名卻缺乏內涵的高山。但事實上，許多原住民族群將玉山奉為聖山，且數百年前就曾有外國探險家造訪的記錄，玉山的歷史底蘊從來沒有稀缺過。正因為大家對玉山太熟悉了，所以已經不需要透過大量的文獻引述，去加深普羅大眾對這座山的認識。</p>
        <p>而在登山界裡，談到玉山就不能不提及名聞遐邇的「玉山群峰線」，３９５２公尺的玉山主峰，乃玉山群峰中裡的其中一座山峰，因百岳評比之故，大多講述玉山群峰的行程，或分享玉山群峰相關攀登經驗時，大多會以「前五峰」、「後四峰」的集體共識劃分相稱。前五峰係指玉山前、西、主、北、東等五座名峰，後四峰則是指玉山南峰、南玉山、東小南山、鹿山四座，總計這九座皆是台灣登山岳界「四大天王」林文安先生等人於１９７０年代評選的一百座山岳──簡稱「百岳」的名單之選，而除卻這九座百岳之外，另外還有玉山北北峰、小南山的名字偶爾也會加入在討論的話題裡面，合稱「玉山十一峰」。</p>
        <figure>
            <img src="/images/mtlogs/001/27.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/001/28.jpg">
        </figure>
        <p>三個傻瓜的故事，於今日再添新頁。</p>
        <p>雖然很想留下三個人同框的合影，但無奈待了好一陣子都沒遇到其他組山友上山，驀地想起巡山員曾說有一組人在我們之前上山，可我們始終都沒有遇到這組人，難道是轉往北峰或東峰去了？就算想用自拍但山頂風勢又非常猛烈，我們只好打消念頭，兩兩一組輪流拍照留念後，即準備返程下山。千萬別以為登上山頂就算成功，只有平安返回到家，才能毫無顧忌地宣布整趟登山行程完滿結束。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[6].id">
        <h2 v-text="catalog[6].title"></h2>
        <p>原本很想再多逗留一會兒的，可是見風雪有逐漸加大力道的傾向，且名為白牆的猛獸凶神惡煞地盤旋於我們四周，彷彿一旦這方伸出五指就會立刻被吞食似的，突然間雲消霧散露出大景什麼的看是希望渺茫。考量到回到登山口也還有十多公里要走，最終台灣最高男人寶座的位置我們只霸佔了二十分鐘，於九點時分準點啟程下山，待未來春暖花開之時，再回來飽覽四方峰巒。</p>
        <figure>
            <img src="/images/mtlogs/001/29.jpg">
        </figure>
        <p>回到大鐵籠銜接主峰與北峰步道的三岔口，積覆在指示牌與鎖鏈上的霧淞看起來又更厚重了些。即使在百岳等級分級中屬於初學者適宜的Ａ級路線，無論是玉山主峰還是玉山北峰，一旦在霜雪覆蓋的惡劣環境下，都顯得異常凶險。</p>
        <figure>
            <img src="/images/mtlogs/001/30.jpg">
        </figure>
        <p>可能是暴露在寒冷低溫下太久，又或者前日沒有充分獲得恢復，昨天因為身體不適沒有跟隨我們前往西峰的友人，在剛離開山頂沒多久，便表示自己膝後側疼痛感有越來越顯著的徵兆，儘管看上去還能走路，在下踩石階時卻已可以看到他略感吃力的模樣。然而，此刻我們身上也沒有攜帶藥物，且亦找不到合適的地點停下來幫他進行治療，我們當下能做的也只有放緩步伐，讓他夾在我和另一名友人中間，減少他會因為為了緊著我們隊伍，勉強自己加速行走進而導致傷勢變得更劇烈。總而言之，一切等回到排雲山莊後再做打算，也不知道該不該說是幸好，反正在那之後他的膝蓋一直維持在要爆與不爆之間的微妙狀態，安全地回到排雲山莊。</p>
        <figure>
            <img src="/images/mtlogs/001/31.jpg">
        </figure>
        <p>隨著海拔下降，我們身處的世界顏色又逐漸變得多采多姿起來。在返回排雲山莊過程中，我們還遇到另外兩隊試圖上山的勇士，其中一支多人隊伍看上去裝備精良、經驗豐富，要成功登頂應該不成問題；但另外一組情侶檔恐怕就沒那麼樂觀了，女方臉色幾乎與慘白的山色融為一體，腳步也比一般人步伐來得遲緩......只是看著她無比堅毅的眼神，已經經過洗禮的我們，自然也就理所當然地投以打氣與祝福。</p>
        <p>如果是電影情節，當我們回到排雲山莊時，或許可以沐浴在山屋內所有人英雄式的歡呼聲中吧！但真實情況其實是脫鞋脫冰爪後進入山莊，喝點熱水，休息，然後收拾行李，與莊主道別，一切是如此普普通通。當然，也是有些山友得知我們從主峰回來後，投以此起彼落的欽佩與感嘆，或向我們索要照片讓他們一探主峰峰頂的最新畫面。</p>
        <p>離開山莊前曾發生一段小插曲，那就是我們在大廳要幫膝蓋部位疼痛的友人噴肌樂的時候，恰好被櫃檯的山莊管理員看見，並直言在山上噴這些藥劑沒有效果，反而要友人拉拉筋多休息，並熱心傳授幾招伸展技巧。姑且不論有沒有醫學根據，只是我們今天就得下山了，休息時間有限，需要一些立即見效的應急措施，但是也不好意思當著莊主的面，把他的建議當耳邊風，最後決定先餵友人吃止痛藥看是否能起作用。</p>
        <figure>
            <img src="/images/mtlogs/001/32.jpg">
        </figure>
        <p>也許知道這幾天有寒流，加上是星期一平日，感覺今天要去排雲山莊住宿的登山客比昨天又來的更少了，幾乎都是隔一大段路，才會遇到一組人馬，偶爾摻雜幾名勇敢的獨攀客。在隊伍交會慣性的寒暄裡，最常聽到的除了業界默契的「你好」之外，就屬「上面天氣如何」這句話。明天會不會放大晴我們不知道，但如果明天也是像今天早上所經歷的這番絕美，我想，反而會比尋常大景來得更加觸動人心。</p>
        <figure>
            <img src="/images/mtlogs/001/33.jpg">
        </figure>
        <p>距離登山口越來越近，溫度也慢慢提升上來，雖說最高溫度依舊是寒冷的個位數，但神奇的是絲毫都不覺得寒冷，甚至體感還有一點點熱......或許，這是數小時前如夢似幻的絕美經歷，能讓我意識到這一切都是實實在在發生過的僅存證明。</p>
        <p>可是對於膝蓋受傷的友人來說，恐怕就沒這麼多閒情逸致想這些有的沒的了。因為步調放得很緩慢，直至下午兩點鐘時，我們才剛離開西峰觀景台不久，由於三人都沒搭過接駁車，不了解末班車時間以及搭乘規則，對其資訊所知極少。於是後來決定，由腳程比較快的我先行一步，看是否能確保車輛，等待另外兩人下到登山口後，能立即搭接駁車回到上東埔停車場，直接免去三公里的馬路路程，同時也能減輕受傷友人的身心負擔。</p>
        <p>但這種作法也只僅限於像玉山步道這樣難度等級低、安全係數高的路線，且又是特殊狀況才「勉強」可用，不然以登山安全常規裡，「分隊」是極度不安全的作法，甚至可以說是登山一大禁忌。網路隨手一搜山難事件，一半原因可能來自於登山者本身準備不足，另一半原因則往往來自罹難者脫離大部隊而導致。</p>
        <figure>
            <img src="/images/mtlogs/001/34.jpg">
        </figure>
        <p>固然有風險，這方還是順利於下午三點安全返抵登山口，但是當撞見一輛救護車停在登山口正前方，心頭不由得驚了一晌，趕緊傳訊息關心友人。叮咚一聲，傳出去的訊息不一會兒就收到回覆，訊息另一端的兩位事主表示自己正安然無恙地在孟祿亭休息，等菸抽完就會繼續上路，聽完這番話頭頂立刻畫下三條線，這邊開ＴＵＲＢＯ渦輪加速快馬下山，結果你們還好整以暇在上面哈菸......但轉念想想，至少確定人沒事就好。</p>
        <p>後來詢問了一下一旁待命的員警，他說有山友在往玉山前峰的石瀑上，不知道是頭去撞到還是被石頭砸到頭，反正就是頭部受創，接獲通報所以緊急過來救援，疫情肆虐的這幾年，山難救援案件次數爆增，著實辛苦這些救難人員。員警反問我有沒有遇到救難人員與受傷的山友，由於最後幾公里自己很專注在行走上，並沒有一一留意擦肩而過的山友們，但回想起經過玉山前峰登山口後，山友也確實比較多一些，模糊印象中曾聽到他們自稱是一日玉山前峰往返的健走團，儘管如此，也依然沒有任何遇到傷患的記憶。很抱歉，幫不上忙。</p>
        <figure>
            <img src="/images/mtlogs/001/35.jpg">
        </figure>
        <p>在那之後一輛接駁車駛了進來，向司機確認每隔半小時就會有一班接駁，最晚發車時間在六點半，以人頭數計價，一人收一百元等資訊後，接下來就只顧著和原住民出身的司機閒聊，沒注意到暢談過程中，救護車已經接走傷患下山去了。冬季尤其是下雪天，然後又是平常日，接駁需求可說少之又少，司機要我先坐到車上等人，會等我的朋友全到齊後再發車，不得不說絕大多數原住民都蘊含著溫柔體貼的內心，所謂「鐵漢柔情」用在他們身上極為貼切。</p>
        <p>一個小時後，兩名友人也風塵僕僕地平安返回登山口，雖說回到家才是真正的平安登出，但此刻我們已按耐不住將圓滿兩個字掛在嘴邊高頌。</p>
        <p>縱然這兩天發生很多突發狀況，很多事情也都不如預期般順利，不過我們三個憑藉一股傻勁，終於成功解鎖了三件視為台灣人人生必須要做的事之一──「攀登玉山」。隨著年紀增長，或許未來我們聚首的頻率間隔會越來越長，但是曾經一起瘋狂過的足跡，肯定會突破南北距離限制，始終串聯著彼此。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>