<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '序、楔子' },
    { id: 1, title: '壹、加里山山脈' },
    { id: 2, title: '貳、鹿場出發' },
    { id: 3, title: '參、雲端上的聖稜線' },
    { id: 4, title: '肆、迷霧森林' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="2" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <h2 v-text="catalog[0].title"></h2>
        <p>南賽夏族的聖山──加里山，位於苗栗縣泰安鄉與南庄鄉之間的交界，坐擁「山城」之稱，苗栗縣內山多平原少，在清朝光緒年間的《苗栗縣誌》山川篇曾寫到：「三台山，俗稱嘉璃山，距城東五、六十里，其山高數百丈，在內山，溪東生蕃居之，人不可到」其中「三台山」指的便是加里山。如果從苗栗市區往東眺望，會看見東方的山脈山巒疊起，層次分明。以墨硯山作為山脈的第一層，是為「底臺」，然後是第二層「中臺」的八角崠山，最後則是最高臺的加里山山脈，苗栗八景中的「三臺疊翠」，所指便是如此。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <h2 v-text="catalog[1].title"></h2>
        <p>翻開國中地理課本，有關課文對我們所居住的這坐高山島山脈介紹，依北到南大致區分為：雪山山脈、玉山山脈、阿里山山脈、海岸山脈，以及貫穿南北的中央山脈，事實上這其實是涵蓋大範圍的劃分法，這些山脈其實還有許多亦可獨立視為一條山脈的分支，加里山山脈即為其一。</p>
        <p>根據「台灣地質第四紀之父」林朝棨先生沿用富田芳郎先生對台灣地理分區方法，將台灣西部衝上斷層山地分成南北兩段，加里山山脈為北段之山脈，北起鼻頭角，南至南投縣名間鄉、集集鎮一帶的濁水溪北岸，全長約一百八十公里，由於位於雪山山脈以西，所以許多教科書會將其併入雪山山脈的一部份。不過實際上加里山山脈與雪山山脈的地質有些差異，前者地質以砂岩、頁岩等較年輕的沉積岩構成，而後者則以板岩為主，因此有些學者認為，擁有相同性質，並且就是西部衝上斷層山地南段的阿里山山脈，既能獨立為一條山脈，那麼加里山山脈理論上亦應自成一格。</p>
        <p>林朝棨先生──這位在台灣考古與地質學界皆有巨大貢獻，基本上只要是就讀相關學系的後代學子，應該沒有人不知曉他的名字。而另一位上述段落中提到的富田芳郎先生，則是日治時期在台灣研究島上聚落地理，同樣為台灣地理帶來豐厚貢獻的重要人物，高中社會組耳熟能詳的「北部多散村，南部多集村」便是出自其論述，他也曾經和鹿野忠雄等知名學者，共同參與台灣高山冰斗形成之研究。</p>
        <figure>
            <img src="/images/mtlogs/002/01.jpg">
        </figure>
        <p>雖然拍攝這張照片的位置不在苗栗市區，但是同樣可以見識到加里山山脈與周遭群峰交互層疊的壯闊模樣。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <h2 v-text="catalog[2].title"></h2>
        <p>加里山在現今登山界已經是夯到不行的小百岳，每逢例假日前來攀爬者眾多，亦開發出多條不同的登山路線，其中最熱門當屬從鹿場部落出發的鹿場線。</p>
        <figure>
            <img src="/images/mtlogs/002/02.jpg">
        </figure>
        <p>礙於出發時間較晚，抵達登山口時已經是接近正中午的十一點多，但也因為如此，我們才能意外地在「座無虛席」的停車位中，恰好銜接一輛已經完登準備下山的車輛所遺留的空位。</p>
        <p>根據網路資料記載，鹿場部落不僅號稱苗栗縣內最偏遠的部落，也是台灣山地部落裡年代距離現代較近的一座部落，雖說接近，但也已是距今將近兩百年前的歷史了。據說鹿場部落位置原先是一片茂密的森林，早年原住民狩獵時追趕野獸來到此處，發現該處鹿群數量繁多，爾後便陸陸續續有來自新竹五峰鄉的泰雅族族民遷徙至此定居，是為久布斯社，也就是鹿場部落的舊名。再後來漢人開墾來到這裡，同樣對此地數量龐大的山鹿十分有感，故稱此地為鹿場，於是名字便一直沿用迄今。</p>
        <figure>
            <img src="/images/mtlogs/002/03.jpg">
        </figure>
        <p>甫進入山徑，筆直參天的柳杉林樹群便迎面而來，山走多了，基本上就知道這些柳杉林出自於人工栽植之手，就如同八仙山、馬崙山等，都曾有一段作為輸出林木的林業繁盛時光，加里山林業興盛可追溯至日治時期，當時苗栗南庄一帶是著名的樟腦產出地點，如果有聽過「樟之細路」，相信應該對此並不陌生。而加里山緊鄰南庄，杉木林資源豐富，所以日本人便於加里山與哈勘尼山之間設置林場，並建設運送索道，以台車將砍伐下來的木材運出加里山，到現在，多少還是能在加里山登山步道上找到荒廢的鐵軌遺跡。</p>
        <figure>
            <img src="/images/mtlogs/002/04.jpg">
        </figure>
        <p>一直到加里山山頂，整路時不時都會在高聳入雲的柳杉林林間穿梭，對於喜歡拍攝矗立在群樹下方營造出壯闊廣的人而言，這裡簡直是取景天堂。</p>
        <figure>
            <img src="/images/mtlogs/002/05.jpg">
        </figure>
        <p>當然加里山熱門之處不僅止於此，除了穿越柳杉林，過溪、攀岩、瞭望遠景一應俱全，從鹿場登山口起登單程短短４Ｋ的里程數中，幾乎把登山會遇到的大部分地形、還有想目睹之景物通通都濃縮在一塊兒，毋須小百岳名號加持，加里山就已坐擁足夠資本位列台灣名山之一。</p>
        <p>我們踩著巨大石塊跨過的這條溪流名叫風美溪，為鹿場部落另一個知名景點「神仙谷」的上游，神仙谷原先是鹿場部落泰雅族族人祖先的墳場，又稱死亡谷。近年來因電影《賽德克‧巴萊》曾於神仙谷拍攝取景，故而聲名大噪，吸引許多遊客前來朝聖。</p>
        <figure>
            <img src="/images/mtlogs/002/06.jpg">
        </figure>
        <p>約莫走了一小時半，來到避難山屋，避難山屋除了提供緊急救避難用途之外，同時也是鹿場登山口與另一個主流登山口「大坪線」的交會處，距離加里山山頂大約剩下三分之一的路程（以鹿場線計算），從這裡開始往加里山山頂的爬升高度將會越來越陡峭，拉繩和攀岩地形也陸陸續續增加。</p>
        <figure>
            <img src="/images/mtlogs/002/07.jpg">
        </figure>
        <p>不知何故，我們來爬的這天，小朋友特別多。後來從一些父母的口中才得知，加里山在商業取向的山社行程裡也非常熱門，他們就是透過商業團報名跟團來爬山的，只是有些出乎意料地不太好爬。對我們大人來說，部分高低落差比較大的攀岩地形也許蹬一下就上去了，但對小朋友而言明顯就吃力許多，尤其前一天還下過很大的午後雷陣雨，樹根和岩石都還處於濕濘未乾的狀態，十分不易踩踏，很多時候他們就像有生命的大背包，從兩個大人之間被硬拖上去。</p>
        <p>雖說從小培養孩子親近山林的習慣是好事，但看著小朋友卡在岩壁一邊哭喊著不敢爬，卻又騎虎難下，不管是要上山還是下山的其他山友們都只能站在原地陪鼓勵的窘況，難免心中對商業團為了賺錢，而罔顧團員負荷能力與其他山友登山品質的行為，產生那麼一些負面觀感。</p>
        <figure>
            <img src="/images/mtlogs/002/08.jpg">
        </figure>
        <p>值得慶幸的是，這些落差大的攀岩地形不多，當一腳蹬上最後一處落差大的岩區後，隨即撲面而來的是稜線上一望無際的大景，豔陽藍天也終於搶回被柳杉林、落葉林霸佔許久的制空權，這本應足以令艱苦一番的登山者們振奮地握起雙拳慶祝，但是真正讓眾人喜出望外的，卻是俯首可拾的雲湧白浪。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <h2 v-text="catalog[3].title"></h2>
        <p>雖然是後話，我們下山途中遇到一位打著赤腳，卻步伐飛快，目測約六十足歲的老大哥，他在超車之前曾和我們一邊閒聊一邊陪走了一段，聽到我們是第一次來造訪，直言這方很幸運，因為加里山的大景可遇不可求，看其熟門熟路的樣子於是順口反問他來訪的次數，彷彿這一路就是一直在等待我們提問這個問題，他聽到關鍵字便隨即露出自傲的笑容，回答自己已經爬了五十多遍，然後便抄捷徑一溜煙地不見人影了。</p>
        <figure>
            <img src="/images/mtlogs/002/09.jpg">
        </figure>
        <p>所以，當我們觸及加里山山頂，不僅收穫好天氣，山巒一望無際，延伸連綿到那傳說中的聖稜線都一併映入眼簾，可見我們有多幸運，但換個角度想，興許這何嘗不是山神精心安排的巧思？讓與山有緣的遊人站在加里山山脈的最佳視點，眺望遠方雪山、大小霸等百岳名峰相連勾勒出的聖稜線，用無限憧憬的情感填滿飄忽不定的遊心。</p>
        <figure>
            <img src="/images/mtlogs/002/10.jpg">
        </figure>
        <p>加里山海拔２２２０公尺，早期有三台山、嘉璃山等漢字別名，而在南庄當地原住民族賽夏族眼裡，則稱其為「比農意勇」，意指眺望最佳之山。加里山不止被周邊原住民族人視為聖山，放眼整個苗栗縣，亦認加里山為母親山，乃本縣的縣山。另外不知道何時開始，山界有前輩認為加里山山形宛如日本富士山，因此在現在很多網路遊記分享心得中，很常會看到以「台灣富士山」一詞作為加里山的頭銜，至於像不像嘛......就見仁見智囉。其實全台灣被冠以富士山名號的山岳也不止加里山一座，例如麻平暮山（馬海濮富士山）、鵲子山（礁溪富士山）、八里灣山（貓公富士山）、占山（淡水富士山）、雙峰山（苗栗富士山）......等，數量之多實在是族繁不及備載，據說會有此原因，係因為當年日本人占領台灣後，將思鄉之情投射在所見山頭，將酷似富士山的山岳通通冠上富士山名號。至於加里山是否也是基於此由，有鑑於日治時期加里山就已有定名，即使在那之前也曾有加祿山、加禮山、假里山等不確定是否同指相同山岳的名稱存在於文獻，但基本上都無法與富士山產生聯想，故台灣富士山稱號與昔時日本人應該可以推定沒有直接淵源。</p>
        <p>不管怎樣，分別被選入台灣小百岳（＃３４）、台灣百名山（＃１６）、台灣百步道（＃２６），有沒有富士山這麼響噹噹的名號，都不影響加里山在登山界的知名度，基本上若要選假日前往攀登加里山，不早一點出門可是會停車位一位難求。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <h2 v-text="catalog[4].title"></h2>
        <p>如果確定無法開早車去加里山，也別貿然像我們這樣較晚上路去接手早登歸來的人讓出的車位。根據鹿場部落當地原住民敘述，一旦時序進入下午，加里山山區有極高機率會起霧，如果沒有做好行前準備與路徑規劃，很容易會因為濃霧導致判斷失誤，進而迷失在山林裡。只要上網搜尋「加里山」，隨隨便便都可以整理出好幾則近期有關攀登加里山遭遇意外的救難新聞報導。</p>
        <figure>
            <img src="/images/mtlogs/002/11.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/002/12.jpg">
        </figure>
        <p>筆直參天的柳杉林裹上飄渺雲霧，和早上綠意盎然相比又別有一番滋味，神秘而魔幻。卻也正因為這些柳杉林乍看如出一轍，反而往往令那些疏於準備或粗心大意的登山客，不自覺迷失了方向......</p>
        <p>或許在部分人認知裡，台灣富士山之於加里山不過是穿鑿附會的說詞，無論如何，就像有些賽夏族人會更傾向將大霸尖山當作心目中的聖山，而非現代流傳的加里山，相同一座山，在不同人的眼裡，各自詮釋也許都不盡相同。真正最重要的，還是秉持著一顆尊重、敬畏之心，來看待自己拜訪、生活的每一座山。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>