<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：馬美道路' },
    { id: 2, title: '2K：李棟山莊' },
    { id: 3, title: '3K：李崠山' },
    { id: 4, title: '4K：李崠山古堡' },
    { id: 5, title: '5K：後記' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="3" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2021-04-20</strong></p>
        <p><span>行走總長：</span><strong>約 2.5 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 1 HR</strong></p>
        <p><span>路程總覽：</span><strong>李棟山莊 → 李崠山登山步道 → 李崠山古堡 → 李崠山</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>「莊院無燈等月照，山門不鎖待雲封」，敞開的入口掛著這兩句用亮紅色彩揮亳寫下的對聯，與外觀褪色老舊的木造建築物儼然形成強烈對比。它遺世獨立在馬美道路的深處，任由風聲鳥語在林間擺盪，沒有太多吵雜的人聲，每一道斑駁的痕跡，皆象徵它所經歷的歲月滄桑。這裡是李棟山莊，在尚未因為電影爆紅之前，它曾是新竹人口耳相傳的秘境；而對登山客來說，它則是口袋造訪名單中，必要佔據其中一個欄位的存在。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>縱使一出大馬路就能駛上國三高速公路，從台中龍井出發要前往新竹李棟山，仍需要耗費兩個多小時才能順利抵達目的地，原因無他，主要是進入新竹尖石鄉山區後的山路曲折蜿蜒，彼此距離一百三十公里的里程看似不長，卻因為山路迢迢而變得十分遙遠。上一次前往尖石鄉已經是多年前與大學好友騎車拜訪司馬庫斯的事情了，多年後再訪，不知道現況有什麼樣的改變？但想必應該很難有什麼巨大變化吧，山路維護不易，怎麼可能說變就變。</p>
        <p>開了很久的車終於到達宇老派出所──單車族、機車族、汽車族的休憩站，眼前所見基本上和記憶中的面貌相差無幾，唯一差別是今天是平日來訪，與當時過年期間人潮洶湧、門庭若市的盛況相比，此行顯得清幽許多。看著宇老派出所前方的岔口，意味接下來的路將會是嶄新的旅程，面向東方的右側道路，是通往秀巒、司馬庫斯的道路，若要前往李棟山，則要向左方道路駛進，也就是馬美道路。</p>
        <figure>
            <img src="/images/mtlogs/003/01.jpg">
        </figure>
        <p>別看一開始還有黃線區隔來車，便天真地以為馬美道路是一條寬闊的雙向車道，行至一處雙向馬路與旁側小路的岔口抉擇中，只能悵悵然選擇那條僅容一輛轎車通行的小道，這才是馬美道路的真身，爾後必須一邊左顧右盼地注意路況，一邊提心吊膽地提防會車。透過Ｇｏｏｇｌｅ地圖顯示，這條馬美道路最終會與桃園市復興區的產業道路相接，如果繼續往前走，則將銜接上貫穿東西兩部的台七線北橫公路。</p>
        <figure>
            <img src="/images/mtlogs/003/02.jpg">
        </figure>
        <p>駕車循著導航定位「李棟山莊」蜿蜒行轉，在體內的兔子快要不安分的時候，一棟外觀卻十分獨特的木造建築在過彎後探出頭來，這才終於鬆了一口氣，不過這棟工寮大小的建物並非李棟山莊，而是比較像景觀台或瞭望台這類的建築。出發前已經有先蒐集過有關李崠山與李棟山莊的一些資料，其相關資訊和歷史脈絡已有粗略的掌握，但由於大多是比較早年的資料與照片，所以當自己親身看到時的周邊道路與地面維護已充滿現代化的水泥與鐵製圍欄，與拓印在腦海裡的畫面一整個很不搭嘎。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>如果偶然經過此地，且沒有先蒐集過資料，也許會以為這棟搖搖欲墜的古老建築是一座廢棄的景觀民宿。事實上，李棟山莊一直到今天都還是有專人在維護。</p>
        <figure>
            <img src="/images/mtlogs/003/03.jpg">
        </figure>
        <p>李棟山莊的起源由一位高齡已臻鮐背之年，名叫朱萬鶴的老榮民，在五十多年前買下此地原住民的住家後，自己一手打造的鐵皮木製建築，因為背後緊鄰李崠山，時常會有登山客千里迢迢遠道而來，之後便擴建成山莊，提供山友住宿服務。</p>
        <figure>
            <img src="/images/mtlogs/003/04.jpg">
        </figure>
        <p>入內清潔費，一人二十元，早年則更便宜，僅收取十元。隨著年事增高，朱萬鶴先生於十幾二十年前決定結束山莊住宿的服務，改提供簡單的茶水與清水服務，一邊享受陶淵明般怡然自得的獨居生活，和偶爾來此的登山客閒話家常，如果你無法想像這幢搖搖欲墜的建築物怎麼能住的了人，看著琳瑯滿目的登山隊布條掛滿整個一樓穿堂的上方，也不難想像過去有多少登山隊伍曾經經過或於山莊借住過一宿了吧。</p>
        <figure>
            <img src="/images/mtlogs/003/05.jpg">
        </figure>
        <p>然而，２０１８年１１月，李棟山莊遭受祝融之災，朱老先生雖然平安無事，但因其年事已高，最終還是被轉請安置於新竹榮民之家，李棟山莊因此進入無人管理的荒廢期，直到後來蔡清郎──一位泰雅族母語老師，接手修繕李棟山莊破損的築體，成為李棟山莊第二任莊主，李棟山莊才又慢慢恢復往日的面貌。</p>
        <figure>
            <img src="/images/mtlogs/003/06.jpg">
        </figure>
        <p>除了修復與維護之外，也闢建一些較現代化的設施，像是廁所和販賣飲品的冰櫃，來方便遊客、山友使用，又或為了讓大家走訪李棟山莊之餘，能更進一步認識當地原住民的文化歷史，而正在山莊旁邊空地籌建一棟泰雅文物館。人會因為時間而老去，李棟山莊則因為時間推移，悄悄增添了一些新的面貌。</p>
        <figure>
            <img src="/images/mtlogs/003/07.jpg">
        </figure>
        <p>來到山莊後方，一條由水泥鋪成的道路從山莊正前方，穿過山莊逕自往森林裡延伸進去，並不時可以看見旁邊的駁坎石牆上掛著「往古堡」的牌子，此路便是登山客前往李棟山的其中一條路線。指示中的「古堡」字樣指的則是日治時期，日本統治當局為了征服當地原住民而於山頂構築的軍事要塞，今日已成斷壁殘垣的歷史遺跡。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>進入森林後水泥路也轉變為傳統的泥土山徑，稍微爬升一段後，會接續一條頗有產業道路規模的平坦大路，沿途多處皆設立指標告知距離李崠山古堡還剩下多少距離。</p>
        <figure>
            <img src="/images/mtlogs/003/08.jpg">
        </figure>
        <p>從李棟山莊出發的路線可分為平緩之字型延伸的林道，以及扶搖直上的陡峭捷徑，產道雖遠，但輕鬆好走，捷徑雖然快，但猶如好漢坡需要短時間內消耗大量體能，可視個人或團隊需求，選擇適應的路線，但不管是哪一條路線皆路徑明顯，布條也多，不太有迷路的問題。只不過前面說寬闊的林道遙遠，實際上從山莊開始計算，到達山頂也不過短短一公里半左右，即便對不常登山，但平時有運動習慣的人來說，應該也不太構成挑戰。</p>
        <figure>
            <img src="/images/mtlogs/003/09.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/003/10.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/003/11.jpg">
        </figure>
        <p>步道兩側的樹林就像通往皇宮前的衛兵，引導我們走向古堡所在之處，行至密林盡頭，一道隆起的土磚色石牆矗立在眼前，令外人無法直接看見牆後的景色。這片外牆便是李崠山古堡的一部分，回顧日治時期，李崠山因為地處位置與高度，在日本統治當局理蕃事務方面視為是非常重要的戰略地點，為了完全控制新竹尖石鄉一帶的原住民族群，日本派出大量軍隊與警察，設立隘勇線，逐步向原住民發起進攻，並佔領李崠山山區。之後便於山頂構築砲台工事，砌起六十公分厚的混擬土石壁，以方形將砲台古堡鞏固在中央，藉此抵抗原住民的進攻。</p>
        <p>沿著石壁往古堡入口的拱門走去，信眼就能發現石壁上有多處圓形孔洞，這些孔洞的用途想必是日本守軍用來將槍口對準原住民射殺之用。</p>
        <figure>
            <img src="/images/mtlogs/003/12.jpg">
        </figure>
        <p>如今古堡內側已不復見古堡本體，取而代之的則是一顆一等三角點。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <div class="mtlogs-title" v-text="catalog[4].title"></div>
        <p>由於李棟山莊的關係，常常也會有人把李崠山誤滕為李棟山；或是反過來，有些人出自李崠山古堡的印象，也錯把李棟山莊植寫成李崠山莊。事實上，就連李崠山本身山名的來源都已經無從考證，比較能確定的是「李崠山」一名在１９１０年的日本五万分一蕃地地形圖中就已經出現。崠是客家話裡對山頂的稱呼，裡崠指的是最裡面的高山，有些人推敲也有可能是日本人將早期來台開墾的客家人中「裡崠」這個稱呼錯記成「李崠」才以訛傳訛至今。</p>
        <p>至於李棟山莊這個名字中的「李棟」是否是朱老莊主一時搞錯字呢？或許倒也不然，在山莊內部有一片記載「李棟山及古堡簡歷」的手寫木板，提到早在日人理蕃之前，清朝時期就曾派一名名叫李棟的將軍來台撫蕃，當時他就曾屯兵駐守在山頂，鎮壓不願服從的原住民。只不過這個說法在現人考證下有些不以為然，一來近代歷史上並無李棟這位將軍，二來清朝年間，在台灣設立的官銜最高層級只有總兵，並無將軍頭銜。</p>
        <p>「李棟清朝將，派守山頂上，鎮壓不平事，光榮返營房，因此而得名，流傳萬事芳。古堡日軍建，山胞古戰場，戰死上千人，雙方均有傷。」──李棟山莊莊主敬題。</p>
        <figure>
            <img src="/images/mtlogs/003/13.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/003/14.jpg">
        </figure>
        <p>李崠山古堡於２００３年以「ＴＡＰＵＮＧ古堡」之名登錄為新竹縣定古蹟，現在已全面禁止民眾隨意攀爬、露營，避免破壞這片重要的歷史場域。</p>
        <figure>
            <img src="/images/mtlogs/003/15.jpg">
        </figure>
        <p>下山返回李棟山莊，取車告別這座滿盈歷史與人文芬芳的小百岳。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[5].id">
        <div class="mtlogs-title" v-text="catalog[5].title"></div>
        <p>第一次造訪李棟山莊與李崠山的時候是２０２１年４月，時隔一年，又帶一名友人再次來訪，這時的李棟山莊作為《咒》的拍攝場景之一已聲名大噪，友人主要也是為此而來，至於爬山只是順便的事情。拜電影之賜，平假日前來朝聖的遊客明顯比過去增長許多，山莊外圍的停車位雖然又擴大，但仍然供不應求，原本覷靜的山莊頓時人聲鼎沸。</p>
        <figure>
            <img src="/images/mtlogs/003/16.jpg">
        </figure>
        <p>過去朱老莊主曾於採訪節目中表示住在這裡很安靜，不會被外人打擾，這裡對他來說就是其嚮往並付諸行動，一磚一瓦所砌起的桃源鄉，如果今天他老人家還住在這裡，不知道對此盛況會有什麼樣的感觸呢？這個問題的答案，或許也無從可考了吧。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>