<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="4" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>「銃櫃豬、頭社米、水社魚、貓出伙妓、魚池番薯、大林茶米、木屐土礱齒」此乃流傳在南投縣魚池鄉的一句台語諺語，這句諺語簡單明瞭地點出當地的出口特色。而過去清朝時期，南投曾有一條長度大約三十公里的道路，貫穿水里與埔里兩地，在當時是貿易往來的重要路線，它，就是水沙漣古道。</p>
    </div>
    <div class="text-block">
        <h3>一、水里市區上二坪</h3>
        <p>接連爬完日月潭四兄妹中的貓囒山、後尖山這兩座小百岳後，與友人前往水里市區為各自飢腸轆轆的肚子尋求一頓溫飽。走在熟悉的水里街道上，心想，從日月潭四兄妹、集集大山......就連要去玉山群峰也曾經過這裡，也許水里鄉是我迄今登山行程裡停留過最多次的鄉鎮了吧？只不過每一次停留都只是為了吃飯或買杯飲料，沒怎麼好好認識它。其實，水里街道上有一個指示牌一直以來都擱在我的心底，它上面寫著「水沙漣古道」，就掛在民生路與二坪路交會十字路口的號誌桿上，對登山客、健行愛好者來說，舉凡看到路牌寫著山或古道字樣的，眼睛都會像是反射動作般立即雪亮起來，恰好這次吃完中飯也才下午一點鐘，便決定前往一探究竟。</p>
        <figure>
            <img src="/images/mtlogs/004/01.jpg">
        </figure>
        <p>沿著二坪路往山上開去，不消數分鐘便抵達台電員工的大本營──二坪，這裡除了有一棟棟明潭電廠的員工宿舍，還有頗有名氣的枝仔冰店。儘管時序已經來到十二月，但天氣依舊炎熱，冰自然是要吃的，不過當務之急，還是先走訪一趟水沙漣古道再說。繼續驅車開進大觀冰店旁邊的小巷，很快地就能抵達水沙漣古道入口。</p>
        <p>水沙漣古道入口給人一種很不像古道的錯覺，查資料才知道這幾年日月潭國家風景區管理處（簡稱日管處）花費一千多萬元預算，將腐壞的枕木、頗損的階梯，整體看上去頹廢許久的古道重新進行翻修，並重塑入口意象，試圖再現昔日水沙漣古道熱絡的時光。水沙漣這個名字的由來，是清朝時期對台灣中部水沙漣內山的稱呼。</p>
        <figure>
            <img src="/images/mtlogs/004/02.jpg">
        </figure>
        <p>回顧２０１９年的新聞，日管處該次針對古道修繕的範圍從水里鄉二坪山，涵蓋至魚池鄉銃櫃村，全長約２．６Ｋ。其實，最早文獻記錄可追溯至一七八八年清朝乾隆時期，為漢人墾拓遷徙、或與當地原住民貿易往來的水沙漣古道，如今多數路段不是遭受破壞，不然就是加以修築成台２１線，現在這條連接二坪銃櫃兩地的古道，已是水沙漣古道僅存的少部分路線。</p>
        <p>如今整修完成的古道，汰換掉老舊的枕木，取而代之的則是塑木與卵石堆砌，比枕木更加耐用的台階，部分山徑也重鋪成水泥路，雖然看上去少了些古樸的味道，但因為每逢颱風或大雨來襲，古道間某些路段的山坡不時會有沙石滑落的情況，如今翻修完成，也為民眾登山健行的環境提供更安全保障。</p>
    </div>
    <div class="text-block">
        <h3>二、承接聖旨的土地公廟</h3>
        <p>因為古道連接兩地，無論從二坪出發還是銃櫃進入，都可以走到另外一地的出入口，但假如沒有要原路折返，從銃櫃出發會比較輕鬆，因為地勢是緩坡向上到土地公鞍嶺後，在距離二坪古道口數百公尺前迅速下降。如果從二坪出發，一開始就要先面對扶搖直上的陡坡，然後一陡還有一陡陡，不用片刻，整個人便大汗淋漓。</p>
        <figure>
            <img src="/images/mtlogs/004/03.jpg">
        </figure>
        <p>這條水沙漣古道我一共造訪了兩次，後來第二次自己單獨來健走，改由銃櫃側出發，遇到幾名有年紀的山友，他們都是在要下降之前就折返，自嘲地說自己已經是上了歲數的老人家，膝蓋會吃不消。儘管這點爬升看在常爬大山的勇腳來說只是家常便飯，但對一般健行民眾而言，還是有一點點挑戰性，但也不用太擔心會不會負荷不了，基本上過了爬升的拐角處，之後便是緩升緩降的寬坦地形。</p>
        <figure>
            <img src="/images/mtlogs/004/04.jpg">
        </figure>
        <p>第一次造訪的時候一路暢通，但兩年後再訪，古道部分路段的一半寬幅被滑落邊坡的大量沙石給掩埋，雖然尚能通行，但也不得不感嘆即便是低海拔且長年有人行經的區域，仍存在一定程度的自然風險，若選在大雨後前來健行，應當多留意四周，快速通過危險路段。</p>
        <p>走著走著，古道如扇形般擴散，形成一處廣闊的腹地平台，這處平台設置了幾座用大水甕當作裝飾的木製長凳，提供遊客休憩之用。而一旁還有一座破損失修，以欄杆隔絕遊客擅闖觸碰的古蹟，隱諱地藏在幾顆樹木與竹林裡面。</p>
        <figure>
            <img src="/images/mtlogs/004/05.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/004/06.jpg">
        </figure>
        <p>這座外觀有著閩南式小廟風格的殘破建築，正是水沙漣古道該路段著名的土地公廟。水沙漣古道在過去是當地重要的往來交通要道，是各種日用品交易的重要路線，素有「鹽路」之稱，而文章開頭諺語裡「銃櫃豬、頭社米、水社魚......」這些特產，也多半經由這條路線向外出口交易。至於這座已經神去廟空的土地公廟，則是先人修築此道路時，為祈求行旅平安而建造的，有土地公廟加持，這段古道又被稱為「土地公鞍嶺古道」，相傳，此廟曾經獲頒清代聖旨，名噪一時。</p>
        <p>忽然想到，文獻裡有提到土地公鞍嶺的土地公廟已經遷移到山下，那麼水沙漣古道二坪登山口旁邊的土地公廟，裡頭奉祀的福德正神會不會就是原本供奉在此處的神明呢？</p>
        <figure>
            <img src="/images/mtlogs/004/07.jpg">
        </figure>
        <p>離開土地公廟，沿著步道繼續往銃櫃的方向前行，走沒多久後便注意到一旁樹木綁著幾條登山布條，同時上方還釘著一張鐵牌，褪色的紅漆上猶能看出「土地公鞍嶺」的字樣，翻開離線地圖觀看，距離古道大約兩百公尺，山徑既狹窄又不起眼，與友人討論了一下後還是決定上去一探究竟，一路雜草叢生，蜘蛛網面膜大放送，想來已經有段時間沒有人將這段荒涼的山徑踩一踩。</p>
        <figure>
            <img src="/images/mtlogs/004/08.jpg">
        </figure>
        <p>二坪山，又稱土地公鞍嶺，海拔７３１公尺，視線可及之處皆為雜亂的林木，無開闊展望。原本山頂有一顆土地調查局設置的圖根點，但今日已遺失，倒是現場遺留一塊紅色磚瓦，似是用來作為山頂標的物的替代象徵。</p>
    </div>
    <div class="text-block">
        <h3>三、銃櫃</h3>
        <p>拍完照後回返傳統路徑，基本上銃櫃與土地公廟遺址之間的路段坡度平緩，路面也屬於由水泥鋪成的道路，我們走走聊聊，不知不覺已抵達銃櫃端的古道出入口。</p>
        <figure>
            <img src="/images/mtlogs/004/09.jpg">
        </figure>
        <p>銃櫃這個名字十分獨特，據說地名原由來自清朝時期，當地原住民常出沒於土地公鞍嶺出草劫殺，朝廷便派駐官兵於此地鎮守，保護往來古道的商旅，因當時曾設置彈藥庫，遂稱此地為銃櫃。另也有一說是日治時期定下來的地名，理由於前者雷同，只是清朝朝廷換成日本統治當局而已。</p>
        <p>由於銃櫃當地的居民早期以養豬為大宗，所以俗諺中才會有「銃櫃豬」這樣的說法。</p>
        <figure>
            <img src="/images/mtlogs/004/10.jpg">
        </figure>
        <p>在古道口附近的引導牌上看見印有「銃櫃湧泉」字樣的景點，離此處不遠便走去看看，以為是個像蘇澳冷泉那種大規模的知名景點，實際上則是早年居民洗東西的小水井，內心給了很高期待卻又逕自覺得失望，不過，此處湧泉反映了早年當地居民的日常生活，對他們來說應該有相當深刻的回憶吧。</p>
        <p>銃櫃湧泉踩點完後原道折返，準備回二坪吃枝仔冰。</p>
        <figure>
            <img src="/images/mtlogs/004/11.jpg">
        </figure>
        <p>二坪路上共有兩家冰店，一家是二坪冰店，另外一間則是二坪大觀冰店，雖然造訪古道兩次，都是比較靠近山下的二坪冰店人潮多一些，不過靠近水沙漣古道的大觀冰店似乎是最早期的一間，開業至今已經超過五十年歷史。「大觀」一名源自大觀發電廠，該電廠興建於日治時期，前身為日月潭第一發電所，後來國民政府來台才改成現在的電廠名字，而大觀冰店就隸屬於台電大觀發電廠職工福利社。但無論是二坪冰店還是大觀冰店，販賣的冰棒口味大致相同，價格也都一樣實惠親民。</p>
        <p>我點了一支在其他電廠枝仔冰店比較少看到的口味──核桃牛奶鹹冰棒，起初還有些忐忑不安，但味道確實驚為天人，後來才知道原來這個口味是冰店的暢銷口味之一。邊休息邊享受枝仔冰美味的時候，看見好幾組顧客，下車一買都是以「箱」為單位在大肆購買，氣勢相當驚人。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>