<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="5" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>玉山在台灣人心中地位不言自明，圍繞在主峰周圍的諸多群峰，是岳界各層級登山人畢生都想挑戰的目標，有些勇腳更是把玉山群峰當作自家後院，春天刷，夏天刷，上個月刷完這個月又刷，想到就刷，一刷再刷，這不單單只是想要突破自我極限，也是因為玉山群峰線地貌多變、景色絕美，總令人一逮到機會，就會想騰出時間再走一回。</p>
        <p>玉山群峰著名的山峰約十一座，各座山峰景觀不同，別具特色。然而，其中有一座山峰，多數登山人可能僅止造訪過一次，爾後再踏上玉山群峰步道，恐怕也不會再將祂納入規劃，祂是如此的「惡名昭彰」──其實用惡名昭彰來形容也顯得有些過份，但實際上很多去過的人看到行程清單裡有祂，心頭多半會不禁倒揪一晌．．．．．．這座山的名字，叫做玉山前峰。</p>
    </div>
    <div class="text-block">
        <h3>一、一日之計在於晨</h3>
        <p>行經夫妻木抵達塔塔加的這條台２１線，在這短短半年內已經來回了第三趟，或許三趟對很多出入頻繁的人來說不足掛齒，但對我這種安排登山行程喜歡北、中、南交錯，避免旅途枯燥乏味的人來說，同一條山路短時間內往返三次似乎已略顯過度。話雖如此，因為這三趟走的都是不同行程，所以也沒到那麼難以吞下入嚥，更何況，這一次的行程是闊別許久的百岳行程，一路駛來其實心情很是雀躍。</p>
        <figure>
            <img src="/images/mtlogs/005/01.jpg">
        </figure>
        <p>時序是盛夏，但入夜至侵晨這段時間的塔塔加仍有些涼意，同行友人原本還在擔心忘記帶外套的自己會不會擋不住早晨低溫，然而這份擔憂隨著踏上東埔山莊與玉山登山口這段三公里的林道後，很快便消彌的無影無蹤，看樣子不搭接駁車光速省略這三公里還是有不少好處的。</p>
        <p>而且這條名為「楠溪林道」的水泥路，沿途有許多視野開闊的展望點，隨時都能駐足抓捕畫面，餵飽自己或攝影設備的記憶體，這可是搭接駁車無法享受的福利。不過一方面也是因為此行是友人第一次踏進玉山國家公園的範圍，比起節省時長，他更想透過多走點路來親近這片山林與大地。</p>
        <figure>
            <img src="/images/mtlogs/005/02.jpg">
        </figure>
        <p>六點十分抵達玉山登山口，幫朋友與銘刻「玉山登山口」字樣的立石合完影後，正式跨足玉山群峰登山步道的起點。仔細想想，雖然這是我第四次踏上這條五星級的國家登山步道，不過還是頭一次在夏季的時候前來，和前次冬季造訪時較為溫馴的色調相比，頭頂上方的色彩幾乎可以用「爆炸」來形容的湛藍，既強烈又鮮明。</p>
        <p>這次登山行程是單攻玉山前峰，在玉管處申請路線叫做玉山前峰單日往返，先前和其他團的朋友討論玉山群峰行程的時候，一直有想要把玉山前峰放入名單裡頭，但朋友總說玉山前鋒非常硬，在本來時間就抓比較短的行程安排，若要再安插玉山前峰，可能會回不了登山口，雖說是誇大其辭的玩笑話，但也不難想像玉山前峰在有經驗的登山人眼裡是什麼樣的存在。於是後來也自行蒐集了些關於玉山前峰的資料，總的來說，就是又硬又陡很難爬，號稱「膝蓋終結者」的一座山。</p>
    </div>
    <div class="text-block">
        <h3>二、岩瀑逆游</h3>
        <p>玉山前峰的登山口在經過孟祿亭後大約再踢五百公尺左右的岔口，相信大多數的人都對岔口指示牌玉山前峰木牌上寫著「很難爬」的手寫字印象深刻。</p>
        <figure>
            <img src="/images/mtlogs/005/03.jpg">
        </figure>
        <p>根據指示牌上標記的數字，從岔口登頂玉山前峰為０．８Ｋ，以從玉山登山口起登往返玉山前峰的行程，總里程約七公里，絕大多數的路程都是走在平緩攀升的玉山群峰步道上，真正屬於玉山前峰自己的路段，其實只有短短八百公尺而已，然而，這短短的八百公尺，高度落差卻足足有四百公尺之多，平均每兩百公尺就得爬升一百公尺，踏上這條山徑，簡直名符其實的「爬」山。</p>
        <figure>
            <img src="/images/mtlogs/005/04.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/005/05.jpg">
        </figure>
        <p>儘管一開始就迎來與前面玉山群峰步道所累積之２．７Ｋ截然不同的陡上，驟變的節奏惹得我們氣喘吁吁，不過約消十幾分鐘左右，就攀上一處視野開闊的寬廣平台，放眼望去，首當其衝是以麟趾、鹿林兩座近山為主軸的兩千公尺級中級山群，神秘的楠溪林道則在其間曲折蜿蜒。</p>
        <p>說到這條楠溪林道，道路起點從上東埔停車場開始，全長約有３４Ｋ，我們一般借道行至玉山登山口的這一小段路，不過只是楠溪林道的一小部分而已。原名為楠梓仙溪林道的楠溪林道，早年是林務局伐木、造木的重要運輸道路，玉管處成立並接管後，伐木作業也隨之終止，取而代之的是前來進行研究的生態學者，現今在玉山登山口之後的林道僅開放公務車輛通行，徒步登山者則必須事先上網申請入園許可方能進入。</p>
        <figure>
            <img src="/images/mtlogs/005/06.jpg">
        </figure>
        <p>興許是因為單純爬前峰的團體多半會等乘第一班接駁車，通常不會這麼早出發，所以天甫亮就上路的我們順理成章成為當日玉山前峰的第一組訪客，清幽的氛圍實在和門庭若市的玉山步道很不搭嘎，雖說覺得意外，但想想沒遇到其他山友也不失一樁好事，畢竟踩在這片亂石當中，唐突刷下幾顆根基不穩固的碎石並不是什麼罕見的事情，若沒有保持好安全距離，這條評比Ａ級的路線其實還是存在些受傷風險。</p>
        <p>玉山前峰八百公尺中的最後四百公尺，嚴格來講才是整趟山徑的大魔王，聲名遠播的石瀑區也是在這四百公尺開始現出真身。縱然行前就已經事先拜讀過許多網友分享的遊記，內心已有預先做了點心理建設，但親眼所見時仍猶倍受震撼──不見源頭的亂石雜疊成一道灰白色的瀑布流，強行將箭竹與森林分割開來，我們宛猶逆游而上的鮭魚，手腳並用地在亂石嶙峋間向上攀爬，說是四百公尺，爬起來卻感覺有四公里那麼長，爬完一坡又接著一坡，始終不見盡頭似的。</p>
        <p>這種石瀑直接充當山徑的地形，和開闊稜線一樣很容易使人產生看起來都可以走，反而更難判讀正確路徑的錯覺，雖說和稜線相比，石瀑在方向判斷上簡單粗暴許多，但相對需要花費較大的心思去判斷石頭間的落差和穩定度。大量消耗大腿肌力量的我們，只得苦中作樂，把爬石瀑當作跳格子，比誰踩的石頭更穩固更踏實，然後最先抵達瀑布的頂端。</p>
        <figure>
            <img src="/images/mtlogs/005/07.jpg">
        </figure>
        <p>當看到鐵鍊的時候，即表示距離山頂不遠了，石瀑的寬幅也逐漸限縮為涓涓細流。</p>
    </div>
    <div class="text-block">
        <h3>三、玉山前峰</h3>
        <p>３２３９公尺的玉山前峰，百岳編號＃６９。根據歷史記載，玉山前峰攀登的最早記錄可追溯至日治時期，由日本人類學家──鳥居龍藏所率領的團隊，一反當時傳統由陳有蘭溪八通關古道上玉山的路線，改由當時還只是獵路的特富野古道，行經東水山、鹿林山等山，於塔塔加鞍部駐紮一夜，翌日再翻越前山、西山抵達排雲山莊附近，最終於第三日成功站上玉山主峰之巔。鳥居博士於大雪紛飛惡劣環境下成功登頂，不僅僅是台灣登山歷史的壯舉，他們開闢出另一條有別於八通關的玉山之路，可說是現今玉山熱門路線的開拓先驅，至於文獻中提到的前山，便是玉山前峰。</p>
        <figure>
            <img src="/images/mtlogs/005/08.jpg">
        </figure>
        <p>抬腕算了一下時間，從岔路登山口到前峰山頂，含小休一共花了６５分鐘，與上河文化百岳地圖評估的７５分鐘相差不遠，本來還仗著自己平常運動量足夠，山齡也邁入第七年，應該能比上河圖估算速度快上許多，但從實際結果看來是高估了自己，不過這似乎也是變相訴說上河文化對玉山前峰硬陡程度的評估其來有自。而通常這也是為什麼規劃玉山群峰行程的山友，假如已經去過玉山前峰，多半就不會想再特地將祂安插進行程的原因，在地圖上看似緊鄰玉山群峰步道旁，好像可以順道去取，但實際付出時間與勞力的投報比實在不高。</p>
        <figure>
            <img src="/images/mtlogs/005/09.jpg">
        </figure>
        <p>玉山前峰山頂的展望十分廣闊，尤其往東側望去的那一面，可以直擊主峰、西峰、北峰等玉山群峰連綿串起的稜線。當年鳥居博士似乎就是從前峰東面的拗口攀上玉山西峰，一路直達玉山主峰完成創舉。但如今幾乎沒再看過有人復刻這條路線的記錄，基本上都是由山腰的步道直達排雲山莊，然後向西或向東去分取西峰與主峰，乃至於其他群峰。若要再往前一點追溯，則是從鹿林山一帶進入，名噪一時的鹿林山莊正是當時建造來提供山友借宿之用。</p>
        <p>所以即便西峰與前峰兩山之間距離極近，但如果一天內要爬上這兩座山，也得從主步道腰繞個十公里長。其實光站在前峰山頂往下拗處俯瞰，地勢起起伏伏又險峻，也能體會這條路實在不太適合一般登山者行走，既然有國家鋪設好的安全道路，又何苦冒著風險只為滿足自己的虛榮心呢。</p>
    </div>
    <div class="text-block">
        <h3>四、金剛岩</h3>
        <p>踩著石瀑上山對膝蓋是考驗，那麼下山可能該說是一種折磨，下跨每一步都必須經過深思琢磨，輕踩輕放，否則面對這陡峭的落差，稍有不慎可能會摔了個四腳朝天。大概快要脫離石瀑乾溪溝區域時，總算遇到除了我們之外的其他訪客了，首先遇到一名外國白人，看他胸前別著一台ＧＯＰＲＯ，心想應該是有在拍攝ＶＬＯＧ之類的創作者吧，他操著一口不是很流暢但仍能和我們溝通的中文口音，簡單寒暄了一下，這位年輕男子來自遙遠的北歐國度（用北歐概括主要是因為我忘記他來自哪一個國家了．．．．．．），這次飛來台灣的計畫是與本島友人一同完成玉山前五峰的行程，只是他的朋友們全都已經登頂過玉山前峰，紛紛表示會在前峰登山口等他爬完前峰，因此他才會落得自己一個人獨攀的情況，真是一群損友──一方面這麼想，一方面又覺得好像不是不能理解。</p>
        <p>其實像這位外國朋友的案例也不是第一起，光是我們下山陸續擦身而過的十幾組山友，凡是獨自一個人奮戰的，十之八九都是隊友在群峰步道岔口那給予他們精神支持，剩下來的一成單純只是體能不同導致和其他隊友拉開差距，充分體現「兄弟登山各自努力」古諺的真諦。但是神人也還是無所不在的，有一對老夫妻呼吸有條有紊，一席輕裝踏著石頭徐徐而上，當得知這是他們第八次來爬前峰，聽得我們下巴差點直接叩在石塊上，別說八次，就連要我們爬第二遍，恐怕也得技能冷卻個兩、三年後再說。</p>
        <figure>
            <img src="/images/mtlogs/005/10.jpg">
        </figure>
        <p>回到０．２Ｋ處展望平台休息時，赫然發現山壁上的輪廓像極了某種靈長類：</p>
        <figure>
            <img src="/images/mtlogs/005/11.jpg">
        </figure>
        <p>猛然想起在Ｏｐｅｎ　Ｓｔｒｅｅｔ　Ｍａｐ地圖裡，玉山前峰山徑上有標記一處「金剛岩」的景點，立刻拿起手機比對一下位置，果不其然！上山時絲毫沒注意到，下山時看過去才發現這隻金剛側臉的輪廓特別明顯，不禁莞爾一笑。</p>
        <p>本來登出玉山前峰接回主要步道時，看時間九點半猶尚早，想帶友人加碼麟趾、鹿林山，從不同角度欣賞早上苦戰一番的玉山前峰，之後再從玉山林道接回大鐵杉，一路踢回上東埔停車場。然而走著走著，發現雲層越來越厚，擔心晚點會下起滂沱雷雨，經過一番考量決定打消念頭，早點取車下山吃慶功宴補充失去的卡路里。</p>
        <figure>
            <img src="/images/mtlogs/005/12.jpg">
        </figure>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>