<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="6" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>車輛緩緩駛進這處宛如世外桃源的布農族部落，謐靜彷彿籠罩著這片山野，轟隆隆引擎聲都顯得格外刺耳。雲的故鄉，武界，相信這個名字注入多數人眼耳裡並不陌生。武界坐擁美麗壯闊的山川自然奇景、豐富多元的生態樣貌，以及純樸的原鄉文化，儘管不像日月潭或阿里山那樣盛名遠播，卻也是許多酷愛遊山玩水的遊人一生必訪之地。</p>
        <p>根據《台灣文獻》記載，「武界」一詞可信度較高的來源有二說：一是該地一帶的區域曾是布農族與泰雅族爭奪獵場的場域，時常發生交戰，後來兩族協調決議獵場範圍，以武界現址為界線，因而得名；另一說法則是源自布農語的發音「Ｂｕｑａｉｚ」，意指翻越某物，山或界線也包含在所謂的「物」範疇之中。看似兩種不同的說詞，不過就我看來，兩者之間隱隱約約似乎又存在著前因後果之關聯。無論地名起源真相是何者，就地理環境而言，這片位處南投深山的沖積平原為濁水溪一分為二，兩岸部落沿溪岸為居，並以濁水溪劃界區隔直至今日。</p>
    </div>
    <div class="text-block">
        <h3>一、橘子屋的故事</h3>
        <p>２０２１年１月某日的清晨，打開車門坐上駕駛座，頂著寒意與睡意，發動引擎緩緩駛離車庫，撇上國道和不知什麼時候才會熄滅的路燈競速。在事前規劃時事先查詢過交通路線，此次登山行程必須借道非大眾路線的武界產業道路，這條路既狹窄又崎嶇，對當時還不怎麼擅長開山路的我而言，無疑是一項富有壓力的挑戰。為避免塞車與會車的麻煩，即便寒流來襲，也不得不早早掀開溫暖的被褥著裝上路。</p>
        <p>．．．．．．話雖這麼說，但當我東摸西摸抵達埔里鎮其實也已七早八早，好在運氣不錯，又或者埔里六秀並沒有我想像中的那麼知名，總之離開埔里市區一直到武界的這段山路，幾乎沒有遇到任何人車，產業道路雖然一如預期的顛簸，卻也平安無事地抵達曾是舊哨所的「橘子屋」。</p>
        <figure>
            <img src="/images/logs/006/01.jpg">
        </figure>
        <p>橘子屋的對面有一大片停車場，可供前來登山的車輛駐車，近幾年車宿文化盛行，地主亦不吝嗇分享土地提供民眾車泊露營，而橘子屋則搖身一變變成柑仔店，販賣各類民生用品和食物飲料等做個小本生意──不過這些都是後話了，在我造訪那天全日甭說登山客，就連一個尋常遊客都沒見著，這幢橘色的鐵皮建築始終嚴實閉鎖著，阻絕室外任何一縷寒風。這讓學生時期曾經造訪武界過一次，當時對武界寧靜氛圍留下深刻印象的我來說，那份體悟不僅再次被喚醒，還留下更刻骨銘心的體悟。儘管可惜但倒也無妨，平日生活在城市紛壤喧囂，相信不少人包括我在內，假日獨行來到山上，所圖無非是片刻的寧靜，越是安靜越能沉澱自己。</p>
        <p>至於橘子屋前身作為檢查哨，網路搜尋引擎竟爬不到詳細的資料介紹，只知道在現今武界出入主要幹道「卓社隧道」開通前，我一路駛來宛如越野賽道的舊產道是武界居民與外界往來的唯一一條道路，據橘子屋屋子外頭懸掛的「八八九二一大地震歷史」回憶錄所云，當時大地震震壞了這條唯一通路，使得居民一度只能穿越森林上下山。直至後來隨著投７１線改道與投８３線的開闢，武界與外界多了更多的聯繫，這條舊道也隨之埋沒於歷史洪流當中。</p>
        <p>所以我想這也是為什麼我這趟過來一路上都沒遇到人車的緣故吧！一般人壓根兒不會有大路不走而去選擇走荒廢的小路，現在還會使用這條舊路的恐怕只有登山客，或是騁馳山野大小道路踩點的追風族了吧。</p>
        <figure>
            <img src="/images/logs/006/02.jpg">
        </figure>
        <p>這次登山的目標是埔里六秀之一的「橫屏山」，祂的登山口位於「武界山」頂點的菜園裡頭，雖然可以藉著農路將交通工具往上推升到登山口附近，但我還是決定把車留在橘子屋對面的空地，從駐車地到登山口之間約一公里的距離就靠雙腳慢慢消化掉。</p>
        <p>從結果來說很慶幸自己選擇用雙腳一步一腳印走上山，高山茶園一貫標配壯闊的山景稜線盡收眼底，橘子屋到武界山最高點這一公里路無疑是整個登山行程視野最開闊、最美麗的一段。如果選擇駕車上山，恐怕會錯過沿途適合取景的拍攝點，甚至只勉強容得下一輛車寬的農路恐怕也令人無暇欣賞沿途明媚風光。</p>
    </div>
    <div class="text-block">
        <h3>二、武界山菜園遇故鄉</h3>
        <p>儘管世人稱呼武界是雲的故鄉，但是在造訪這天，天空藍的像是繪圖軟體直接用純藍色圖層覆蓋在最上層似的，僅能從極度遙遠幾乎脫離視野盡頭之處的一隅，覓得稀疏幾叢素色的雲團，唯一能與這片壓倒性的藍抗衡的，只有燃燒自身以綻放刺眼光芒的灼灼烈日。或許夏天走在這段沒有遮蔽的農路會是一場折磨，好在誤打誤撞選擇冬日前來拜訪，曬歸曬，卻未曾覺得自己是否正在烤爐裡接受酷刑。</p>
        <figure>
            <img src="/images/logs/006/03.jpg">
        </figure>
        <p>雖說毋須登頂就能一攬對面連綿橫亙的山巒，然而來到農路盡頭的頂端，視野又更遼闊了些。與武界山面對面相望的是由干卓萬山與卓社大山為首的兩座百岳，祂們攜手構築的「干卓萬群峰線」，在岳界與南三段、奇萊東稜、馬博橫斷並列為「四大障礙」，站在對立面的視角眺望其山峰起伏，實在很難想像自己是否擁有踏足在稜線上的本事。</p>
        <figure>
            <img src="/images/logs/006/04.jpg">
        </figure>
        <p>除了一望無際的高麗菜園之外，最突兀的標的物莫過於是這座矗立在菜園角落，經過歲月摧殘幾乎只剩下骨架的雙層鐵骨建築，儘管已經看不清原貌，依稀仍可推敲出該廢墟早期應是一座瞭望台，而武界山的「身分證」就紮根在建築物旁邊。</p>
        <figure>
            <img src="/images/logs/006/05.jpg">
        </figure>
        <p>武界山，海拔１５０９公尺，立有一顆山字森林三角點。</p>
        <p>此武界山並非埔里六秀另一座「舊武界岳山」，部份山友以為兩者是同一座，實則不然。雖然兩山距離相近，但舊武界越山要再往東北方更加深入方能抵達，且登山難度更甚於橫屏山。除了舊武界岳山之外，於武界水庫旁邊還有一座「新武界山」，嗯．．．．．．有時候不太能理解台灣山岳的命名淵源是什麼。總而言之每座山都有祂自己的故事，也許時至今日有些源由已不可考，不過登山者從不吝嗇貢獻自己的腳底板，無論山有多偏僻多深遠，總持續有人留下足跡將祂的存在紀實流傳下去。</p>
        <p>正當準備鑽入登山口所在的樹林時，耳邊突然傳來輪胎與碎石路面相互摩擦的聲響，一輛與農路受眾不太相稱的休旅車緩緩駛了上來，內心暗自感動終於遇到其他山友時，打開車門探出車外的是一名中年婦女，隨即又有兩名小朋友情緒高昂地從車室跳了下來。看見彼此的我們互相打了個招呼，簡單寒暄得知對方是這座菜園的主人，今天上山採收一些果菜，為即將到來的農曆新年做準備。知道我是來登山，對方也熱情地分享橫屏山這條山徑的登山經驗，雖然她們沒深入到橫屏山，但整體而言路徑應該都算很清楚，且起伏不大走起來相當輕鬆，過去她們時不時會走進去森林裡散步。</p>
        <p>儘管擬定登山計畫時就有事先查詢過路況，但再怎麼說，如果能從當地人口中獲得證實，邁出的步伐自然而然也會更加踏實。告別前的最後對方問我從哪裡來，我回答來自台中，對方感到驚訝地說她們也居住在台中，真是好巧不巧！</p>
    </div>
    <div class="text-block">
        <h3>三、一個人的武林</h3>
        <p>仍必須得說，縱然埔里六秀知名度無法比擬谷關七雄，卻也沒想過竟然這麼冷門，從橘子屋起登到走進山徑，除了遇到菜園主人外，再也沒聽到其他人類製造的聲響。山齡邁入第五年，這還是頭一次走在杳無人聲的密林當中，即便路徑清晰易辯，氣候也十分舒適，心裡仍著實為一股名為「寧靜」的巨大壓力所籠罩，一腳踩碎枯葉所發出的聲響，彷彿都能響徹整片雲霄。</p>
        <figure>
            <img src="/images/logs/006/06.jpg">
        </figure>
        <p>「嘎──」</p>
        <p>驀地，一道中氣十足的嘶吼震攝著我的鼓膜，那不是由人類喉嚨所發出的吶喊，也不像某戶工寮飼養犬隻的吠叫，而是源自某種棲息在這片山林裡的野獸。我放慢腳步，心驚膽戰地四處張望試圖尋找聲音的來向，不消數秒鐘，同樣的吼叫聲再次割裂了這座寧靜的森林，這次聲音聽上去比較遠，推測可能已與這方拉開了距離，後來又陸續傳來第三、第四，令人摸不著規律以致沒再繼續細數的叫喊，確認分貝逐漸遙遠，這才慢慢打消撤退的念頭。</p>
        <figure>
            <img src="/images/logs/006/07.jpg">
        </figure>
        <p>抵達Ｙ字型岔路，看了一下地圖，往左邊走會到達此行目的「橫屏山」，往右路則通往另一座六秀「舊武界越山」，此路線相當遙遠故不列入此行範圍，不過該路線地圖上標示了另一座「獅凸魯山」就在岔路不遠處，花不了多少時間於是決定岔過去探個究竟。</p>
        <p>結果看自己ＧＰＳ明明已經疊在獅凸魯山標記的位置上，卻怎樣都找不到這座山基石的蛛絲馬跡，正當我放棄回返Ｙ字岔路時，才赫然發現獅凸魯山的牌子就掛在其中一棵樹的樹幹上，而且牌子的日期還很新，是在我來訪的一週前掛上去的，這才意識到獅凸魯山沒有基石，要找到這座山頭只能憑藉山友遺留的識別證。有趣的是，獅凸魯山也有另一派山友稱為獅凹魯山，究竟是凸還是凹呢？我踩在平坦的山徑上，一邊折返一邊思考這個問題的答案。</p>
        <figure>
            <img src="/images/logs/006/08.jpg">
        </figure>
        <p>往橫屏山的路線基本都行走在稜線上，不時有破風處可以一探北方山景，而位於橫屏山北方的山巒裡，最惹眼的莫過於埔里六秀中的老大──守城大山，守城大山海拔２４１８公尺，幾乎快要比橫屏山高出一千公尺。岳界常言被稱作「大山」的通常都不好惹，無論從平地還是站在山裡眺望，守城大山總是散發著不怒而自威的氣場。</p>
        <p>除了守城大山，更遙遠的北方還可以看到同樣被冠上「大山」尊名的白姑大山、志佳陽大山與雪山主峰等一列著名百岳。</p>
        <figure>
            <img src="/images/logs/006/09.jpg">
        </figure>
        <p>和前段武界山到Ｙ字岔路的平坦山徑相比，橫屏山這段稜線起伏稍微比較明顯一些，但也就是當感覺到心臟開始要渦輪增壓的時候便已經度過崎嶇的程度，橫屏山三角點並不在主要山徑上，在某個岔路交會點必須左轉向上走才能觸及。</p>
        <p>橫屏山，海拔高度１５０８公尺，為埔里六秀之一。許多人登橫屏山會選擇從埔里鯉魚潭東側的青山橋起登，與舊武界越山一塊規劃成Ｏ形環狀登山路線，一口氣蒐集這兩座六秀。</p>
        <p>由於我的車停放在武界那一端，必須原路折返，原本規劃也是只到橫屏山就打道回府，亦不打算取鄰近的橫屏山西峰，然而橫屏山往埔里方向的山徑路況實在太舒適了，於是我又忍不住加碼多走一段，在來到橫屏山林道的交會點，大景也隨之撲襲而來。</p>
        <figure>
            <img src="/images/logs/006/10.jpg">
        </figure>
        <p>地勢比較低的近景是板仔寮山，第二層則是舊武界越山、守城大山、南東眼山這幾座守護著埔里盆地的六秀山巒，最遙遠的則是大家耳熟能詳的合歡、奇萊兩大百岳群山線。明明時間已經來到正中午，視野卻還能如此清晰，我想這是只有冬季爬山才能獲得的禮遇吧。</p>
    </div>
    <div class="text-block">
        <h3>四、後記</h3>
        <p>下山後回到埔里市區吃午餐，在東側道路上正好可以清楚地看見橫屏山的全貌，每每下山後在平地再次看見自己稍早走過的山，都不由得感嘆數小時前人還在如此遙遠的山區當中。</p>
        <figure>
            <img src="/images/logs/006/11.jpg">
        </figure>
        <p>返回家中後第一件事是上網尋找一個念念不忘的答案，那就是自己在山徑中聽到的動物吼叫聲到底是什麼？其實從橫屏山返回的路上，又不時傳來相同的鳴叫聲，聲音忽遠忽近，搭配樹叢竄進竄出的緊湊音調，不由得快馬加鞭盡可能早一點離開森林。</p>
        <p>經過比對後確認聲音是來自台灣特有種「山羌」，本來還在想難道是黑熊或山豬這類猛獸，這才恍然大悟，結束這場虛驚。而山羌並不是什麼罕見的動物，在低、中海拔山區處處都能見到牠們的身影，不過山羌生性害羞，要在野外目睹牠們的樣貌並不容易（但是也曾遇過不怕人的，例如塔塔加一帶）。而牠們最大特色便是那高分貝趨近於犬叫的吠聲，人們也將這穿透力極強的嬌小生物稱為「吠鹿」。照理說爬山爬了五年，雖然還很稚嫩，但理應早已聽過山羌的嘶吼，只能說過去都和朋友組隊闖蕩，行徑談笑間無形忽略了很多大自然的生態樣貌。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>