<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="7" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>每每開車下國道三號名間交流道，接續台１６線往水里方向駛去，遠遠就能看見濁水溪河畔矗立著一座山容基盤寬闊，高聳挺拔，宛如相撲力士般屹立不搖的山岳，祂便是名聞遐邇的「集集大山」。儘管九二一地震嚴重覆蓋世人對集集此地的第一印象，但在過去集集鎮可是中台灣漢人與原住民交易往來的中心，素有「小台北」美譽。而外地商人總會稱小鎮東北面那座聳立的高山為「集集那邊大山」，久而久之，集集大山便成為這座大山的名字。</p>
    </div>
    <div class="text-block">
        <h3>一、高山巷</h3>
        <p>２０２１年２月１５日早晨８點４２分，從又名車埕木馬道的車埕休閒農業區展開今天的登山行程，如果問我為什麼選擇此處前往集集大山，而且還是採用徒步的方式，明明有道路可以直達山頂啊？其實倒也沒有什麼意義非凡的理由，單純是不想在狹小曲折的山路駕車蜿蜿蜒蜒，尤其對我這個連自己當駕駛都能暈車的重度易暈體質來說，當看見Ｇｏｏｇｌｅ　Ｍａｐ上通往集集大山的道路每一條皆有如擰成一團的絲線，車都還沒開，腦子便先暈頭轉向，於是只好選擇用徒步的方式走上集集大山。</p>
        <figure>
            <img src="/images/logs/007/01.jpg">
        </figure>
        <p>而且既然是大山，不用走的而是直接透過交通工具登頂，站在登山者角度看來似乎也太不給大山面子了，畢竟岳界常言「凡是被稱作大山的山都不是好惹的」，縱使集集大山是全台冠名大山尊稱之中海拔最低的一座，但從山腳起登到山頂也需要爬升將近一千公尺，來回則約需要走１３公里，路線親民但要登頂並不輕鬆，絲毫無愧於大山名號。</p>
        <p>以車埕休閒農業區為起點開闢的小路名為高山巷，雖然路幅狹窄，但路況維護地相當不錯，沿途還會經過幾處人家，中間也有好幾處可以停車的空間，如果想走路又不想踢這麼長的距離，是可以考慮開進高山巷之後再尋找合適的空曠處停車。</p>
        <figure>
            <img src="/images/logs/007/02.jpg">
        </figure>
        <p>踢馬路向來是無趣的，但遼闊的景致為這趟登山行程增添了許多另人印象深刻的色彩。高山巷的前半段林蔭遮蔽少，但視野極佳，不僅可以俯瞰隔壁車埕的明湖、明潭雙胞胎水庫，同時以「水社大山」為首的明潭四秀，宛如一道屏障橫亙在水里溪另一側，與集集大山相互對望。至於更遙遠的山稜線，則是號稱百岳四大障礙之一，以干卓萬山、卓社大山兩大百岳為主幹的「干卓萬橫斷」，內心不由得感嘆眼前這些大山家族一座比一座還不好招惹吶。</p>
        <figure>
            <img src="/images/logs/007/03.jpg">
        </figure>
        <p>撇除可以開車直達集集大山的水泥路，集集大山的登山步道組成主要有兩條，一條是孟宗竹竹林步道，另一條則是車埕步道，沿著高山巷往上走到道路終點，自然便能與這兩條步道相接。而在行至高山巷盡頭處之前，會有一條岔路可以通往一座名為「烏土窟」的山岳，雖然看地圖標示並不遙遠，所見路況看上去也與傳統林道相似，但由於行前沒有研究過這條路徑，只能強壓左胸膛裡那顆蠢蠢欲動的心臟，以安全至上為由，老老實實往集集大山方向前進。</p>
        <p>孟宗竹林步道的末段沒有顯著的路徑，即使人還在ＧＰＸ軌跡上，一時間卻也摸不著方向，所幸當時有一位正在竹林裡採筍子的老大哥，還沒等我開口，似乎就已經預判到這邊的疑惑，他伸直手往我面向的方向指去，並點了點頭，表示這方確實走在正確的路徑上。果不其然，往前探了一小段路之後，開始陸續可見綁在竹子上，來自各路登山隊繫上的五顏六色路條。</p>
        <figure>
            <img src="/images/logs/007/04.jpg">
        </figure>
        <p>當來到車埕步道，就表示距離集集大山的山頂也不遠了，車埕步道為傳統的泥土路徑，這對已經被道路開發的集集大山來而言簡直是稀有財。車埕步道的出口會與集集鎮開闢上來的大山巷接壤，而這也是車輛上山的主要道路。</p>
    </div>
    <div class="text-block">
        <h3>二、電視轉播發射塔</h3>
        <p>集集大山的山頂有一座紅白相間，外觀非常突兀的巨大信號發射塔，在發射塔底下的建築則是號稱全台輸出功率最大的電視轉播站，這個電視轉播站的用途是為了能將電視訊號擴散到整個南投境內，乃至更遙遠的雲嘉偏僻山區，都能順利收看數位電視的節目內容。</p>
        <figure>
            <img src="/images/logs/007/05.jpg">
        </figure>
        <p>現在我們看到的電視轉播站是２００２年，南投縣政府花費兩千兩百萬元台幣重新建設的建築，因為原本的轉播站在九二一大地震發生時，因無法抵禦強烈搖晃，與山腳下數以千計的民居共同遭遇毀損倒榻的悽慘命運，一直到新的轉播站築體啟用之前，偏遠地區的南投居民長達兩年有餘的時間沒有辦法收看電視，可見集集大山電視轉播站的重要性。</p>
        <p>集集大山的三角點就座落在電視轉播站一旁的空地，儘管大多時候轉播站的路口紅色鐵門是緊閉的，但面向鐵門右側的竹林仍留有一處開口，方便山友及遊客徒步進入留念。</p>
        <figure>
            <img src="/images/logs/007/06.jpg">
        </figure>
        <p>集集大山不僅是小百岳其中一員，更與守城大山、水社大山、溪頭鳳凰山並列中部四大名山，祂們宛如四方聖獸，各自鎮守著南投中心的四處方位。</p>
        <p>假如蒐集完三角點便打道回府的話，那這集集大山可說是白來了，走到馬路另一側，那才是集集大山山頂精華所在。</p>
        <figure>
            <img src="/images/logs/007/07.jpg">
        </figure>
        <p>馬路的另一邊同樣有好幾座漆得一紅一白的信號塔，其中一座信號塔底下則是三層樓高的瞭望台。</p>
        <figure>
            <img src="/images/logs/007/08.jpg">
        </figure>
        <p>在還沒登樓之前就能展望到轉播站另一面開闊的景色，</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>