<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="8" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>西元１９４０年代是台灣社會動盪不安的年代，二次戰爭末期美軍開始轟炸台灣，島土盡是滿目瘡痍。然而，傳說有居民看見台中大坑一帶的山區，白煙瀰漫之中間浮現出一朵蓮花，接住了美軍飛機投擲下的黑色轟炸物。該朵蓮花所在的位置，正好就在觀音山上，當時僅山頂由日軍設置的觀景台安然無恙外，周遭區域無不受到重創。數十年之後，一名法師於此地興建寺廟，以供信徒祭拜禮佛，據說在那之後各種感應靈驗事蹟頻傳，很快地便成為台中著名的宗教信仰中心之一。</p>
    </div>
    <div class="text-block">
        <h3>一、</h3>
        <p></p>
        <figure>
            <img src="/images/mtlogs/008/01.jpg">
        </figure>
        https://www.maitreya.tw/archives/1578


        寺廟喜歡蓋在山旁邊，這背後有多重原因，包括文化、宗教、風水以及實際考量：

文化與宗教意義：在中國和其他東亞國家，山被視為接近天界的地方，是神聖和清靜的象徵。許多宗教信仰中，山被視為神靈居住的地方，因此在山旁建寺廟可被認為是接近神靈，追求靈修和智慧的象徵。

風水考量：根據中國傳統的風水學說，山水環繞的地方被視為「藏風聚氣」，有助於積聚和保持正能量。山提供了穩固的背景，被認為能帶來安全和安定。

環境與清靜：山區通常遠離城市的喧囂，環境幽靜，空氣清新，非常適合修行和冥想。僧侶和修行者可以在這樣的環境中專心於精神修行，達到身心的平衡。

歷史典故：許多古代的聖人、哲學家和修行者選擇隱居於山林中，他們的居所後來成為了信徒膜拜的場所，隨著時間的推移，這些地方發展成為寺廟。例如，佛教的很多祖師和道教的神仙傳說都與山有關。

地形優勢：山區的地勢有時候能夠提供天然的防禦屏障，讓寺廟免受外界侵擾，同時也能讓寺廟具有更好的觀景位置，吸引更多的信徒和遊客。

綜合來說，寺廟建在山旁不僅是因為宗教信仰和風水考量，還因為山區提供了修行所需的清靜環境和歷史文化的沉澱。
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>