<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：廍子路登山口' },
    { id: 2, title: '2K：玉佛寺' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="8" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2021-01-23</strong></p>
        <p><span>行走總長：</span><strong>約 2 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 0.5 HR</strong></p>
        <p><span>路程總覽：</span><strong>南觀音山登山口 → 南觀音山登山步道 → 玉佛寺 → 南觀音山</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>西元１９４０年代是台灣社會動盪不安的年代，二次戰爭末期美軍開始轟炸台灣，島土盡是滿目瘡痍。然而，傳說有居民看見台中大坑一帶的山區，白煙瀰漫之中間浮現出一朵蓮花，接住了美軍飛機投擲下的黑色轟炸物。該朵蓮花所在的位置，正好就在觀音山上，當時僅山頂由日軍設置的觀景台安然無恙外，周遭區域無不受到重創。數十年之後，一名法師於此地興建寺廟，以供信徒祭拜禮佛，據說在那之後各種感應靈驗事蹟頻傳，很快地便成為台中著名的宗教信仰中心之一。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>當山與步道越走越多，一直以來深潛在內心的某個疑惑也越加上浮水面──為什麼很多寺廟不是蓋在山裡，就是建造在山的旁邊？舉凡此次目標南觀音山在內，獅頭山、橫山、崁頭山、五指山、南勢角山．．．．．．等等族繁不及備載，祂們都不是很高海拔的山岳，卻都有著除了同為小百岳之外還擁有聞名全台的寺廟這一共通點，讓我想起了唐朝劉禹錫〈陋室銘〉一文曾寫到：「山不在高，有仙則名；水不在深，有龍則靈。」儘管這兩句話的用意是為了襯托自身的高風亮節與出類拔萃，但「山不在高，有仙則名」這一句話，似乎也恰好映照了華夏幾千年佛道文化的某部份精髓。</p>
        <figure>
            <img src="/images/mtlogs/008/01.jpg">
        </figure>
        <p>南觀音山有好幾個登山口，扣掉可以直接開車上山的馬路，最多人行走的莫過於廍子路接近東山路圓環附近的登山路線了，登山口的石壁上刻篆著密密麻麻的文字，一旁還立著一座巨大金色佛手。</p>
        <p>很多寺廟會選擇依山而建，其背後有著多重原因，若以宗教文化意義層面來論，山在中華文化裡被視為接近天界的地方，是神聖和清靜的象徵。許多宗教信仰中，山被視為神靈居住的地方，因此在山週圍建築寺廟可被認為是接近神靈，追求靈修和智慧的象徵。另外就是風水學，山水環繞的地方被視為「藏風聚氣」，有助於積聚和保持正能量，山提供了穩固的背景，被認為能帶來安全和安定。</p>
        <figure>
            <img src="/images/mtlogs/008/02.jpg">
        </figure>
        <p>「一步一步向前，一步一步輕快，一步一個微笑，嗨，朋友！山路晨霧朦朧，草木還在夢中，呼吸新鮮大氣，邁向光明。觀音山上健行健身，心情開朗多快樂！一步一步向前，一步一步輕快，呼吸新鮮大氣，邁向光明。」──〈觀音山健行歌〉</p>
        <p>沒有和弦曲調，但從歌詞似乎可以感受出這首歌輕快愉悅的弦律，然而，登山步道實際走起來實在很難令人發笑，若真有，可能也是啞然失笑吧！充滿年代感的階梯循著山勢向上綿延，又陡又峭，每一階之間的落差比尋常階梯還來得寬闊，簡直是名副其實的「爬樓梯」。從登山口到山頂之間乍看雖然只有短短七、八百公尺，但這不到一公里的距離，實際卻要爬升將近１５０公尺，單論其斜率在小百岳裡面也算前段班了。</p>
        <figure>
            <img src="/images/mtlogs/008/03.jpg">
        </figure>
        <p>小石門，稍作休息後就要挑戰最後一段，也是最陡峭的階梯步道。</p>
        <figure>
            <img src="/images/mtlogs/008/04.jpg">
        </figure>
        <p>步道通往山頂的終點處，同樣有一隻黃金佛手迎接，本來以為登山口的佛手是右手，那山頂這隻手應該會是左手，結果實際上兩隻手都是右手。出於好奇，整理登山照片的同時也順手上網查詢典故，原來在佛教觀世界觀裡，菩薩大多以右手持蓮花的形象呈現在凡世各類經典或創作，而右手在古印度文化也被視為尊貴與施捨之手，象徵慈悲與智慧的施予。這就解釋了為什麼南觀音山的佛手不是成對的左右手，皆以右手塑造於背後可是有著深遠意涵，膚淺如我！</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>前面說在二戰結束的幾十年後，有位名號瑺瑛法師的法師，於觀音山山頂興建一座寺廟，該寺廟便是「玉佛寺」。玉佛寺砌有三尊立佛塑像，分別是玉佛、彌勒佛、觀世音菩薩，這三尊分別代表佛教不同理念的佛像。</p>
        <figure>
            <img src="/images/mtlogs/008/05.jpg">
        </figure>
        <p>許多寺廟喜歡蓋在山上的原因，除了前面提到的宗教文化與風水層面的心靈考量外，於現實層面，山區的地勢有時候能夠提供天然的防禦屏障，讓寺廟免受外界侵擾，同時也能讓寺廟具有更好的觀景位置，吸引更多信徒和遊客前來朝聖。</p>
        <p>不得不說觀音山的展望確實很棒，不僅可以俯瞰鄰近的台中市區都市繁景，東面望去則可遠眺頭嵙山稜脈，以及更深遠的谷關七雄和鳶嘴稍來山稜線。</p>
        <figure>
            <img src="/images/mtlogs/008/06.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/008/07.jpg">
        </figure>
        <p>可能是因為視野變得太多開闊，反而遺漏了近處重要的事物。我在玉佛寺周圍饒了好幾圈，卻始終沒找著三角點的身影，問了幾個在椅子上休息，看似也像來爬山的山友有沒有看到三角點，他們也都搖了搖頭，心想該不會觀音山沒有三角點吧？就在我放棄準備原路折返下山的時候，突然撇見金色玉手的旁邊有一顆熟悉的突起物，這才恍然大悟地發現三角點就座落在福德正神祠廟的旁邊，因為祠廟牆體的顏色與基石顏色太過相近，才一直遲遲沒有發覺自己已經錯過它好幾回。</p>
        <figure>
            <img src="/images/mtlogs/008/08.jpg">
        </figure>
        <p>南觀音山，海拔高度３１８公尺，為台灣小百岳之一。在日治時期繪製的地圖就已經可以看到這座山標示為觀音山，但不知為何現今岳界皆以「南觀音山」來稱之，或許是全台灣命名為觀音山的山岳實在太多座，故想要有個區別？雖然台中沒有與之相對的北觀音山，不過在東勢區深處的雙崎部落，確實有一處名為「觀音山腳」的地方，在該地有一座被命名為觀音山的山峰，地理位置正好在南觀音山的東北方。看似沒有直接關聯的兩座山，是否就像神佛與信眾之間的距離，看不見實體卻在無形之中維繫著關聯。</p>
        <p>當下的我並沒有深入思考這個問題，身為登山客，只是單純地沉醉在冬日暖陽的照射底下，欣賞遼闊又清澈的山景，享受恬靜而優雅的午後時光，而大多數遠離塵囂，上山尋求慰藉的人客亦皆是如此。</p>
        <figure>
            <img src="/images/mtlogs/008/09.jpg">
        </figure>
        <p>身為城市喧囂的一粒凡塵，山終究還是得下的。原途折返回到小石門，意外發現小石門分割出兩條路徑，不過無論選擇走哪一條，兩條路徑在繞過石門後皆會合而為一，其實這就像來訪南觀音山的人們，無論是虔誠的信徒還是純粹的登山客，越過這道石門，大家再無分別，都是這渺渺塵世間的一份子。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>