<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="9" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>當與攀岩愛好者開啟台灣有哪些著名天然岩場的話匣子時，北部人可能會回答你皇帝殿、五寮尖、孝子山，或是近年很夯的劍龍稜；南部人則可能給出關子嶺岩場、獵鷹尖等答案。那麼中部呢？「鳶嘴山」這個名字肯定當仁不讓。且不侷限於攀岩界，假如上登山社群發問中級山的推薦名單，鳶嘴山肯定也是榜上有名──不光要面對各種岩石地形的阻礙才能攀上顛峰，下山則還得必須具備足夠的膽識。早在多年前，鳶嘴山已是許多喜愛冒險的登山人倍加推崇的中級山，每逢例假日，前來攀爬鳶嘴山的挑戰者可說是絡繹不絕，總是將狹窄的石道擠得水洩不通，足見這座譽為中部最美中級山之魅力。</p>
        <p>除了鳶嘴山，其所途經的大雪山林道上還有許多適合闔家大小攀登健行的山岳，緊鄰鳶嘴山隔壁的稍來山便是其一。稍來山不僅是小百岳一員，同時也是名聞遐邇的賞楓勝地，因此大多數登山客會將鳶嘴與稍來二山安排在一起縱走，而這條路線如今已規劃為「鳶嘴稍來山國家步道」，儼然是中部地區極富盛名的中海拔熱門登山路線。</p>
    </div>
    <div class="text-block">
        <h3>一、補班日</h3>
        <p>細數個人的登山生涯，鳶嘴山算是較早期挑戰的山岳，憶起剛踏入登山界的時候，就已耳聞鳶嘴山的名號，也為網路上各種驚險及美麗的影像記錄烙下非常深刻的印象。只是礙於自身膽小怕高，沒想過也不敢想會有挑戰祂的一天，想著安安份份走些簡單又安全的步道就好。</p>
        <p>但或許是經過前一週爬完加里山，在這座台版富士山之巔接受藍天、雲海、聖稜線共譜交織的動人樂章洗禮，回到平地後的登山魂仍熊熊燃燒著，幾天後向一起攀登加里山的友人詢問：這個週六是補班日，要不要去爬鳶嘴山？和我一樣都沒有補班困擾的友人當下豪爽地給出「走啊」答覆，爬鳶嘴山這件事便這樣很輕易地就定案下來。</p>
        <figure>
            <img src="/images/mtlogs/009/01.jpg">
        </figure>
        <p>但起先老實說自己是帶著友人應該不會答應的心態而半開玩笑似地詢問，若能被否決，還能藉此冷卻一下壓不太住的登山魂火，只是沒想到對面那廝竟然一點猶豫都沒有，反倒害自己陷入拉不下臉，只能硬著頭皮跟著上路的局面，真是自作孽、不可活．．．．．．呸呸！烏鴉嘴。</p>
        <p>由於平常就看慣了各大網路平台分享鳶嘴山的種種見聞和資訊，即便這個決定來得倉促，倒也沒有花費太多時間規劃和心理建設，之所以會選在補班日去挑戰鳶嘴山，一方面也是聽聞假日攀登鳶嘴山的人潮跟早上的菜市場沒什麼兩樣，都是滿滿的人潮。</p>
        <figure>
            <img src="/images/mtlogs/009/02.jpg">
        </figure>
        <p>與大多數人一樣，我們計畫從大雪山林道２７Ｋ處起登，只是當我們駕車從橫嶺山隧道穿出後，目睹道路兩側已經停滿車輛，雙雙不由得發出驚呼，即便補班日登山人數銳減，大雪山林道的停車位依舊難以招架前來挑戰鳶嘴山的登山客盛情。好在我們運氣不錯，駛離登山口沒多遠，正好撞見一車山友準備離開，於是便順勢填補了路邊車龍的缺口，否則還真不知道要停多遠，然後改由原本大眾默契建立的２７．３Ｋ登出口逆行上山。</p>
        <p>如果單純只有計畫攀登鳶嘴山，一般大眾路線會建議從大雪山林道２７Ｋ處登山口上山，從山頂切下稜線後於往稍來山的岔口下山，登出位置大約會是２７．３Ｋ處。之所以多數山友會有這樣非約定成俗的默契，主要還是稜線狹窄但登山客繁多，若方向不一致，在稜線交會時很容易塞車。</p>
        <figure>
            <img src="/images/mtlogs/009/03.jpg">
        </figure>
        <p>根據登山口的導覽指引，從２７Ｋ處登山口到鳶嘴山山頂僅僅只有一公里的距離，因此我們的登山鞋都還沒沾滿落葉土徑的黃沙，便已進入樹根盤結交錯與亂石嶙峋的複雜地形。當然，這樣等級的拉繩對鳶嘴山這個大魔王而言只不過是施捨給挑戰者暖身的仁慈而已。</p>
        <p>經過一處名為「二葉松」的涼亭之後，真正的考驗才要開始。</p>
    </div>
    <div class="text-block">
        <h3>二、鳶嘴</h3>
        <p>二葉松涼亭的存在，彷彿是在勸登山者量力而為所設立的，就在離開涼亭上切一小段石頭路後，輔助繩以肉眼可見的斜率急速向上竄升，視線沿著繩索延伸的方向抬頭仰望，一座僅近垂直的山壁聳立在身前。</p>
        <figure>
            <img src="/images/mtlogs/009/04.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/009/05.jpg">
        </figure>
        <p>如果是一週之前的我在這一關恐怕就會打退堂鼓，但經過加里山最後登頂前的洗禮，已經可以坦然面對這個等級的拉繩攀岩。</p>
        <p>接下來的地形幾乎皆與岩石稜線為伍，有時要手腳並用地往高處爬，有時則在石堆之間穿梭，過了一關緊接著又來一關。而當我們越往高處爬，便越是霧裡看花──白霧淹沒了這個山頭，除卻眼前的石頭與夾縫間的樹木，視線可及之處只剩一片虛無飄渺，白霧化作數縷輕煙循著稜線的方向發散，我們橫渡在其中，宛如置身於仙境求道的修仙者。</p>
        <figure>
            <img src="/images/mtlogs/009/06.jpg">
        </figure>
        <p>雜湊的喧囂聲從上風處傳遞下來，心知攀上這一段岩稜，山頂便到了。</p>
        <figure>
            <img src="/images/mtlogs/009/07.jpg">
        </figure>
        <p>鳶嘴山海拔高度２１９１公尺，因山勢尖聳挺拔，古早時期被稱為「大尖山」，之所以會有現今更具辨別度的稱呼，除了其山形外觀近似鳶嘴的原因外，在日治時期臺灣日日新報出版的《臺灣堡圖》裡，鳶嘴山一名便已存在。</p>
        <p>鳶嘴山山頂上的突稜是最著名的留影熱門景點，許多勇者會站在兩側深不見底的岩稜上，作出張開雙手試圖將天空收納為囊中物的姿勢。雖然我們也想仿效他人留下影像紀念，但無奈人潮實在太多，排隊動線的進展十分緩慢，再加上於山頂煮炊休息的人群，本就狹窄的腹地又更加擁擠地水洩不通，於是我們打消在山頂流連的念頭，決定早點下山。</p>
        <p>何況現下四面展望都是密不透風的白牆，且感覺再怎麼等候也盼不到雲開霧散的剎那，如此一來更沒有在山頂滯留的意義了，種種一切不如意就當作老天向我們傳達下次再來補考的旨意吧。</p>
        <p>然而，沒想到就連下山也在排隊！但，該說出乎意料嗎？見識過山頂擁塞的人群，又好像沒那麼意外。往下山的路宛如假日的國六交流道會入口，大小客車大排長龍，而眼前的人龍則沿著瘦稜一同隱沒在兩箭之地遠的迷霧當中，移動間隔幾乎可以用分鐘來計算。</p>
        <figure>
            <img src="/images/mtlogs/009/08.jpg">
        </figure>
        <p>此時不禁慶幸看不見下方的樣貌，否則釘在岩壁上看著兩側懸崖深不見底的深谷無法移動，恐怕會嚇到腿軟下不了山了吧！當然啦，人龍之所以移動緩慢，一方面除了因為登山客實在太多之外，另一方面也是因為有許多人心生膽怯而卡在岩壁上不敢動彈，導致上方的隊伍只能被迫留在原地等候。</p>
        <p>而這個時候就可以觀察山友們的素質百態，確實會從部份山友口中聽到不耐煩的咋舌聲，但他們多半仍會和其他大多數山友一樣，以鼓勵代替責罵──畢竟在這毫無防護的岩稜上，所有人都只能步步為營抱著岩稜踩著ㄇ字釘下切，萬一不小心失足摔落山谷，若能還保有性命只能說深受幸運女神眷顧，反之．．．．．．所以，相信誰都不希望自己一時的催促造成他人無法挽回的悲歌。</p>
        <p>但是也有那種悶不吭聲，一路插隊也不管他人安危，擅自搶走前方山友的踏點，毫無道德素質可言的山友，我們自認速度不慢，卻也被上面的大媽插隊硬搶了好幾次踩點，只能面面相覷露出無奈的表情，無論如何，當下最重要的事情還是保持專注，安全下山。</p>
        <figure>
            <img src="/images/mtlogs/009/09.jpg">
        </figure>
        <p>大約陡下兩或三個階段的岩稜後，路況開始轉回較常見的土石路徑，地勢也和緩許多，揪成一團的眉頭直到確定踩在滿地落葉鋪蓋的土徑上，才得以安心鬆綁開來。</p>
        <figure>
            <img src="/images/mtlogs/009/10.jpg">
        </figure>
        <p>很快地我們便來到稍來山及２７．３Ｋ處登山口的岔路，本來我們此行是打算一口氣走完鳶嘴、稍來二山，但是在稜線下切那段花費超乎預期的時間，我們並沒有準備非常充分的糧食和補給，眼看時間已接近正午，彼此的胃袋也依稀開始發出咕嚕咕嚕的低吼，經過討論後決定放棄繼續稍來山的行程（天公也不太作美），提前下山覓食去犒賞本次鳶嘴山的成功攀登。</p>
        <p>所以下次要再來補考嗎？嗯．．．．．．再好好想想吧。</p>
    </div>
    <div class="text-block">
        <h3>三、隨興捎來</h3>
        <p>「等等要不要去爬山？」「好啊！」某日上午，與友人一時興起，相約下午去爬座山健行一番，我們還在思考要去哪兒的時候，突然想起半年前被我們放生的稍來山，趕緊查了一下單純走稍來山路徑的步道有多長，嗯．．．．．．從大雪山林道３０．５Ｋ登山口到稍來山三角點距離不過兩公里，二話不說立刻整裝出發，去把當時的缺憾給彌補起來。</p>
        <figure>
            <img src="/images/mtlogs/009/11.jpg">
        </figure>
        <p>若要循著鳶嘴稍來步道正統的規劃路線，單趟足足有６．７公里長，這很難在半天內來回，而且意味著還得再爬一次鳶嘴山，然後在稜線上演各種天人交戰的內心戲。所以我們走的是偷吃步路線，從大雪山林道３０．５Ｋ處的登山口直接上切到鳶嘴稍來步道。</p>
        <figure>
            <img src="/images/mtlogs/009/12.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/009/13.jpg">
        </figure>
        <p>相較於隔壁鳶嘴山在岩稜間攀上陡下的狠辣，稍來山山徑簡直像個慈眉善目的老爺爺，儘管偶爾有些需要借助拉繩輔助的高地落差地形，不過整體而言步道都在林蔭間度過。聽說稍來的楓紅曾多次出現在每年秋季賞楓季的推薦名單上，只可惜我們造訪的這天是春雨欲來的四月天，無福消受一睹熟悉的綠油油山景換上朱紅色的袈裟。</p>
        <p>就留到來年猴年馬月的秋季再和鳶嘴山一同補考吧！</p>
        <figure>
            <img src="/images/mtlogs/009/14.jpg">
        </figure>
        <p>我們大約只花一個小時左右便抵達了稍來山的三角點，以及其最著名的瞭望台所在的山頂腹地。該瞭望台於１９５６年建造，主要做為巡山員間是森林火災用途，如今已閒置不用，成為民眾登高望遠的視野絕佳之處。</p>
        <p>稍來山，海拔２３１９公尺，不僅為小百岳一員，也被評選進台灣百名山的名冊之中。</p>
        <figure>
            <img src="/images/mtlogs/009/15.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/009/16.jpg">
        </figure>
        <p>從瞭望台可以清楚地看見西北西側的鳶嘴山與肥崠山綿延的山稜線，稍來山的地理位置特點正好處於鳶嘴山肥崠山（西北西）、船型山鞍馬山（東北）、屋我尾（南）三條稜脈的交會點，在地理學上又稱其為三叉峰。或許正因為這個緣故，稍來山步道的規劃也可與向上述各方向的山岳串聯成縱走路線，即使不是賞楓季節，前來爬山的民眾也依然絡繹不絕。或許在這個瞭望台裡，常常可以聽到來自不同路線的登山客於此會師，互相分享自己一路走來的有趣見聞呢。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>