<script setup lang="ts">
// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";
</script>

<template>
    <BaseTextContent>
        <Title :propValue="10" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-block">
        <h3>序、楔子</h3>
        <p>自古以來，五指山始終是文人雅士和登山前輩心目中的名山，像是全淡八景、塹南八景、台灣十二名勝、台灣百大名山、小百岳．．．．．．等等族繁不及備載。</p>
    </div>
    <div class="text-block">
        <h3>一、仙氣凝聚</h3>
        <p>早上在飛鳳山與萍水相逢的山友閒話家常，聽到我們下山後中午要接著去五指山，便說五指山一帶中午過後時常大霧瀰漫、路徑濕滑，叮嚀我們要多留意腳步。果不其然，還在大坪路蜿蜿蜒蜒時就遠遠看到遠方的山頭已被一片白濛給吞噬，無緣一見那傳頌數十年的名景「指峰凌霄」，儘管可惜，倒也無損我們登山的興致。</p>
        <figure>
            <img src="/images/mtlogs/010/01.jpg">
        </figure>
        <p>由於五指山的人文發展歷史很早，所以此地廟宇林立，我們將車停放在廟街的起頭受北宮，然後徒步前往登山步道口。途中經過受北宮、灶君堂、玉皇宮等寺廟，儼然是佛道兩教的宗教聖地。其中「灶君堂」應該是這一帶歷史最悠久的廟宇，建造時間可追溯至清朝光緒年間，風水師將此地視為靈穴而建廟祭拜。灶君指的是華夏文化主掌廚房與飲食的灶神，在台灣算是比較鮮少廟宇主祀的神明，而這座灶君堂傳說是全台灣第一座主供灶神的廟宇，每逢歲末灶君誕辰，前來朝聖的信徒、香客可謂絡繹不絕。</p>
        <p>而緊鄰灶君堂隔壁的則是玉皇宮，主祀玉皇大帝，廟宇落成時間晚於灶君堂，主殿上匾額題字「凌霄寶殿」的凌霄二字，所指正是五指山「指峰凌霄」。</p>
        <figure>
            <img src="/images/mtlogs/010/02.jpg">
        </figure>
        <p>穿過玉皇宮，循著五指山路繼續步行，陸陸續續還會經過財神爺廟、齊天大聖爺、仙洞等廟宇名勝的岔口，山路終點則有一座佛寺，名為「竹林禪苑」，和前面的道教廟宇相比顯得簡陋許多，而五指山的其中一個登山口便在面向禪苑的右側。</p>
        <figure>
            <img src="/images/mtlogs/010/03.jpg">
        </figure>
        <p>雖說五指山登山步道系統錯綜複雜，但其實主要就兩條主軸，一條是腰繞路，不上山，單純沿著山腰行走，名叫五指山橫向登山步道，比較適合普通民眾健行，感受香火與山林交織的美麗。另一條則是扶搖直上的五指山登山步道，由階梯與傳統土石山徑鋪成，難度較高，為登山客健腳行程。</p>
        <p>我們的目標是登頂，自然是選擇要直上山頭的路線了，一開始直到與橫向步道的交會點之前，基本上都是走在人工鋪設好的階梯，穿過交岔口後，石砌階梯出現的頻率少了，開始摻雜有些華的原始土徑，隨著路徑越來越陡峭，熱鬧的鑼鼓聲離我們越來越遠，爬山的感覺愈發強烈。</p>
    </div>
    <div class="text-block">
        <h3>二、指峰凌霄</h3>
        <p>五指山，顧名思義就是山形由五座山峰相連，宛若人類的五根手指，五指山一名早在清朝時期便以出現，當時《淡水廳志》就以「五指連雲」列入塹南八景之一，顯現五指山在彼時便以名聲顯赫。除此之外，五指山於地理層面也是新竹重要的參考地點，根據鄭用錫《淡水廳志稿》〈山川篇〉的描述，竹塹城址有五指山為「祖山」，其龍脈由五指山中指逶迤西行至金山面，再西下延粟湖至十八尖山，金山面為「少祖山」，十八尖山為「父母山」。</p>
        <p>以五指山為交界的北埔鄉，有個「金廣福」這個名聲響亮的國定古蹟，金廣福指的是早前開墾北埔與大隘地區一帶，以姜家為首成立的拓墾組織。據說姜家在開墾時就曾借鑑五指山的風水地理「龍」、「穴」、「砂」、「水」，格局十分完整，以此定下金廣福墾號對該地區重大影響力的基礎，由此可見五指山地理位置的重要性。</p>
        <figure>
            <img src="/images/mtlogs/010/04.jpg">
        </figure>
        <p>從竹林禪苑登山口起登，會先來到五指山的「拇指峰」，拇指峰海拔１０２４公尺，沒有基石。過了一指，表示還有四指，不過起伏已沒有像登上拇指前的爬升那麼劇烈。</p>
        <p>據說在一些登山地圖，拇指峰是從竹東側開始算起，依序是拇指、食指、中指、無名指、小指，恰好與竹林禪苑起登，由林務局規劃路線所命名的順序相反，只有中指是最沒爭議的。不過這也沒什麼，純粹就是位置不同、看的方向不同罷了，不管從哪裡起行，走的都是同一座山岳。</p>
        <figure>
            <img src="/images/mtlogs/010/05.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/010/06.jpg">
        </figure>
        <p>不消一會兒，便來到食指，食指峰海拔高度１０４０公尺，同樣沒有基石。</p>
        <p>五指山的食指與中指之間的山坳，是北埔鄉、竹東鎮、五峰鄉這三個行政區域的交界處。說到五峰鄉，我們就突然心生好奇，該不會五峰鄉的「五峰」由來，所指便是五指山這五座山峰吧？雖然沒有找到具體的來源論證，不過根據網路上可查詢到的資料，皆說明五峰鄉命名的源由確實取自於五指山，有形無形之間又更證明了五指山在早期究竟有多麼著名。據報導記載，我們現在看到的遊客數量，其實還不及五指山全盛期的五到十分之一，全是因為十幾二十年前歷經多次風災摧殘，加上早年設立的遊樂設施老舊損壞，才逐漸導致五指山的「沒落」。</p>
        <figure>
            <img src="/images/mtlogs/010/07.jpg">
        </figure>
        <p>步道全程都穿梭在林相之間，雖然沒有風景可看，但群木聳立在茫茫白霧之間散發著縷縷仙氣，而我們這些登山客宛如求道者，在飄渺之中尋找方向。</p>
    </div>
    <div class="text-block">
        <h3>三、五指血淚</h3>
        <p>五指山不只在漢人眼裡是非常重要的開拓據點，對原本就生活在寶島土地的原住民更是如此。定居於五指山周遭的原住民族群主要為泰雅族與賽夏族，一如其他地域發展史，當漢人與原住民接觸時，無可避免地就會爆發衝突，雙方互有死傷。到了日治時期，日不落帝國派軍前來接收台灣，漢人、原住民、日本人三方之間的關係又演化地更加複雜。初期日本人為了盡速弭平漢人反抗勢力，便與原住民交好，一方面是想藉助原住民的協助剿滅漢人，一方面是避免腹背受敵；而對原本與漢人就有仇恨的原住民而言，日本人釋出的善意讓他們認為日本人和漢人是不一樣的，是友好可以親近的民族，便大力協助日軍驅逐漢人。然而隨著反日勢力逐漸黯淡，開墾需求已重於撫卹，定居山林的原住民反而成為了日本人的眼中釘，曾經承諾日本人不會進入蕃地的承諾，隨著士兵和火炮的進駐，成為砲火中的一縷硝煙。</p>
        <figure>
            <img src="/images/mtlogs/010/08.jpg">
        </figure>
        <p>中指峰，海拔高度１０６２公尺，有一顆二等三角點基石。在清朝出版《淡水廳志》紀載的「全淡八景」中，五指山作為「指峰凌霄」位列八景其中一席，用來形容五指山之山勢壯闊與秀麗，當代詩人陳朝龍便曾以「萬仞攀躋絕頂難，擎天隻手拓奇觀。披圖指點煙霞外，面目真如指掌看。」一詩來表達其對五指山的盛讚。</p>
        <p>對當時得知被日本人為一時權宜而宣示的謊言所欺騙的原住民們，當下心情或許和每個來到中指峰的人們一樣，很想豎起中指這個國際通用手勢宣洩情緒吧，但差別是前者懷抱著絕望和憤慨，而後者只是單純感到好玩有趣。事實上，早早就進入五指山山區入墾開拓的北埔姜家與日本總督政府也曾有過衝突，割讓初期姜家加入反抗義勇軍勢力，不幸壯烈成仁，但仍有部分人士逃到大隘地區等待東山再起的機會，後來日軍反過來欺壓原住民，這些過去曾互相仇視的漢人與原住民，決定聯手起義反抗，便爆發了日本治台後第一個武裝抗日事變，俗稱「北埔事件」。</p>
        <p>儘管北埔事件最終以失敗收場，卻也埋下了日後另一場重大原住民抗日事件的種子──也就是「霧社事件」。</p>
        <figure>
            <img src="/images/mtlogs/010/09.jpg">
        </figure>
        <p>原本行前有打算將五指全走完，然而在中指峰小休期間，遇到一對剛從後兩指返回的夫妻檔，他們直言步道過於溼滑，苦口婆心地勸我們放棄。禁不住他們二老的婉勸，加上時間也確實有些晚了，我們便順他們的意思打道回府，無妨，反正象徵五指山登頂的三角點已經蒐集到了，以後有機會再回來補齊後面兩指。</p>
        <p>我們曾在食指峰往中指峰的途中注意到一條下切的路線，當下曾詢問正要借道該路線的山友，得知這條路線是下山的捷徑，可直接通往財神爺廟，於是我們回程決定從這條山徑下山。</p>
        <p>指不過這條路線地勢十分陡峭，多處需要拉繩輔助，且一路倒木、石頭青苔茂密，每一步都得小心翼翼。不過對有著「下山達人」稱號的友人來說似乎沒什麼障礙，下山健步如飛的他沒一會兒工夫就把我遠遠甩在後頭。</p>
    </div>
    <div class="text-block">
        <h3>四、</h3>
        <figure>
            <img src="/images/mtlogs/010/10.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/010/11.jpg">
        </figure>
    </div>

    https://gshms.com/%E4%BA%94%E6%8C%87%E5%B1%B1/
    https://digitalarchives.tw/Exhibition/4185/1.html
    https://www.vrwalker.net/tw/topicpage/topic_taiwan_top_scenery8.php
    https://www.hsinchu.gov.tw/News_Content.aspx?n=153&s=244703
</div>
<!-- end -->
    </BaseTextContent>
</template>