<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：灶君堂' },
    { id: 2, title: '2K：指峰凌霄' },
    { id: 3, title: '3K：中指峰' },
    { id: 4, title: '4K：齊天大聖爺' },
    { id: 5, title: '5K：後記' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="10" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2020-11-29</strong></p>
        <p><span>行走總長：</span><strong>約 5.5 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 3 HR</strong></p>
        <p><span>路程總覽：</span><strong>五指山受北宮 → 竹林禪苑 → 五指山步道 → 拇指峰 → 食指峰 → 中指峰</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>於風水師形勢法觀點，鵝公髻山與五指山可以分為視為北埔的太祖山與少祖山，為龍脈的發源地，蜿蜒至秀鑾山是為父母山，是為「龍」；北埔慈天宮廟地即胎息與孕育之所在，是為「穴」；廟前兩側皆有崗巒圍護，正前方則有龍鳳髻山為朝山，是為「砂」；大湖與大坪兩溪自秀巒山南北兩麓匯合於前，是為「水」。集齊「龍」、「穴」、「砂」、「水」四大元素，孕育出北埔地區繁榮一時的市況，著名的金廣福墾號便是紮根於此。同時漢人亦將信仰引渡進來，五指山佛道兩教廟宇林立，香火鼎盛，紅極一時。全淡八景、塹南八景、台灣十二名勝、台灣百大名山、小百岳．．．．．．自古以來，五指山便是文人雅士和岳界前輩心目中的名山。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>早上在飛鳳山與萍水相逢的山友閒話家常，聽到我們下山後中午要接著去五指山，便說五指山一帶中午過後時常大霧瀰漫、路徑濕滑，叮嚀我們要多留意腳步。果不其然，還在大坪路蜿蜿蜒蜒時就遠遠看到遠方的山頭已被一片白濛給吞噬，無緣一見那傳頌數十年的名景「指峰凌霄」，儘管可惜，倒也無損我們登山的興致。</p>
        <figure>
            <img src="/images/mtlogs/010/01.jpg">
        </figure>
        <p>由於五指山的人文發展歷史很早，所以此地廟宇林立，我們將車停放在廟街的起頭受北宮，然後徒步前往登山步道口。途中經過受北宮、灶君堂、玉皇宮等寺廟，儼然是佛道兩教的宗教聖地。其中「灶君堂」應該是這一帶歷史最悠久的廟宇，建造時間可追溯至清朝光緒年間，風水師將此地視為靈穴而建廟祭拜。灶君指的是華夏文化主掌廚房與飲食的灶神，在台灣算是比較鮮少廟宇主祀的神明，而這座灶君堂傳說是全台灣第一座主供灶神的廟宇，每逢歲末灶君誕辰，前來朝聖的信徒、香客可謂絡繹不絕。</p>
        <p>而緊鄰灶君堂隔壁的則是玉皇宮，主祀玉皇大帝，廟宇落成時間晚於灶君堂，主殿上匾額題字「凌霄寶殿」的凌霄二字，所指正是五指山「指峰凌霄」。</p>
        <figure>
            <img src="/images/mtlogs/010/02.jpg">
        </figure>
        <p>穿過玉皇宮，循著五指山路繼續步行，陸陸續續還會經過財神爺廟、齊天大聖爺、仙洞等廟宇名勝的岔口，山路終點則有一座佛寺，名為「竹林禪苑」，和前面的道教廟宇相比顯得簡陋許多，而五指山的其中一個登山口便在面向禪苑的右側。</p>
        <figure>
            <img src="/images/mtlogs/010/03.jpg">
        </figure>
        <p>雖說五指山登山步道系統錯綜複雜，但其實主要就兩條主軸，一條是腰繞路，不上山，單純沿著山腰行走，名叫五指山橫向登山步道，比較適合普通民眾健行，感受香火與山林交織的美麗。另一條則是扶搖直上的五指山登山步道，由階梯與傳統土石山徑鋪成，難度較高，為登山客健腳行程。</p>
        <p>我們的目標是登頂，自然是選擇要直上山頭的路線了，一開始直到與橫向步道的交會點之前，基本上都是走在人工鋪設好的階梯，穿過交岔口後，石砌階梯出現的頻率少了，開始摻雜有些華的原始土徑，隨著路徑越來越陡峭，熱鬧的鑼鼓聲離我們越來越遠，爬山的感覺愈發強烈。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>五指山，顧名思義就是山形由五座山峰相連，宛若人類的五根手指，五指山一名早在清朝時期便以出現，當時《淡水廳志》就以「五指連雲」列入塹南八景之一，顯現五指山在彼時便以名聲顯赫。除此之外，五指山於地理層面也是新竹重要的參考地點，根據鄭用錫《淡水廳志稿》〈山川篇〉的描述，竹塹城址有五指山為「祖山」，其龍脈由五指山中指逶迤西行至金山面，再西下延粟湖至十八尖山，金山面為「少祖山」，十八尖山為「父母山」。</p>
        <p>以五指山為交界的北埔鄉，有個「金廣福」這個名聲響亮的國定古蹟，金廣福指的是早前開墾北埔與大隘地區一帶，以姜家為首成立的拓墾組織。據說姜家在開墾時就曾借鑑五指山的風水地理「龍」、「穴」、「砂」、「水」，格局十分完整，以此定下金廣福墾號對該地區重大影響力的基礎，由此可見五指山地理位置重要性。</p>
        <figure>
            <img src="/images/mtlogs/010/04.jpg">
        </figure>
        <p>從竹林禪苑登山口起登，會先來到五指山的「拇指峰」，拇指峰海拔１０２４公尺，沒有基石。過了一指，表示還有四指，不過起伏已沒有像登上拇指前的爬升那麼劇烈。</p>
        <p>據說在一些登山地圖，拇指峰是從竹東側開始算起，依序是拇指、食指、中指、無名指、小指，恰好與竹林禪苑起登、由林務局規劃路線所命名的順序相反，只有中指是最沒爭議的。不過這也沒什麼，純粹就是位置不同、看的方向不同罷了，不管從哪裡起行，走的都是同一座山岳。</p>
        <figure>
            <img src="/images/mtlogs/010/05.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/010/06.jpg">
        </figure>
        <p>不消一會兒，便來到食指，食指峰海拔高度１０４０公尺，同樣沒有基石。</p>
        <p>五指山的食指與中指之間的山坳，是北埔鄉、竹東鎮、五峰鄉這三個行政區域的交界處。說到五峰鄉，我們就突然心生好奇，該不會五峰鄉的「五峰」由來，所指便是五指山這五座山峰吧？雖然沒有找到具體的來源論證，不過根據網路上可查詢到的資料，皆說明五峰鄉命名的源由確實取自於五指山，有形無形之間又更推升了五指山在過去輝煌的真實性。據報導記載，我們現在看到的遊客數量，其實還不及五指山全盛期的五到十分之一，全是因為十幾二十年前歷經多次風災摧殘，加上早年設立的遊樂設施老舊損壞，才逐漸導致五指山的「沒落」。</p>
        <figure>
            <img src="/images/mtlogs/010/07.jpg">
        </figure>
        <p>步道全程都穿梭在林相之間，雖然沒有風景可看，但群木聳立在茫茫白霧之間散發著縷縷仙氣，而我們這些登山客宛如求道者，在飄渺之中尋找方向。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>五指山不只在漢人眼裡是非常重要的開拓據點，對原本就生活在寶島土地上的原住民更是如此。定居於五指山周遭的原住民族群主要為泰雅族與賽夏族，一如其他地域發展史，當漢人與原住民接觸時，無可避免地就會爆發衝突，雙方互有死傷，即便漢人逐漸控制北埔地區，仍時不時爆發零星衝突。到了日治時期，日不落帝國派軍前來接收台灣，漢人、原住民、日本人三方之間的關係又演化地更加複雜。初期日本人為了盡速弭平漢人反抗勢力，便與原住民交好，一方面是想藉助原住民的協助剿滅漢人，一方面是避免腹背受敵；而對原本與漢人就有仇恨的原住民而言，日本人釋出的善意讓他們認為日本人和漢人是不一樣的，是友好可以親近的民族，便大力協助日軍驅逐漢人。然而隨著反日勢力逐漸黯淡，開墾需求已重於撫卹，定居山林的原住民反而成為了日本人的眼中釘，曾經承諾日本人不會進入蕃地的承諾，隨著士兵和火炮的進駐，成為砲火中的一縷硝煙。</p>
        <figure>
            <img src="/images/mtlogs/010/08.jpg">
        </figure>
        <p>中指峰，海拔高度１０６２公尺，有一顆二等三角點基石。在清朝出版《淡水廳志》紀載的「全淡八景」中，五指山作為「指峰凌霄」位列八景其中一席，用來形容五指山之山勢壯闊與秀麗，當代詩人陳朝龍便曾以「萬仞攀躋絕頂難，擎天隻手拓奇觀。披圖指點煙霞外，面目真如指掌看。」一詩來表達其對五指山的盛讚。</p>
        <p>對當時得知被日本人為一時權宜而宣示的謊言所欺騙的原住民們，當下心情或許和每個來到中指峰的人們一樣，很想豎起中指這個國際通用手勢宣洩情緒吧，但差別是前者懷抱著絕望和憤慨，而後者只是單純感到好玩有趣。看見別人拍照都一手拎著不知是哪位熱心民眾製作的中指峰木牌，另一隻手則豪不避諱地向周遭人豎起中指，輪到我們時於是也有樣學樣，氣氛好不歡樂。我想，這大概是全台唯一一個比中指也不會遭人怨懟的地方了吧？</p>
        <p>事實上，早早就進入五指山山區入墾開拓的北埔姜家與日本總督政府也曾有過衝突，割讓初期姜家加入反抗義勇軍勢力，不幸壯烈成仁，但仍有部分人士逃到大隘地區等待東山再起的機會，後來日軍反過來欺壓原住民，這些過去曾互相仇視的漢人與原住民，決定聯手起義反抗，便爆發了日本治台後第一個武裝抗日事變，俗稱「北埔事件」。</p>
        <p>儘管北埔事件最終以失敗收場，卻也埋下了日後另一場重大原住民抗日事件的種子──也就是「霧社事件」。</p>
        <figure>
            <img src="/images/mtlogs/010/09.jpg">
        </figure>
        <p>原本行前有打算將五指全走完，然而在中指峰小休期間，遇到一對剛從後兩指返回的夫妻檔，他們直言步道過於溼滑，苦口婆心地勸我們放棄。禁不住他們二老的婉勸，加上時間也確實有些晚了，我們便順他們的意思打道回府，無妨，反正象徵五指山登頂的三角點已經蒐集到了，以後有機會再回來補齊後面兩指。</p>
        <p>我們曾在食指峰往中指峰的途中注意到一條下切的路線，當下曾詢問正要借道該路線的山友，得知這條路線是下山的捷徑，可直接通往財神爺廟，於是我們回程決定從這條山徑下山。只不過這條路線地勢十分陡峭，多處需要拉繩輔助，且一路倒木、石頭青苔茂密，每一步都得小心翼翼。不過對有著「下山達人」稱號的友人來說似乎沒什麼障礙，下山健步如飛的他沒一會兒工夫就把我遠遠甩在後頭。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <div class="mtlogs-title" v-text="catalog[4].title"></div>
        <p>從食指與中指之間的下凹捷徑陡下會與親民路線的橫向步道相接，我們錯過了另一條有名的猴洞步道──有著著名景點「猴洞一線天」，而是往玉皇宮的方向走去。途中經過一處用鐵皮簡陋建造的小廟，屋簷燈籠寫著「齊天大聖爺」五個字，裡頭供奉的正是《西遊記》中的主角：齊天大聖孫悟空。</p>
        <figure>
            <img src="/images/mtlogs/010/10.jpg">
        </figure>
        <p>廟宇附近有一塊石頭，用黃底紅字漆上「齊天大聖腳印」的字樣，仔細一看，石頭上方有一塊長條形的低窪，裡頭還殘留著少許的積水，要說那是腳印還真有幾分相似。根據當地人的傳說，猴洞一線天原本是一塊巨大的石頭，正是用來鎮壓西遊記中的那隻潑猴，所以當地人稱之為猴洞，後來某一天巨石迸裂，潑猴從石頭內逃脫，再之後的故事我想你我想必應該都耳熟能詳了。或許這個故事放到現在會讓許多人啼笑皆非，時空不對、地點不對，故事也純屬虛構。只不過既然叫五指山，自然而然少不了經典神話故事的點綴，為這座名山增添更多趣味。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[5].id">
        <div class="mtlogs-title" v-text="catalog[5].title"></div>
        <p>除了前面提到的塹南八景與台灣十二名勝，在無名指峰下的觀音禪寺前有一硯臺石，硯臺石側面刻有「台灣二十勝總投票數一千三百十一萬七千三百十一枚，占全島二十景勝地之第七位，民國十六年八月」，意思是民國十六年《臺灣日日新報》曾舉辦過一場名為台灣二十勝景的選拔，所謂二十勝景，指的應該是「台灣八景十二勝」，其中新竹五指山最終票選結果獲得第七名，可見五指山在當時民眾的地位性。</p>
        <p>有趣的是，當時八景十二勝的最終投票記數高達三億六千萬票，遠超當時台灣總數四百萬上下人口，各地區官民團體為擁護自家景點可謂不遺餘力。至於在那個動盪不安的年代為什麼會舉辦這樣一個休閒娛樂取向的活動，《臺灣日日新報》給的理由如下：</p>
        <p>「……臺灣山水景色豐富，未能廣為人知的史蹟名勝也很多……內地長期以來對臺灣的印象為瘴癘之地與蕃人聚居，希望能運用宣傳改變形象……藉此活動能開發旅行景點、完善交通與相關設施……也作為地理教學應用，並激發愛鄉土之情……」總督府與各州官員接著輪番登報發表談話，希望能藉此豐富休閒生活、多接觸大自然與史蹟、開發觀光產業云云，表達支持之意。一方面選出適合推動觀光旅遊的景點，也一方面宣傳總督府平定臺灣全境與拓展各地建設的功績。</p>
        <figure>
            <img src="/images/mtlogs/010/11.jpg">
        </figure>
        <p>從首登之後時隔數年數月又陸續造訪了五指山兩次，可惜都和第一次一樣，山頭總是為仙氣籠罩，難以看清全貌。直到最近去爬五指山隔壁的鵝公髻山，這才清楚地窺見五指連峰的袈裟。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>