<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '序、楔子' },
    { id: 1, title: '壹、知高圳' },
    { id: 2, title: '貳、雪蓮步道' },
    { id: 3, title: '參、黃金學田' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="11" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <h2 v-text="catalog[0].title"></h2>
        <p>寶島台灣四面環海，地勢由東西兩側向中央逐漸隆起，孕育出上百座高山，無論何時都不乏試圖攀上顛峰的挑戰者。相較於中央，沿海地區的山麓不僅稀少，高度也不高，比起動輒三千公尺的百岳，絕大多數都是高度不足一千的郊山，卻也因為如此，祂們比起百岳群峰更加平易近人，是許多平民百姓休閒健走的好去處。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <h2 v-text="catalog[1].title"></h2>
        <p>說到台中市海線地區的郊山，大多人直覺想到的是位於大甲，名列小百岳之一的鐵砧山；或是牛罵頭文化遺址的所在地──鰲峰山，再不然就是同樣富有濃郁歷史醍醐味的大肚山了。事實上，在大肚山隔壁還有一座小山，名喚「學田山」，一座於近幾年因網美紛沓前來取景一炮而紅，熱門度不亞於前述提及的幾座台中海線郊山。前往學田山的登山路線主要有兩條，一條由善光寺旁側進入，停車位多但需爬升高度較高（但其實也不過百公尺左右）；另一條山徑則位於成功西路山腰，距離短且平緩，僅需五分鐘便能觸及三角點，缺點則是停車不便，又鄰近公墓區，一不留神就可能叨擾諸多先人好眠。</p>
        <figure>
            <img src="/images/mtlogs/011/01.jpg">
        </figure>
        <p>此行從善光寺出發，接上通往學田山的雪蓮步道之前，會先踏上知高圳步道。圳，意指指灌溉用的水渠，知高圳歷史脈絡雖然最早可追溯至清代，但真正使其發揮最大功效的時期乃至日治時期，日人將原本石砌結構改為水泥工法拓展興修，引進筏子溪的水流，不僅解決大肚臺地西側時常缺水的問題，也滋養了南屯、烏日、大肚等地區的農田用水所需，時至今日這條長約十五公里的水圳也依然持續流淌著。</p>
        <figure>
            <img src="/images/mtlogs/011/02.jpg">
        </figure>
        <p>為什麼會說知高圳解決了靠海的大肚臺地西麓時常缺水的問題？細數大肚臺地的漢人發展拓墾史，許多定居在西麓一帶的居民，日常生活主要用水來源除了蒐集雨水，多只能依賴自然或人為開鑿的湧泉，從「龍目井」、「瑞井」、「番仔井」等地名便能看出一二。早期漢人在臺地高處其地勢較高緣故，取水較不易，在聚落發展上受限更大。且礙於水源稀缺，種植皆以旱田耕作，耕作多為麻、甘薯、甘蔗、落花生這類多為看天田的作物。因此知高圳的開拓，從臺地東側筏子溪引水進來，讓長期缺乏水源的臺地西側有了較穩定的取水來源，由此可見水圳的重要性。</p>
        <p>知高圳步道循著水圳渠路鋪設，走著走著，我們可以看到水流在半空中潺潺流淌而過，這是因為水圳部分圳道經過的地勢較高，故建立引水橋以引水過河，形成「河上有河」的有趣景象。</p>
        <figure>
            <img src="/images/mtlogs/011/03.jpg">
        </figure>
        <p>像這樣的渡槽引水橋一共有十處，根據當地人說法，若逢大水時期，水流會從引水橋兩側溢出，宛若瀑布般宣洩而下，這又是另一幅奇觀。除了引水橋之外，知高圳還採取一種名為「倒吸虹工」的排水工法，在現代水工建築工法裡，水工大致可分為「跌水工」、「分水工」、「倒吸虹工」、「流末工」等形式，它們分別各自扮演不同的角色，其中倒吸虹工的原理是透過壓力作用，利用上下游水位差使水流得以順利通過地形。</p>
        <p>倒吸虹工在日治時期就已廣泛運用各大水工設施，例如著名的嘉南大圳，其北幹線就利用此原理將與河道高度相近的渠道，於交會處將渠道從路面或河道下穿過。另外台中和平山區的白冷圳也是採用相同的原理，利用高低位差的大氣壓力，將俯衝而下的水流落底時因為壓力而往另一個方向的高處推升，就像遊樂園的雲霄飛車，疾駛俯衝的作用力就能使座車往高處衝刺好一段距離。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <h2 v-text="catalog[2].title"></h2>
        <p>知高圳步道的終點會與車用馬路相接，登往學田山的步道則在知高圳步道途中的一個岔口，名為「雪蓮步道」，一不留神可是很容易錯過這條又匿名為「好漢坡」的原始山徑。（但是Ｎ年後再訪，不起眼的登山步道口不僅大幅拓寬，原本的土石山徑也已經鋪設成舒適好走的水泥路面）</p>
        <figure>
            <img src="/images/mtlogs/011/04.jpg">
        </figure>
        <p>雪蓮步道遮蔽不多，沿途曝曬感強，若在盛夏時分前來，防曬與水源都是行前準備必須思索的課題。不過卻也正因遮蔽物少，步道全程展望極佳，抬頭可望青草滿遍山坡，回首又可俯瞰城市叢林。如果在氣候條件良好的情況下前來，會使人有種自己身在中級山的錯覺，渾然忘記學田山的海拔不過一百多公尺而已。</p>
        <figure>
            <img src="/images/mtlogs/011/05.jpg">
        </figure>
        <p>隨著腳步距離地心越遠，視野變得更加開闊，眼簾所盡之處是各種建築林立，對那些從年少時期就常登頂學田山俯瞰城市光景的老年人來說，想必見證了台中南屯烏日一帶從純樸走向繁榮的過程吧。</p>
        <figure>
            <img src="/images/mtlogs/011/06.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/011/07.jpg">
        </figure>
        <p>學田山的三角點就座落在山頂最顯眼，乍看還以為是台中版金城武樹的大樹底下。</p>
        <p>因為知高圳的建造，因耕地沿知高圳開拓而聚集的部落越來越多，命名大多也都和「水」與「田」有關，譬如王田、學田等，那麼學田山為什麼會叫做學田呢？事實上，在清朝時期，地圖上就已經存在「學田莊」之稱呼。據說當時陳姓長老為普及子弟教育，設置若干田為「施田」，將收入的租金充為貧寒子弟就試川資，「學田」之名由此而來。且社區居民以陳姓居多，大致分佈在山頂仔、崙仔、番仔井等地。</p>
        <p>這讓我想起了烏日著名古蹟「聚奎居」──這棟始建於日治時期，充滿巴洛克華麗元素的洋樓，其主人陳紹宗正是姓陳，聚奎居在當年不僅是富商豪宅的代表，聚奎居中的「奎」字，背後涵義所指便是古代星宿中的文曲星，亦即主管文運與考試的星宿，由此可見聚奎居在當時與學田村以學聞名的特色相互輝映謀合。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <h2 v-text="catalog[3].title"></h2>
        <p>如今前來學田山的訪客，大多已不再是辛辛學子，欲深入認識當地歷史文化的人已不再是多數，更多的人是衝著學田山美麗的夕陽與夜景而來，或是爭相目睹每逢秋冬之際，盛開的芒草將整片山野裹上一層黃白色調，當日落黃昏的剎那，草浪更有如麥穗般金黃，美不勝收。</p>
        <figure>
            <img src="/images/mtlogs/011/08.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/011/09.jpg">
        </figure>
        <p>雖然我造訪學田山的這天不落於芒花覆蓋整個山頭的時節，但一片綠油油其實也是相當引人入勝的了，其實當天我知道天氣良好，便刻意等到午後三點才出發去爬山，主要就為了等待記錄下學田山黃昏時刻的模樣，畢竟爬了這麼多山，很少有哪座山真正可以讓我放心待到天黑再下山的，學田山不僅是屬於近郊的小山，散步的民眾很多，步道鋪設也相當完善，幾乎沒有安全的疑慮。</p>
        <p>當然最重要的因素，還是因為離我家很近，從住家騎車來知高圳登山步道起點也不過半小時左右的時間。假如從成功西路的捷徑進入的話那便又更快了，只不過要前往這條捷徑的入口，必須得穿過大肚區與烏日區的兩處公墓，成功西路這條山路素來不乏靈異故事流傳，平時借道的人十分稀少，更甭提晚上由此路前往學田山欣賞夜景了。猶記得大學時代曾和室友半夜前往望安寮欣賞夜景，那個年代ＧＯＯＧＬＥ地圖導航還不普及，我們回程時走錯原路，騎進了成功西路風水寶地區，雖然一路平安無事，但是回想起當時我們神經緊蹦之扭曲，至今仍記憶猶深。</p>
        <figure>
            <img src="/images/mtlogs/011/10.jpg">
        </figure>
        <p>２０２３年的冬天，一樣是閒閒無事的午後，再次背上輕便的行囊前往學田山，稍微治一治冬季天冷少爬山而犯的腳癢症頭，距離上次前來已經有三個年頭，發現整體步道的氛圍和過去儼然判若兩人．．．．．．唔，更正應該是兩道才對，原本的好漢坡土徑幾乎都架起木階梯，步道周圍的雜草也除得相當乾淨，整體變得更寬大好走了。隨著山腳下建案的開發，或許在不久遠的未來，學田山頗有潛力成為大肚臺地版本的大坑步道群，一旦夜燈架起，便可一躍成為大台中地區二十四小時皆適合健走、賞景的好去處。</p>
    </div>
</div> 
<!-- end -->
    </BaseTextContent>
</template>