<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '序、楔子' },
    { id: 1, title: '壹、橫看成嶺側成峰' },
    { id: 2, title: '貳、大意「吃荊粥」' },
    { id: 3, title: '參、中台灣的太師椅' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="12" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <h2 v-text="catalog[0].title"></h2>
        <p>宋代著名文學家蘇軾一生漂泊，在某次貶途離開黃州，前往汝州路上經過廬山時，曾於西林寺的牆壁上寫了一首詩：「橫看成嶺側成峰，遠近高低各不同；不識廬山真面目，只緣身在此山中。」──這首詩便是著名的《題西林壁》。其中，蘇軾利用前兩句詩詞描述盧山的外觀，意指從不同的角度看，山的形狀會有所不同。強調的是視角變化，從正面看像是一條山脊，從側面看則是山峰，遠近的距離也會影響視覺的感受，這些自然現象說明了不同方向投視的視角，映入眼簾的也會呈現出不同的景象。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <h2 v-text="catalog[1].title"></h2>
        <p>居住在大台中地區的我們，儘管此次的目標「大橫屏山」就位於台中太平與南投國姓交界，但若要攀登這一座山並依循大眾路線，我們不得不驅車繞過太平，從南投國姓進入山區。一路曲折蜿蜒，遙望山容橫亙的大橫屏山，還真頗有「橫看成嶺側成峰」之感。大橫屏山作為其山系最高峰，承襲雪山山脈的一條支脈，這條脈絡猶如一道屏障，劃開了台中盆地與南投國姓山區兩地，乃這一帶許多河川的發源地。</p>
        <figure>
            <img src="/images/mtlogs/012/01.jpg">
        </figure>
        <p>只是要前往大橫屏山大眾路線登山口的這段路實在不容易，曲折蜿蜒暫且不說，畢竟十次登山大概八、九次都得先經過山路九彎十八拐的洗禮，方能抵達插有明確標示的登山口。然而這條產業道路不僅遙遠，路幅也十分狹窄，幾乎全程都只能容許一台車輛通行且難以會車，很不像是標榜「平易近人」的小百岳交通應有的四通八達。事實上也確實因為其交通的不便性，大橫屏山在山友蒐集小百岳心得裡，多半將其歸類在較冷門的登山路線之一。</p>
        <figure>
            <img src="/images/mtlogs/012/02.jpg">
        </figure>
        <p>大橫屏山在Ｇｏｏｇｌｅ地圖上沒有明確的登山口標記，我們根據查詢的軌跡紀錄以及前人的經驗建議，導航產業道路上一處名為「碧山農場」的地點，過某個電稈後找一處路邊寬廣的腹地將車輛安置，再改由徒步前往登山口。而當天從我們脫離國姓鬧區進入山路一直到停好車這段過程，完全沒有遇見任何一輛來車，或是和我們有著一樣相同目標的登山客（一直到回程下山才遇到一位獨攀山友），大橫屏山冷門程度可見一斑。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <h2 v-text="catalog[2].title"></h2>
        <p>大橫屏山不像其他熱門山岳立有明顯的登山口牌碑，或許多年過去至撰文的如今已經有了，但在我們登山的當年，仍然只能藉由其他登山隊綁的布條，辨識正確的起登位置。然而，大橫屏山的登山口並不在產業道路的終點，漫步在這條平坦的康莊大道上，若不多留心一旁的布條，很容易就會錯過登山口──我們就是只顧著聊天，一直走到產業道路盡頭都還在張望山徑的起點位置。</p>
        <figure>
            <img src="/images/mtlogs/012/03.jpg">
        </figure>
        <p>看到這輛廢棄的紅色轎車，就代表已經走過頭了──然而這是歷經慘痛教訓後才領悟的心得，我們在當下非但沒有即時拿出地圖或軌跡檔比對位置，反倒輕浮地錯當產道盡頭一處農民安置水塔所開闢的便道為登山口，忽視了時刻比對位置此一登山最基本的道理，兩人一前一後蹬上駁坎，鑽入已稍微被芒草吞噬的小徑之中。</p>
        <p>起初沒看到布條時心裡還有些許的不安，但當我們看到大水塔和周圍砌起的駁坎這些人為遺跡，那份忐忑便馬上拋諸腦後，甚至還沾沾自喜著確實走在正確的路徑上。然而，隨著腳步愈發深入，不僅雜草越來越密集，路徑也漸漸沒入在遍地枯葉地毯之中，此時此刻，腦後的不安竟也在不知不覺間，潛移默化地反噬我們的思緒。</p>
        <p>這時我們才想起行前有下載其他山友分享的軌跡檔，趕緊打開ＡＰＰ進行定位，發現目前所在位置與登山行跡非常靠近，於是我們便硬著頭皮嘗試硬切上軌跡，然而前方盡是一棵棵帶刺的樹木，好不容易挨過一棵，馬上又有兩棵迎面而來，闖過兩棵，接著又出現四棵擋關．．．．．．一關接著一關，數不清的刺藤一字排開，像是對我等蠻橫行為宣戰，令這方始終無法順利接回正確的軌跡路徑上。</p>
        <figure>
            <img src="/images/mtlogs/012/04.jpg">
        </figure>
        <p>這種帶刺植物名叫黃藤，雖然是台灣中低海拔相當常見的植物，但說真的在熱門山岳的登山步道上倒也沒這麼常遇到。黃藤最大的特徵在於枝條佈滿荊刺，其尖銳程度，稍稍劃過皮膚便會留下一道血痕。它不單是各種傳統藤製家具或工具的主要材料，有些原住民則會取其莖心或果實作為食用，甚至亦可以作為藥材，足見其經濟價值之高。</p>
        <p>雖說用途廣泛，但它身上的荊棘始終是登山者頭痛的夢魘，無法跨出黃藤劍圍的我們，陷入了進退維谷的境地。最終我們被迫放棄攻城，往反方向撤退鏟回產業道路。當好不容易撤退到產業道路上時，身上早已傷痕纍纍，不用照鏡子都知道自己狼狽不堪的慘樣。而也是這時重新對照軌跡，才驚覺登山口並不在產業道路的終點，乃位於更之前的路邊某處岔口，岔口旁邊的樹叢繫著五顏六色的路條，儘管不是非常顯眼，卻也沒隱蔽到難以注意的程度，顯然一路走來我們兩對眼睛真的是白長在腦子上，甚至腦子可能也留在車內沒帶下車，不禁啞然失笑。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <h2 v-text="catalog[3].title"></h2>
        <p>費盡千辛萬苦終於踏上正途，但歷經一番迷途與血路突圍，我們不由得佇立於登山口前，陷入是否打道回府的長考。思來想去，既然都來了就還是把它走完，畢竟這一趟山路進出不容易，況且眼前山徑看上去也友善許多，最壞時刻儼然已成過往。</p>
        <figure>
            <img src="/images/mtlogs/012/05.jpg">
        </figure>
    </div>

</div> 
<!-- end -->
    </BaseTextContent>
</template>