<script setup lang="ts">
    import { reactive } from "vue";
    import type { CatalogItem } from '@/stores/catalog';

    // 引用組件
    import BaseTextContent from '@/components/Common/BaseTextContent.vue';
    import Title from "@/components/Common/BaseTextTitle.vue";

    // 目錄
    const catalog = reactive<CatalogItem[]>([
        { id: 0, title: '0K：楔子' },
        { id: 1, title: '1K：太興岩' },
        { id: 2, title: '2K：青年嶺' },
        { id: 3, title: '3K：燕子崖' },
        { id: 4, title: '4K：好漢坡' },
        { id: 5, title: '5K：後記' },
    ]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="13" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2022-05-07</strong></p>
        <p><span>行走總長：</span><strong>約 9 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 3.5 HR</strong></p>
        <p><span>路程總覽：</span><strong>圓潭生態園區 → 青年嶺登山步道 → 燕子崖 → 蝙蝠洞 → 瑞里國小</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>２０２２年，台灣學術界的一隅盪漾出一波小小的漣漪。一位畢業於中正大學台灣文學與創意應用研究所的碩士生，同時曾任事過梅山文教基金會執行長的李旭彥先生，於碩士畢業論文發表《瑞里來了個單車客》著作，是該研究所首位以寫小說畢業的學生。該小說敘述一位來到梅山的外科醫生，於梅山市區、太平、太興、太和與瑞里等地生活日常的足跡，雖然故事舞台以梅山為主，論文篇題卻以瑞里落筆，瑞里究竟是什麼樣的地方？夾在梅山與阿里山兩大著名的景區之間，歷史底蘊深厚的瑞里，除了山水好風光之外，亦默默流傳著諸多往事。儘管我不是單車客，而是以一位尋常無名的登山訪客，循著前人的足跡，悄悄走進這片謐靜的山野。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>雲嘉地區的熱門登山、健走路線已完成了泰半，雖不敢自傲地說有多熟門熟路，對梅山到阿里山這帶也有一定程度的掌握──在今天之前，我原本是這樣想的，更準確地說，是更早之前更新登山清單的時候。某日在開放街圖ＯＰＥＮＳＴＲＥＥＴＭＡＰ隨意拖拉，蒐集健行路線的過程中，發現梅山與阿里山兩個熱門的旅遊景點之間，夾著一處名為「瑞里」的地方，此山區範圍不大，名氣相對前面兩者也不高，地圖上卻蘊含著多條象徵行腳路跡的紅色虛線，而這一條條紅色虛線，都是一條條歷史底蘊深厚的健行步道。</p>
        <p>這些步道的前身多半由古道發展而來，山區民生物資素來匱乏，在昔時交通不便的年代，瑞里當地居民開闢數條古道，銜接阿里山森鐵設立的車站，以方便交換物資。後來公路開通，車行取代徒步，古道才逐漸失去鼎沸人聲，回歸靜謐的山林之中。直到近代觀光產業興起，這些古道又再次熱鬧起來，搖身一變成為老少咸宜的踏青健行好去處。</p>
        <p>看過幾篇瑞里古道的遊記後，我便盼望著有一天可以走進這片山林，而這一天也沒有擱置的太久，就落在發想的半個月後。此行安排的路線是有著「台版敦煌石窟」美名的「青年嶺步道」，先撇開台灣人很喜歡在自家景點掛上台版國際名勝的習性不提，閱覽過相關相片記錄，青年嶺也確實有其獨到之處，非常值得一訪，因此成為此行初次造訪瑞里中眾多健行路線的首選。</p>
        <figure>
            <img src="/images/mtlogs/013/01.jpg">
        </figure>
        <p>下國道三號竹崎交流道後，接上嘉１６６縣道往東方向前進，當道路由直線逐漸轉為曲折蜿蜒，便是入山的開始。踏進山區範圍距離瑞里其實還有很長一段距離，我沿著山路一路蜿蜿蜒蜒，當穿過出水坑準備抵達交力坪之前，在路邊發現一條階梯沿著茶田延伸、展望極為遼闊的棧道，於是便中斷行駛，先給相機吃點開胃菜。</p>
        <figure>
            <img src="/images/mtlogs/013/02.jpg">
        </figure>
        <p>這條步道位於太興村，名字便取名為「太興岩步道」，步道全長約６５０公尺，主要由木製階梯構築，穿梭在茶原和原始樹林之間，步道終點處連接當地居民信仰中心的「泰興巖」，其發音與太興岩一模一樣。據說泰興巖早在清朝乾隆年間便已創立，主祀觀音菩薩與哪吒三太子。早期僅為一座簡樸的竹屋，後來信徒日益廣增，寺廟亦經歷多次翻修，始有今日金碧輝煌的樣貌，同時也已被列為嘉義縣的三級古蹟。</p>
        <p>雖說太興岩步道不長，但由於今天的主菜在更深處的瑞里，故淺嘗而止後便折回取車繼續趕路。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>如果從１６６縣道竹崎方向過來，青年嶺步道的出入口主要有兩處：一是圓潭遊客中心旁邊的聯絡步道，這條便道銜接圓潭、雲潭瀑布等周邊景點，附近也設有好幾座收費停車場，基本不用擔心停車的問題，只是距離青年嶺官訂的步道入口稍遠一些；二是繼續往上開，來到縣道７２．２Ｋ處，看見一間雜貨店左轉進入岔路，這條岔路直達青年嶺步道入口，道路的盡頭同樣也有一座小型停車場，且附帶公共廁所，足見規劃用心。</p>
        <figure>
            <img src="/images/mtlogs/013/03.jpg">
        </figure>
        <p>青年嶺步道單程約２．５公里，途中會經過幾個會令人感嘆大自然鬼斧神工的自然景點，如燕子崖、蝙蝠洞等。步道之所以稱作青年嶺，乃是因為這條步道在過去是當地居民搬運物資的必經之路，但汗路陡峭，必須擁有如年輕青年的體力才堪負荷，故而命名為青年嶺。</p>
        <figure>
            <img src="/images/mtlogs/013/04.jpg">
        </figure>
        <p>至於步道現今全程皆由人工木板、石板鋪裝設成，雖說導覽介紹言青年嶺陡峭，可實際走起來地勢起伏落差並不大。其實，主要令人氣喘吁吁的路段集中在後段，即過蝙蝠洞之後，地勢會急速扶搖直上，短短不到半公里的直線距離，卻高達三百多公尺的高低落差，因此該路段也被稱為「好漢坡」。</p>
        <figure>
            <img src="/images/mtlogs/013/05.jpg">
        </figure>
        <p>入口出發約二十分鐘，步道大多在林蔭間徐行，偶爾會貼著岩壁走過，途中經過這塊半懸在空中的巨石，巨石頂端還紮著幾棵大樹，雖然不是被標記的景點，看上去仍然很是壯觀。</p>
        <p>緊接著沒多久，一座吊橋出現在步道延伸的前方。從吊橋旁邊的解說牌得知，這座橋題名「情人橋」，相較青年嶺一名取之有自，情人橋名稱由來則略顯俗庸，根據導覽介紹所述，因為吊橋的橋寬正好適合情侶雙肩並步而走，享受甜蜜滋味的同時，也能在橋上捕捉溪谷兩側峭壁雄峰的峽谷風光，愜意萬分。</p>
        <figure>
            <img src="/images/mtlogs/013/06.jpg">
        </figure>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>其實在渡過情人橋之前，就能從步道上望見峽谷彼端、有一條垂直的岩壁，岩壁經過長年風蝕作用劃出一痕又一痕筆直切線，宛如一塊銀灰色的千層蛋糕。而岩壁下方處有條裂縫，一條路徑就從裂隙之間闢徑延展開來。</p>
        <figure>
            <img src="/images/mtlogs/013/07.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/013/08.jpg">
        </figure>
        <p>走近一探，岩壁上的切線坑坑巴巴，密布著細孔，非常壯觀。這條岩壁名字喚作燕子崖，「眼觀飛瀑奔騰，耳聽燕子呢喃」──相傳過去這一帶可以見到數以百計的燕子在溪谷與岩壁間往返，此乃因這片山谷地質屬於砂岩與頁岩層層相疊的環境，受到河水溶蝕，表面變得較為脆弱，每逢大雨襲來，雨勢挾帶礫石不斷衝擊岩層表面，敲出一處又一處的坑洞，這些密密麻麻的岩石坑洞遂成為適合鳥類棲息築巢的地方。</p>
        <figure>
            <img src="/images/mtlogs/013/09.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/013/10.jpg">
        </figure>
        <p>循著步道穿過燕子崖，視野四面中有三面都是灰色的岩質視貌，另一面則可以回盼十幾分鐘前走過的情人橋。雖然和電視節目介紹的敦煌石窟印象差距甚遠，但似乎也不是不能理解為什麼會有一派人將這條岩壁冠上台版敦煌石窟的美名，至少於我而言，這是過去走過這麼多步道以來確實幾乎不曾有過的體驗。</p>
        <p>而燕子崖除了岩壁上的鬼斧神工令人嘖嘖稱奇之外，當下雨過後雨水匯聚成流，從崖上方傾瀉而下，宛如瀑布垂瀉遮掛於山洞的水濂洞，其景致之美與晴時所見似乎更增添一濂幽美。</p>
        <figure>
            <img src="/images/mtlogs/013/11.jpg">
        </figure>
        <p>拐個彎，來到山陰處，岩壁上的坑洞又比前段更加明顯深刻了，對於患有密集恐懼症的人，行至此處恐怕會感到頭皮發麻、雞皮疙瘩掉滿地吧？這個彎同樣是大自然的傑作，軟弱的地質受到河流侵蝕形成彎月灣，和燕子崖一樣長年經大雨洗刷，表面產生許多大小不一的凹洞。</p>
        <p>由於這一面是陽光照射不到的區域，因此成為蝙蝠絕佳的棲息場所，「蝙蝠洞」之名便於焉而生，相同的地理環境，卻因為不同光照環境，產生了燕子與蝙蝠各自兩個物種族群聚集的地方，這也是大自然有趣、奧妙之所在。</p>
        <figure>
            <img src="/images/mtlogs/013/12.jpg">
        </figure>
        <p>這處由燕子崖岩層上部延伸的蝙蝠洞，隨著步道經過，人流來來往往，蝙蝠數量因人潮干擾已減少許多，現在基本上已經很難再見到蝙蝠偎身與岩壁坑洞內的模樣了，正所謂人去樓空。不過這高達數千個小石洞的規模，放眼至今仍然是全台灣最龐大的蝙蝠洞之一，與燕子崖相同，皆被列為「瑞里八景」名冊。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <div class="mtlogs-title" v-text="catalog[4].title"></div>
        <p>行至蝙蝠洞，可說是已經把青年嶺步道的精華悉數採點完畢，然而蝙蝠洞卻還不是步道的盡頭。繼續往前走，不消十分鐘，緩緩拾階向上的步道瞬間抬昇為陡峭的階梯──這一段是青年嶺步道銜接瑞里村的最後一里路，也是旅人最能感受到過去藉由青年嶺往來負重補給辛勞的一段，後人稱此一節為「好漢坡」。</p>
        <figure>
            <img src="/images/mtlogs/013/13.jpg">
        </figure>
        <p>和前面步道精心打理維護相比，好漢坡則可從其斑駁的階梯、圍欄明顯感受到其人煙罕至。其實這段好漢坡在短短一公里內要爬升足足三百公尺，對普通健行的民眾來說無疑是一大考驗，況且若要順遊瑞里村，折返回頭取車循馬路開進，或許都比走好漢坡來得快，還不用搞得自己一身狼狽，也難怪最後這一段爬坡路沒什麼人想走。</p>
        <p>會想把整條步道走完的，或許也只有我們這類登山人，特意說登山人倒也不是刻意要突顯登山人的優越感，只是想說說多數登山人莫名的堅持：當來訪一座山或一條古道，如果不把整條路線走完一遍、沒摸到那座山的三角點或基石，這趟行程似乎就不完整了一般，內心將多少留下一小角缺憾。所以即便知道後面的路再苦、再寂寥，依舊會咬著牙辛苦挺進，試圖讓足跡覆蓋整條路跡。</p>
        <figure>
            <img src="/images/mtlogs/013/14.jpg">
        </figure>
        <p>這段長度約一公里、直線距離不到四百公尺，高低落差卻長達三百五十公尺，坡度足足有六十度的好漢坡，是早期的居民在阿里山公路開通以前，搬運物資的主要便道之一，肩上時常扛著數十斤重的日常用品，能完成此重任者，往往只有體力充沛的年輕人才能堪當大任，此乃便是「青年嶺」的由來。</p>
        <p>好漢坡的終點是步道的另一端入口，設有一座可供休憩的涼亭，不過更吸睛的仍屬階梯一旁，一座外觀完整、不曉得是否還有在使用的老舊電桿，木頭質地的電桿看上去明顯散發著年代感。</p>
        <p>不僅是青年嶺可以窺探出過去居民物資往來的辛勞，其實從後來阿里山森鐵建成的交力坪車站一名也有跡可循，所謂「交力坪」，所指便是人們交互接手提運物品的地方，這個車站在過去即是村民聚集此地買賣、交換物資的主要場所。</p>
        <figure>
            <img src="/images/mtlogs/013/15.jpg">
        </figure>
        <p>青年嶺步道屬於雙向進出的步道，一端由雲潭瀑布附近，掛有「瑞里農場」舊招牌拐進去的產業道路，也就是我出發的方向；另一端則是瑞里國小，居民較為聚集的瑞里部落所在地。走出青年嶺步道後我不急著折返回程，而是在村落裡隨意走走晃晃，我們都知道阿里山盛產茶葉，就連隔壁的瑞里也深受薰陶。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[5].id">
        <div class="mtlogs-title" v-text="catalog[5].title"></div>
        <p>事實上，在茶葉引進瑞里之前，瑞里的農作物是以竹筍、愛玉、梅子、檳榔等為主要，三十多年前開始引植茶葉，意外發現瑞里的茶葉品質出奇地好，爾後居民紛紛跟進，「瑞里茶」的名號打響一方，帶有清花香、泛著金黃色的清澈茶湯，像是在向世人傾訴，瑞里不僅山野瀑布、群山峻嶺疊嶂令人心生嚮往，香氣高雅的瑞里茶同樣使人流連忘返。</p>
        <p>好山、好茶、好地方，雖然我不懂品茶，但在這悠悠慢慢的寧靜茶村中，似似也隱隱品茗出高山茶特有的芬芳。</p>
        <figure>
            <img src="/images/mtlogs/013/16.jpg">
        </figure>
        <p>回程雖然是下坡，但階梯陡峭，所以也不比上坡來得輕鬆。但是青年嶺這獨特的石灰岩地層景觀，從不同方向再走一遍，彷彿入喉回甘的茶香，感覺又別有一番韻味。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>