<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '序、楔子' },
    { id: 1, title: '壹、古寺靈洞揚梵唱' },
    { id: 2, title: '貳、道上斜陽林間照' },
    { id: 3, title: '參、仙境仙水伴雲飄' },
    { id: 4, title: '肆、山中山人樂逍遙' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="14" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <h2 v-text="catalog[0].title"></h2>
        <p>「仙境仙水好雲飄，山中山人樂逍遙，古寺靈洞揚梵唱，道上斜陽林間照。」這是２００９年苗栗縣國際文化觀光局局長甘必通先生，贈送給苗栗仙山靈洞宮的一首藏頭詩。後來廟方請工匠將此詩雕刻在石碑上，供各路香客、遊人造訪廟宇時順道品讀，每一行詩句皆透露著仙山這塊寶地各種氣象萬千，山下層雲深護，山上雲海迷漫撩繞山間，如處身漂渺仙境，令人心生嚮往。而將詩句各行第一個字串聯起來，恰好組成「仙山古道」，凡人若想親身步入仙境，就必須一步一腳印，循古道穩步踏實而上。仙山不止只是景象宛如仙境，其背後流傳的故事更是滿溢著傳奇色彩．．．．．．</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <h2 v-text="catalog[1].title"></h2>
        <p>馳騁台三線上途經苗栗獅潭鄉，一座巍峨巨大的牌樓就矗立在浪漫台三線與１２４縣道的岔路口，牌樓橫匾上提著四個大字：「仙山聖門」，兩側又分別提寫上靈洞宮與協靈宮。說起這座位於獅潭與南庄交界處的靈洞宮，其實對我們來說並不陌生──早在一年半載之前挑戰苗栗縣山「加里山」之時，我們就曾經短暫在這裡停留休息一陣子過。然而當時初入登山界，對於岳界名山的認識都還處於九牛一毛階段，並不曉得靈洞宮就座落於同為小百岳一員的「仙山」山腰處。</p>
        <p>倘若當時就知道仙山，還知道從靈洞宮起登到仙山山頂僅八百公尺的距離，那麼我就會抓緊暈車的友人在車上歇息的空檔，速速打卡這座小百岳。然而遺憾的是，那位才剛進入山道就暈車、十分不爭氣的友人竟是我自己。當時暈的厲害，只依稀記得自己短暫下車上個廁所後，就回到車上躺著休息好久，也沒心思好好參觀這座香火鼎盛的廟宇，直待到暈眩感逐漸消彌才又繼續驅車前往加里山。所以即使時光重來，我也無法如願一天內同時收穫兩座小百岳，不過這也無傷大雅，畢竟山一直都在。</p>
        <figure>
            <img src="/images/mtlogs/014/01.jpg">
        </figure>
        <p>在廟宇密度名列世界前茅的台灣地區來說，靈洞宮的歷史淵源並不算深遠。根據廟方敘述，靈洞宮的興建年份約落在民國三十年前後，那時還是由日本人治理台灣的年代。據說之所以會開建靈洞宮，乃是當時「紅毛館」該地有戶蕭姓人家，全家因長年深受疾病侵襲而痛苦不已。驀地，某日夜寢時得到神仙啟示，神明告訴他們在當地的山嶺上有一座仙泉可以治百病，一家人半信半疑下前往嘗試，不料想竟果真病除痊癒，同時伴隨著求泉過程中遭遇的種種仙跡顯現，蕭家人便對神蹟深信且感念不已。</p>
        <p>後來蕭家因一泉治病的事蹟一傳十、十傳百，仙水盛名傳頌全台，各地前來朝聖求水的善男信女源源不絕，相傳甚至驚動了日本當地官員，官員對於仙水治病、泥巴療傷等傳說十分不以為然，認為這些只是流傳於民間的迷信謠言，遂決定帶隊上山封堵仙泉。沒想到一行人在半途中便感到身體不適、腹痛如絞，只得退回山下治病，然而用盡各種藥方，日本官員們的病狀依然無法改善，萬般無奈下只好聽從當地居民的建議，飲用當初治癒蕭家人的那口仙泉。</p>
        <figure>
            <img src="/images/mtlogs/014/02.jpg">
        </figure>
        <p>至於結果如何應該也可想而知了，奇蹟般痊癒的日本官員們在那之後便打消閉堵仙泉的念頭，這件事更讓仙泉再增添一筆神蹟，這座湧泉既被稱為仙泉，那麼其所在的這座原名為「紅毛館山」的山岳，理所當然亦被改喚為「仙山」，並先後建成靈洞宮、協靈宮，原先仙水湧現的位置則砌起仙水亭，提供各路信徒炷香祭拜，凡任何前來朝聖仙山的善男信女，求神問事同時，也無不渴望飲上一口滋味清甜的仙水。</p>
        <p>民國六、七十年代，休閒觀光產業逐漸興起，其中也包含登山活動，各地紛紛開始或推廣、或開闢登山健行步道，吸引民眾前往增添人氣。苗栗縣政府與靈洞宮廟方也在這個時期與外界合作，為仙山開拓登山步道，使得本就香客往來絡繹不絕的靈洞宮，又更增添豐沛陽氣。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <h2 v-text="catalog[2].title"></h2>
        <figure>
            <img src="/images/mtlogs/014/03.jpg">
        </figure>
        <p>從靈洞宮出發攀登仙山的登山步道主要可分為兩條，一條距離較短，但地勢十分陡峭，需要手腳並用，因有多處攀岩地形，故具備相當挑戰程度；另一條相對安全和緩一些，但距離較長，但說長，其實兩條步道的長度也只相差百餘，分別落在四百九十公尺以及六百三十公尺長度，對經驗豐富的登山者來說都是信步即達的距離。</p>
        <figure>
            <img src="/images/mtlogs/014/04.jpg">
        </figure>
        <p>原本我們預計兩條步道都取，先從較陡的一方上，再從另一側比較和緩的階梯步道下山，至於為什麼會多提「原本」兩字，這裡姑且先賣個關子，待行文至後段會再作出解釋。總而言之，當我們穿過仙洞門，工整筆直的階梯少了，取而代之的是原始山徑以及各種突起的岩稜，地勢也開始轉為扶搖直上。</p>
        <figure>
            <img src="/images/mtlogs/014/05.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/014/06.jpg">
        </figure>
        <p>仙山山頂根據導覽介紹乃是一塊狹小突出的裸岩，意即是說若要登頂，以安全優先考量，必須仰賴繩索輔助。我們抬頭愣愣望著登頂前最後必須攀附、幾近垂直的高聳岩角，心想這方雖然也爬過不少這類型的山道，譬如南湖群峰線的五岩峰、中部知名岩場鳶嘴山等，要克服仙山這段岩壁並不艱難，不過也談不上易事，對「平易近人」這四個字更是扯不上絲毫邊際。從靈洞宮起登一路走來除了遇到做足準備、裝備齊全的山友，卻也遇到不少來朝聖拜拜、順腳走走步道，懷抱悠哉散步心態的普通民眾，想想他們足下的平底布鞋，不免捏把冷汗。</p>
        <p>事實上也如同我們所擔憂的那般，在過去幾年仙山確實發生過數起山難救援事件，其中也包含不幸罹難而身亡的民眾，他們清一色都是在攀爬這條岩石破碎的地形途中，因失足而墜谷殞命。儘管有一說罹難者是因為抓到老舊繩索進而導致憾事發生，無論如何，仙山雖然是小而美的登山步道，然而其路線部分地形的危險性卻遠高於尋常親民的小百岳。</p>
        <p>秉持謹慎穩固的心態，我們最終順利地登上仙山山頂，當視線從岩稜樹蔭間探出，便立即被一望無垠的山景深深震攝眼簾。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <h2 v-text="catalog[3].title"></h2>
        <p>仙山，海拔高度９６７公尺，為編號第３３號台灣小百岳，原本峰頂立有一顆三等三角點，但疑似隨著九二一大地震振落的土石一同崩落到崖底。山頂腹地不大，僅能容納約十數人左右，但展望十分良好，能見度佳時不僅能將加里山山脈盡收眼底，甚至還能眺望更深遠的聖稜線。</p>
        <figure>
            <img src="/images/mtlogs/014/07.jpg">
        </figure>
        <p>在易名為仙山之前，這座山原本名字為「紅毛館山」，紅毛館是此地古老地名，根據國家文化記憶庫記載，其名稱出處說法主要有二：一是十七世紀荷蘭統治台灣期間，荷蘭人曾於此地設館，由於當時人們大多稱包含荷蘭人在內的西方洋人都為紅毛人，故該館也就被稱為紅毛館。只不過此一說法隨著後代考察，因缺乏明確論據逐漸不被採信，因為苗栗縣南庄鄉一直到清領時代初期，都沒有太多實質統治開墾的記錄，活動於當地的大多是以賽夏族為主的原住民族群，基本上不太有可能會有荷蘭人生活於該地。</p>
        <p>另一個說法也與洋人有關，時間來到十九世紀，西元１８５８年台灣開港之後，英國人為了取得當時重要的工業原料──樟腦，派人進入山區尋找原物料樟木的穩定產出貨源，而台灣中部以北的山區是樟木主要分布的區域，因此英國人進入南庄發現這片山區有豐富的樟木群，便於此地設置收購樟腦相關庶務的機構單位，這才有了紅毛館的出現。</p>
        <p>事實上，放眼南庄乃至整個苗栗，其樟腦輸出至日治時期可謂達到巔峰，不僅佔據台灣境內９５％左右的總產量，甚至當時全世界樟腦總產量分布統計裡，就有高達８５％左右的產量來自台灣，足見樟腦收入可謂是當時台灣經濟的一大財源，而南庄經濟活絡的程度亦可見一斑。然而，伴隨龐大利益接踵而來的是人性紛爭，日本人、客家人、原住民三方為了利益分配時常發生衝突，著名的「南庄事件」便是圍繞樟腦歸屬問題而爆發的流血事件。</p>
        <figure>
            <img src="/images/mtlogs/014/08.jpg">
        </figure>
        <p>從仙山山頂稜線延伸的方向望去，這條上下起伏、連綿至深處的山稜是登山界著名的縱走路線──神仙縱走，那是一條橫跨獅潭、南庄、三灣三個鄉鎮的登山路線，首尾分別是仙山以及神桌山，各取首字而得「神仙」兩字。雖然海拔不高，但途中需經過像是瘦稜、危崖、峭壁，及盤根錯節的密林等各種錯縱複雜的地形，除卻需要豐富登山經驗和知識，也必須具備豐沛的體能，並不適合一般大眾健行。</p>
        <p>我們原本預計拍完登頂照後便循原路折返，下岩壁後走另一條步道完成小環繞，不過在排隊等候拍照的空檔，與旁邊休息的夫妻檔聊天得知，往神桌山方向再前進一些有一條路線可以直接下切接回靈洞宮前方的１２４縣道，步行距離稍長，但是可以避開剛剛登頂前的那一段岩壁，儘管我們事先下載的軌跡並沒有走過那條路徑，但聽聞路況還不錯且又能免去峭壁與他人會車的麻煩，我與友人不假思索接受他們提議，決定改道下山。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <h2 v-text="catalog[4].title"></h2>
        <p>順著山徑我們很快來到往神桌山方向及山友推薦路線的交會處，因為此行沒有打算挑戰神仙縱走，故選擇下切，剛走沒幾步路，便看到某棵樹上釘著一塊斑駁的木牌，上頭寫著「到三角點後從此路回來以免迷路」之字樣。事後返家尋查才得知這條原始山徑名叫「八仙古道」，指的是從八卦力通往仙山的路徑。八卦力名稱的由來是源自一場美麗的誤會，相傳早年原住民頭目居住在一處山高林宓、老鷹群棲於山頂的大森林之中，族民稱頭目居住的地方為「得八那寡力」，意指山頂老鷹群棲處，日子時間一長，發音轉訛變成「八卦力」這樣聽起來和靈洞宮信仰似乎有幾分關聯的名詞。</p>
        <figure>
            <img src="/images/mtlogs/014/09.jpg">
        </figure>
        <p>那對夫妻推薦我們走回靈洞宮的這條山徑便是早期登上仙山的路線之一，在更早期則是開闢用來作為八卦力部落居民採礦往來的道路，整條山徑雖然也有些陡峭，但路況大體而言都相當安全，不知為何近年來前往登頂仙山的遊客，清一色幾乎都選擇從靈洞宮上山？</p>
        <figure>
            <img src="/images/mtlogs/014/10.jpg">
        </figure>
        <p>下山沿途順道撿拾了「仙山南峰」，但是徒有一塊名牌，周遭不見任何基石。</p>
        <figure>
            <img src="/images/mtlogs/014/11.jpg">
        </figure>
        <p>約莫半小時，我們順利接回車來車往的瀝青道路，一邊端出手機ＧＯＯＧＬＥ　ＭＡＰ確認位置，一邊朝靈洞宮的方向悠悠踢著馬路，恰好在地圖上瞥見這片山區某一隅顯示著「蓬萊」兩字，據說這是國民政府於光復後接收台灣，自賽夏族稱外國人「ＨＯＬＡＩ」之發聲取諧音而來。單念仙山無事，單念蓬萊也無異狀，但如果把這兩個名詞合在一塊──身為八零年代出生的我與友人，腦海裡立即浮現了「蓬萊仙山」這個名詞。究竟那個曾經紅極一時，讓無數男人深夜為之痴迷的蓬萊仙山電視台，與苗栗的蓬萊、仙山是否有任何關聯呢？</p>
        <p>事實上，在道教歷史記載中，蓬萊與崑崙並列為其宗教神話中的兩大仙境，所以蓬萊仙山一詞早在千年前就已經出現，因此國民政府當初命名時不知是否也參考了相關典故？畢竟當時南庄一帶經濟發展蓬勃，從樟腦再到後來的煤礦，清末至光復初期的這段時間可謂是南庄歷史最繁華的時代，或許對當時其他地區的居民來說，南庄就像是人間仙境一般快樂逍遙吧。</p>
        <p>我們來爬仙山這天，其實對靈洞宮仙泉的故事一無所知，就只是個單純的登山仔，當循著馬路走回靈洞宮梳洗時，發現許多民眾提著大大小小的空水桶前來裝水。好奇一問才得知這裡的泉水名聞遐邇，不止靈驗治百病，味道嘗起來也十分甘甜，友人聽聞後也取出水瓶跟著湊過去盛滿一壺，我問他好喝嗎？只見他啜飲幾口後抿了抿嘴唇，淡淡回應了一句：「好水」。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>