<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：農業部茶業改良場' },
    { id: 2, title: '2K：日月潭氣象站' },
    { id: 3, title: '3K：後記' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="15" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2020-12-13</strong></p>
        <p><span>行走總長：</span><strong>約 3 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 1 HR</strong></p>
        <p><span>路程總覽：</span><strong>茶業改良場 → 貓囒山步道 → 日月潭氣象站 → 貓囒山</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>「明潭四秀」，指的是環繞日月潭的四座中級山，也有人用比較親切的「日月潭四兄妹」來稱呼祂們，這四座山以「水社大山」為首，然後依序是「大尖山」、「貓囒山」與「後尖山」，每一座山的海拔高度皆超過一千公尺，山勢巍峨高聳，宛如衛士般守護著日月潭。</p>
        <p>在還沒踏足進入登山界，過去對台灣觀光聖地「日月潭」的印象，是一座放眼望去無垠無際，水天一色的廣闊湖泊，週邊亦不乏像是伊達邵、文武廟、慈恩塔等等充滿歷史古香的人文建物，和普羅大眾直覺印象無異。不過由於日月潭素來就是國內外著名的觀光景點，每逢假日遊客絡繹不絕，交通總是擠得水洩不通，因此鮮少──細數已長達八年多未曾再拜訪日月潭，對日月潭的印象儼然塵封在往昔時光。</p>
        <p>直到藉由登山這個契機，因緣際會認識明潭四秀，這才又敲破那凍結的時空記憶，再次踏上前往日月潭的旅途，以不同形式和角度重新認識這座位居台灣本島內陸、美麗的高山湖泊。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>一般民眾可能沒聽過明潭四秀，但對登山客而言則多半都知道其響噹噹的名號，箇中緣由乃水社大山不僅是魚池鄉的最高峰，亦為台灣百名山之一，更是初版小百岳的一員（只是後來因為部分步道攀爬難度太高，所以才又被除名）。而貓囒山與後尖山雖然氣勢不若老大那般雄壯威武，但步道設施完善、平易近人，也分別納入台灣小百岳名冊當中，同樣具有相當知名度。</p>
        <p>把登山當作固定從事的活動開始到現在已邁入第四年，從原先只是單純為了消瘦運動的心態，漸漸轉變以蒐集各大小山岳為樂，知道台灣山岳有著各式各樣的分類及並稱，完成祂們就像達成線上遊戲裡的任務，格外有成就感。從百岳到五嶽三尖一奇、再到太魯閣七雄及谷關七雄，抑或是各縣市數字名山．．．．．．等等、等等，信手將琳瑯滿目的分類攤開，小百岳自然也在念想之中。</p>
        <figure>
            <img src="/images/mtlogs/015/01.jpg">
        </figure>
        <p>總而言之，約上同樣喜歡登山的朋友，我們訂立半年內把明潭四秀爬完的目標。其實在稍早的酷暑時節，我們就已經先狼狽地完成老大「水社大山」了，這次則盤算著一天內造訪四秀末端兩個弟妹，首先早上我們先去登門拜訪老三「貓囒山」。根據網路文章介紹，前往貓囒山的登山路線分為東、西兩條路線：東側入口由竹石園旁邊進入，穿過露營區可以直接銜接茶改場到達登山步道口，然而，翻找許多網友分享的ＧＰＸ軌跡，沒看見任何一個檔案的記錄是從這一條起登，於是我們也只能選擇另一條路線──從明潭國中一旁的巷弄進入，順著車路直達深處的農業部茶業改良場，即與東側路線通往的登山口相會，這條路線是為西側路線，也是現今前往貓囒山的大眾路線。</p>
        <figure>
            <img src="/images/mtlogs/015/02.jpg">
        </figure>
        <p>貓囒山登山口旁邊是農業部茶及飲料作物改良場中部分場，名字念上去很饒舌，而細觀其成立歷史，可回溯至日治時期，原名為同樣有些饒舌的「臺灣總督府中央研究所魚池紅茶試驗支所」，從名稱不難看出和紅茶息息相關，該單位設立用途主要從事紅茶茶樹的栽培試驗、製造試驗、種苗育成配布與台灣中南部山地的阿薩姆紅茶園開發等項目，對今朝日月潭紅茶盛名遠播之貢獻良多。</p>
        <p>在改良場與登山口之間有一塊紀念碑，碑上題寫著「故技師新井耕吉郎紀念碑」之字樣，這座紀念碑是前台灣茶業公司總經理於１９４９年所建，以玆紀念１９４７年因病去世，被譽為「台灣紅茶守護者」的新井耕吉郎先生。</p>
        <figure>
            <img src="/images/mtlogs/015/03.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/015/04.jpg">
        </figure>
        <p>貓囒山步道並非傳統的土石山徑或階梯步道，而是小車可以通行的水泥路，比較像是沿用早期茶業改良場員工往來移動的便道，規劃為今天踏青遊客前往貓囒山的親民路線。所以當我們登上步道口階梯沒多久，便看見過去早期提供研究人員居住的日式宿舍群，同時也能眺望到茶田後方水社大山那巨大寬厚的身軀。</p>
        <figure>
            <img src="/images/mtlogs/015/05.jpg">
        </figure>
        <p>步道沿途設有多處觀景台，照片中是第二座，位於茶田當中。</p>
        <p>不僅是茶業改良場，翻閱台灣紅茶相關發展的歷史，會發現新井耕吉郎先生這個名字頻繁出現在各篇文獻當中。被譽為「台灣紅茶之父」的新井耕吉郎先生，是一位出身日本群馬縣的農學家，畢生都在鑽研農業相關技術及知識。在日治時期舉家來到台灣，並在日月潭這裡協助成立魚池紅茶試驗支所，開始栽培錫蘭紅茶。後來不僅種植成功，還帶動外銷成長，根據當時資料統計，在台灣外銷紅茶巔峰期中，高達９３％的產量就來自於新井耕吉郎先生主導開墾的魚池茶區，足見其功勳與重要性。</p>
        <p>即便二戰結束，日本無條件投降，台灣回歸民國政府治理，新井耕吉郎先生也毅然拒絕遣返，決意留在台灣繼續栽培台灣紅茶。只是好人不長命，翌年新井耕吉郎先生不幸感染瘧疾，不久便離開人世，享年僅四十二歲。在那之後，紅茶試驗支所員工為了感念新井耕吉郎先生為台灣紅茶鞠躬盡瘁的精神，在茶園為其建立了紀念碑，並尊稱他是「台灣紅茶之父」，也是貓囒山的守護神。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>我們九點二十分從登山步道口起登，到達貓囒山步道深處的日月潭氣象站為九點四十五分，花費不到半小時。</p>
        <p>因為沿途總是經過各種跟茶葉有關的設施和茶田，本來以為最深處會是一望無際的茶園風光，實際上則是由與茶業改良場截然不同的單位所管轄。這處可以盡覽日月潭山水風光的日月潭氣象站，同樣也是建設於日治時期，在當時稱為「臺灣總督府氣象臺貓囒山出張所」，以一座石砌風力塔提供當局觀測氣象，設施較為簡單。後來隨著中華民國政府接收，易名「臺灣省氣象局日月潭測候所」，觀測項目與相關設施隨著科技發展亦越來越繁多，直到今天也依然作為台灣四座山區氣象站之一持續運作著。</p>
        <p>順帶一提，另外三座山區氣象站則分別是玉山、阿里山，以及竹子湖，山區氣象站顧名思義主要就是以高海拔山區氣象研究為目的，由一位為台灣氣象業帶來巨大影響，同樣被尊稱為「台灣氣象之父」的白鳥勝義先生所提倡，於台灣平地、高山、海洋三大地形系統來建構台灣氣象觀測網路，而這之中所提及的「高山」所指便是第一所高山氣象站「阿里山高山觀象所」。</p>
        <figure>
            <img src="/images/mtlogs/015/06.jpg">
        </figure>
        <p>貓囒山三角點已遺失，相傳原本的三角點在九二一大地震，氣象站廳樓因毀損後重新整建時一併被挖除，取而代之的是更大顆，具有象徵意義的「日月潭貓囒山」勒石。</p>
        <figure>
            <img src="/images/mtlogs/015/07.jpg">
        </figure>
        <p>而氣象站前方的觀景平台可謂視野絕佳，從這裡可以清楚地遠眺日月潭湖景和周邊村落，以及後方以水社大山為首的雪山山脈、玉山山脈。</p>
        <figure>
            <img src="/images/mtlogs/015/08.jpg">
        </figure>
        <p>氣象站建築本體是不開放遊客參觀的，但循著步道動線仍可以環走氣象站園區一圈，尤其可以從氣象站觀測坪認識一些氣象研究常用的精密儀器。園區後方的視野同樣十分廣闊，可展望水里、國姓兩座鄉鎮的面貌，集集大山、車坪崙山、九份二山等在岳界小有名氣的山巒皆能盡收眼底。</p>
        <figure>
            <img src="/images/mtlogs/015/09.jpg">
        </figure>
        <p>雖然我們在周邊木製桌椅上真的遇見了不怕人的貓，但是貓囒山這個名字的由來和貓本身並沒有什麼關聯。貓囒這個詞源自於邵族發音「Ｍａｌａｎ」，是南投魚池鄉一個傳統地域的名稱，雖然確切涵義已查詢不得，不過這個發音到後來清末時期便沿用在該地街庄，是為「貓囒庄」。</p>
        <p>先前去走水里水沙漣古道古道時，曾在導覽介紹文章看過這樣一段民諺：「銃櫃豬、頭社米、水社魚、貓囒出夥妓、魚池番薯、大林茶米、木屐囒土礱齒」，其中便有提到貓囒一帶的「夥妓」特別有名。然而這一句「貓囒出夥妓」並非完全正向的讚嘆，反而挾帶著諸多挖苦、調侃意味，這是因為在當時，南投水里一帶的農牧往來的主要特產是「頭社米」、「水社魚」、「銃櫃豬」以及「魚池番薯」，只是在後來日治時期貓囒庄引進紅茶栽植，也就是前面提到的新井耕吉郎先生於貓囒山設立魚池紅茶試驗支所，並成功培育出錫蘭紅茶。時局為大力推廣紅茶，遂將番薯改成了「貓囒茶」。</p>
        <p>由於茶葉採收需要大量人力，除了男性之外，亦有許多女性投入農務故而化身採茶姑娘，只是部份茶農業者不安於室，與採茶姑娘發生曖昧關係，豢養情婦的風聲逐漸流傳開來，因而產生「貓囒出夥妓」此語，夥妓這個詞在閩南語中所指即情婦或姘頭之意，用現在的白話文來說就是小三。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>看完了貓，回到氣象站前方的觀景平台，儘管今日的天空有些陰鬱，但日月潭的湖光山色，依舊美的讓現場快門聲此起彼落，據說在明潭四秀之中，唯有貓囒山才有如此開闊的展望。</p>
        <figure>
            <img src="/images/mtlogs/015/10.jpg">
        </figure>
        <p>其實在登山的當下並不曉得踏足的土地過去究竟發生什麼樣的故事，儘管有些地方會有導覽牌子介紹但不多，很多知識都是事後撰寫遊記，翻閱各種文獻，藉由各種看似不相關的人事物，才慢慢拼湊出較完整的歷史輪廓，這個過程雖然繁瑣，甚至有時候還會發生「案外案」，越查資料越是離原本想記錄的東西越遠，但對我來說其實這也是寫文章的有趣之處，尤其寫在親身體驗過現地以後，竟能從冷冰冰的白紙黑字裡，感受到絲絲溫暖與真切。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>