<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：內灣村' },
    { id: 2, title: '2K：火炎山' },
    { id: 3, title: '3K：樟之細路' },
    { id: 4, title: '4K：後記' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="17" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2021-10-30</strong></p>
        <p><span>行走總長：</span><strong>約 5 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 2 HR</strong></p>
        <p><span>路程總覽：</span><strong>龍崀頂步道 → 火炎山 → 彌陀寺 → 三灣老街</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>峎，漢語辭典記載其發音同為三聲「恩」字音，而在客家話中則念作「跟」，此字有著山頂的含義，也有一說指的是低矮山丘的斜坡，雖然兩者字義皆與山有關，但是放眼中華文化圈，鮮少有以此字做為地理名稱，甚至現代字典參考的鼻祖之一──《玉篇》，也只是簡短地記述峎為山名爾爾，資訊極少。不過在台灣苗栗縣三灣鄉的內灣村，仍存在著這麼一個古老地名，名喚「龍崀頂」，它所處位置為內灣村當地人視為龍脈的制高點，故而得名。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>陸陸續續來苗栗爬過幾次山之後，發現苗栗這個以丘陵為主要地形的山城，其實也是一個郊山步道繁多的鄉鎮。這些步道大多海拔不高，里程也不長，大略探查其背景，得知多半都是早先居民開墾，方便異地往返的便道。儘管到了現代已由車路取代這些土石路徑，功能與重要性不復以往，卻也搖身一變轉型成為民眾散步踏青的好去處。</p>
        <p>之所以發現龍崀頂這條步道，也是偶然行車經過三灣時，瞥見三灣大橋附近路邊立著一顆巨大的勒石，登山雷達霎時發出感應，遂馬上調頭迴轉將車輛停放在空曠處，走近端詳勒石上面的題字，確信雷達所示不假。這顆勒石雖然是在距今大約十多年前的建國百年所刻，但整體外觀乾淨且保存良好，反倒是一旁的介紹牌子已十分老舊斑駁，字跡褪色不好辨識。</p>
        <figure>
            <img src="/images/mtlogs/017/01.jpg">
        </figure>
        <p>湊近牌子仔細端詳，上頭寫著「龍崀頂」為一客家地名，長形的山脈客家人稱為「龍脈」，低矮山丘的斜坡稱為「崀」，因位於內灣村龍脈最高點而名。昔曾設隘防漢蕃勾結，設有隘寮，又稱隘寮頂。</p>
        <p>上網速查了一下山友的健行記錄，發現總里程不長，單趟來回約三公里，步道單純且看起來維護地不錯，於是返回車輛更換常備於後車廂裡的登山鞋，輕裝出發。</p>
        <figure>
            <img src="/images/mtlogs/017/02.jpg">
        </figure>
        <p>階梯穿梭於桂竹與矮樹叢草混雜的林相之間，起初所見之相和一般郊山步道無異，但上切到稜線時，樹林破風處的視野驀地大展而開。</p>
        <figure>
            <img src="/images/mtlogs/017/03.jpg">
        </figure>
        <p>海拔不高，景致理所當然無法與大山比擬，儘管如此，倒依然可以盡覽內灣村的村落街景，以及眺望遠方加里山巍峨的身姿、苗栗著名的神仙縱走稜線、馳名的水雲三星等山巒。</p>
        <p>至於兩箭之地下方的溪流則是流淌南庄、三灣、頭份等鄉鎮，一路奔向巴士海峽的中港溪。中港溪源頭來自隸屬雪山山脈的鹿場大山，是上港溪、小東河與南河匯聚後形成的巨大溪流，大多數人對中港溪沒什麼記憶點，但如果提到蓬萊溪護魚步道或許有些人就有印象了，該步道坐落於南庄山澗，自詡苗栗首條將護魚行動付諸實際的溪流步道，所冠之蓬萊溪便是南河的另一個別稱。</p>
        <figure>
            <img src="/images/mtlogs/017/04.jpg">
        </figure>
        <p>為什麼要特別記述中港溪呢？這是因為中港溪流域不僅在早期竹苗山地的拓墾發展中占有重要一席之地，三灣鄉名稱的由來更是與之習習相關，中港溪流經該鄉內連續繞三個大彎且沖積成平原，這片平原即先民落腳開墾拓荒之處，同時這片土地為中港溪三個大彎中第三個彎，因此也就自然而然取名為三灣，易字部首水字旁表示地名與水流有關。</p>
        <p>三個大彎除了第三個彎取名為三灣之外，前兩個彎孕育的地區同樣也是淺顯易懂地取名為內灣與二灣，龍崀頂步道所在位置便是內灣村的南方高處，至於二灣地名在已知地圖記錄中並無標記，但根據內灣與三灣相對位置推測，有可能大略位置是於兩村之間的九芎林、石坑子一帶。</p>
        <p>但無論是內灣、二灣還是三灣，在現代都已規劃於三灣鄉的行政轄區之中，而該鄉高達９９％都為客家族群，無疑是全台灣客家人佔比最高的鄉鎮。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>雖然步道開闢在稜線上，但整體起伏並不若想像中平坦，而是反覆經歷緩升後突然一個陡降，然後再繼續緩升的循環。</p>
        <p>步道入口的導覽介紹有提到，龍崀頂此處在古代還有另一個名稱叫做「隘寮頂」，所謂隘寮，指的是搭建於險要之地（隘）的屋舍（寮），會設置隘寮的地方，多半都是古時漢人入山拓墾，與原生原住民發生衝突的區域，漢人在警戒要地建立防線並派人員駐守，一旦發現原住民蹤跡，便立即示警從而達到及時防備的作用。在台灣很多地方都能找到隘寮的蹤跡，迄今甚至有些地區也仍然用隘寮作為地名，例如屏東內埔鄉的隘寮村、南投集集鎮的隘寮里等等。</p>
        <figure>
            <img src="/images/mtlogs/017/05.jpg">
        </figure>
        <p>不過設置於三灣鄉內灣村的隘寮，和一般常見的隘寮設置原因有一些些不同，其原因得追溯清朝嘉慶年間，一批粵人客家移民組織墾號開始移墾於中港溪番地，因在此之前其他漢人（閩粵移民）已於內灣西側的斗煥坪一帶與當地原住民交好多年，故雙方往來密切，物資交換、嫁娶等交流稀鬆平常。</p>
        <p>然而，到了道光年間，閩粵發山械鬥，許多粵人逃入南庄原住民居地，並煽動原住民出山協助抗鬥，中港社一帶街區便得十分不安寧。後來清朝政府派軍隊平定內亂，為防止漢人與原住民私下合作興風作浪，清廷因而設置隘寮以禁止漢人踰越私通原住民，原本的墾務亦隨之中斷，儘管之後陸續有小規模的粵人試圖深入南庄內陸丘陵山區進行開發，但因各種因素致使成效緩慢，一直到新竹北埔著名的「金廣福」墾號的成立，隘墾區內的竹東丘陵才有全面性發展。</p>
        <p>步道走著走著，突然發現一旁桂竹林蹦出一個缺口，缺口處附近繫著多條各路登山隊的布條，經比對地圖軌跡與目前位置，發現這條隱密土徑通往的是龍崀頂最高點。</p>
        <figure>
            <img src="/images/mtlogs/017/06.jpg">
        </figure>
        <p>不消三分鐘便來到山頂，平坦的腹地筆挺插著一樁台灣省政府圖根補點，一旁樹梢上著盯著一張殘缺一半的紙牌子，上頭殘留的油性筆劃過的「火炎」兩字──原來這座山頭名字叫做火炎山。</p>
        <p>雖然都是在苗栗，這座海拔高度僅１８５公尺的火炎山，無疑不是我們所熟知的那座小百岳火炎山。根據網路相關資料記載，此山東面即靠近中港溪一側為崩崖，若從進入三灣市區的兩座大橋仰望，裸露的岩層一線排開，彷彿著名的三義火炎山縮小版，三灣火炎山之名遂於焉而生。</p>
        <figure>
            <img src="/images/mtlogs/017/07.jpg">
        </figure>
        <p>通常多數山友在觸及火炎山基石後，此行便功德圓滿可原路折返，但我見步道經過火炎山岔口後還有一小段，盡頭直通車路內埔道，見時間尚有餘裕，便決定加碼踢個遠路繞去三灣市區，然後再回到車輛停放的位置圈成環狀Ｏ繞的散步路線。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>「長者們隨住眾生活，培養清淨心，安住本覺自性，臨終無障礙，得生淨土。」</p>
        <p>內埔道接續大路三和大橋的交會口有一座頗具規模的佛寺，名叫「彌陀寺」，不僅提供修行者一處共同修學的道場，同時還另外建有「彌陀村」，兼具老年安養的照護功能。</p>
        <figure>
            <img src="/images/mtlogs/017/08.jpg">
        </figure>
        <p>在撰寫這條步道心得，查閱各類相關典籍、資料的時候，發現龍崀頂步道也被收入竹苗著名路線「樟之細路」其中一段，而說到樟之細路，其實也和前面提到的漢人拓墾、與原住民往來、物產銷售、械鬥衝突、劃界設隘等歷史脈絡環環相扣。言簡意賅地說，樟之細路和樟腦必然脫離不了關係，而樟腦的出產，從清朝至日治時期，南庄一直都是出產地區的大宗，鄰近的三灣鄉亦參與了樟腦運輸的過程。龍崀頂步道過去做為當地人與外界進行農產貿易的便道，這些經濟作物主要品項輸出中，除稻米、甘蔗、茶、藍靛之外，也包含了樟腦。</p>
        <p>根據史料記載，中港溪在清朝割台以前，就已經是樟腦「走私」到中國的主流。爾後日治時期因為國際需求大增，英國人於南庄設置紅毛館，大肆採購樟腦用以製造「賽璐珞」（Ｃｅｌｌｕｌｏｉｄ，硝酸纖維素塑膠），南庄一帶樟腦事業可謂進入全盛時期。</p>
        <figure>
            <img src="/images/mtlogs/017/09.jpg">
        </figure>
        <p>站在三和大橋橋上看向火炎山，說是三義火炎山的破產版還真有那麼一些些相似。而三和大橋下方有條小路，可以走下中港溪河床邊，我好奇這條小路是否可以直達火炎山山腳下方，於是便循著河堤馬路往深處邁進。</p>
        <p>儘管道路盡頭處離火炎山山壁還有一段距離，但能這麼近距離觀賞中港溪流域與龍崀頂火炎山，著實別具一番滋味。</p>
        <figure>
            <img src="/images/mtlogs/017/10.jpg">
        </figure>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <div class="mtlogs-title" v-text="catalog[4].title"></div>
        <p>據說早期漢人移民之間並沒有很強烈的閩、粵分類的族群意識，彼此之前互信互助，並與原住民和平交流。只是後來隨著移民逐漸增加，日益嚴重的利益分配問題，才導致閩、粵、蕃三方發生激烈武裝衝突，開始各自強調不同文化與族群分類。如今事過境遷，邁入多元文化社會的台灣，不同族群之間的紛爭已經大幅減少，人與人之間更多的是友愛與包容，這即是「樟之細路」緣起所想表達的宗旨，其所冀望畫在地圖上的每一條──過去可能是阻隔不同族群的隘勇線、土牛線，於今朝皆已串連為一條和平共生，不分族群、文化、人種，所有人都能踏上這綿延３８０公里長的國家綠道。</p>
        <figure>
            <img src="/images/mtlogs/017/11.jpg">
        </figure>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>