<script setup lang="ts">
    import { reactive } from "vue";
    import type { CatalogItem } from '@/stores/catalog';

    // 引用組件
    import BaseTextContent from '@/components/Common/BaseTextContent.vue';
    import Title from "@/components/Common/BaseTextTitle.vue";

    // 目錄
    const catalog = reactive<CatalogItem[]>([
        { id: 0, title: '0K：楔子' },
        { id: 1, title: '1K：南興地磅站' },
        { id: 2, title: '2K：巴塱衛山' },
        { id: 3, title: '3K：利嘉林道' },
        { id: 4, title: '4K：後記' },
    ]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="18" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2021-09-19</strong></p>
        <p><span>行走總長：</span><strong>約 0.5 KM</strong></p>
        <p><span>累計耗時：</span><strong>約 0.1 HR</strong></p>
        <p><span>路程總覽：</span><strong>南興地磅站 → 巴塱衛山 → 忘憂亭</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>今年中秋連假，我們一行人臨時起意，決定繞半個台灣驅車前往花東，擺脫平日在都市叢林裡承受的喧囂，徜徉於東部山海間，感受東台灣慢活步調。不過因為是放假前幾天才突然下的決定，預算內的飯店民宿基本上都已經客滿，於是我們轉念一想，不如就找個人煙罕至的地方野營，愜意地度過連續假期。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>我們半夜出發，一路向南行駛，穿越南迴公路來到台東。不得不說南迴公路台東端新開通的路段不僅改善傳統舊路蜿蜒曲折對用路人的折騰，筆直又開闊大道更是大幅縮短交通時間，當我們來到台灣本島另一側的台東達仁鄉，驚訝竟然只花三個半小時，即便再算上中途短暫休息的部分，天色依舊是烏漆嘛黑的凌晨四時多分，比預期早到許多。</p>
        <figure>
            <img src="/images/mtlogs/018/01.jpg">
        </figure>
        <p>距離預定野營的地點還有很長一段距離，礙於我們的食材和烤肉用具都是敲定在台東當地採買，這時間直奔野營地點毫無意義，所以我們打開手機瀏覽器，搜尋附近有沒有觀賞日出的絕佳景點，滑著滑著，「巴塱衛山」的名字便出現在關鍵字搜尋結果榜單裡頭。</p>
        <figure>
            <img src="/images/mtlogs/018/02.jpg">
        </figure>
        <p>巴塱衛山是緊鄰台東海岸線的一座郊山，從台九線即有車路可以扶搖直上山頭。更重要的是，巴塱衛山還是台灣小百岳之一，這對我們這些近幾年酷愛爬山的人而岩簡直是天上掉下來的餡餅，立即拍板決定前往。若要從台九線轉巴塱衛山位於的山豬窟產業道路的岔口「南興地磅站」步行上山，單程大約兩公里的路程，距離雖說不算長，但考量天色已開始隱約發亮，我們也顧不得「拒絕偷吃步直接透過交通工具登頂」的原則，趕緊到達山頂迎接日出。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>走路可能得花一小時，開車卻只消十分鐘。我們沿著狹小的產業道路來到山頂的停車空間，一下車便看見刻有「巴塱衛山」字樣的勒石。</p>
        <figure>
            <img src="/images/mtlogs/018/03.jpg">
        </figure>
        <p>據說「巴塱衛」是台東大武鄉的舊稱，這個發音源自排灣族，它有兩種說法：一是意指廣大的東西逐漸縮小（Ａｚｉｙｏｇｕｚｙ），資料並沒有明確指出是什麼廣大的東西逐漸縮小，但根據地理位置，個人猜想或許指的是太平洋流入內陸逐漸縮小成幾道溪流，這些溪流沖積出一片平原，即巴塱衛平原，是排灣族巴塱衛社的傳統領域；二是「拿棒子敲打」（Ｐａｒｏｎｇｏｅ）的意思。為什麼要拿棒子敲打？根據網路資料敘述，早年排灣族在遷徙過程中，為了避開沼澤和濕地，族人會用棒子敲打地面以確認土地可用性或是否宜居，因而造就該地地名由來。</p>
        <p>巴塱衛山山頂建有一塊範圍廣闊、兩層式的景觀平台，平台上方座立兩個觀景涼亭，並取名「忘憂」與「解愁」。</p>
        <figure>
            <img src="/images/mtlogs/018/04.jpg">
        </figure>
        <p>我們坐在忘憂亭裡，一邊悠悠哉哉等待日出，一邊打量著這塊平台，想著其實這裡也是個不錯的紮營選擇，不單單只是腹地夠大夠平坦，從亭子投射出去的眼線，能釣起的美景可說是無垠無際、取之不竭。</p>
        <figure>
            <img src="/images/mtlogs/018/05.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/018/06.jpg">
        </figure>
        <p>隨著一抹泛白悄然出現，一場絢麗的色彩交鋒也正式拉開帷幕，原本佔據絕對優勢的靛紫色帝國，為象徵希望的橘紅色軍團，以迅雷不及掩耳之勢步步進逼。當雙方於穹頂各佔據一半呈現僵持之勢時，一道圓弧強行自筆直的海平面壁壘突出一道缺口，身後大軍宛如敲破的蛋黃，金黃蛋液迅速暈開，與暗色的太平洋海面融為一體，至此冷暖之間的平衡徹底被打破，縱使深色曾於夜幕時築起厚實雲牆，也依然無法抵擋旭日強勢的輝煌。</p>
        <p>原本包場的我們從驚呼感嘆聲中回過神時，忘憂亭內不知何時開始多了好幾組和我們有著相同目標，開車上山欣賞日出的訪客。從彼此寒暄問候裡得知，有些人是在地居民，也有些遊客則和我們一樣遠道而來，計畫在花東度過三天兩夜的中秋假期。</p>
        <figure>
            <img src="/images/mtlogs/018/07.jpg">
        </figure>
        <p>天亮後，我們在觀景平台旁邊草地找到巴塱衛山的二等三角點。巴塱衛山，海拔高度３２５公尺，台灣小百岳編號第９６號，為最新版小百岳名單中台灣本島區域最後一席。</p>
        <p>從清朝時期開始，大武一帶便稱為巴塱衛，在牡丹社事件平定後，清廷便派命沈葆楨來台推動「開山撫番」政策，開山指的是開通前往東部的山路，其中有幾條山道都是經由巴塱衛區域進入台東，因此巴塱衛也被稱為「台東門戶」。到了日治時期，因時局不穩定，行政區域劃分變動頻繁，台灣總督府從原先規劃的三縣一廳調整為六縣三廳，台東廳從台南縣分化出去自成一個行政區域，而台東廳又細分為四個支廳，巴塱衛支廳便是其一。巴塱衛支廳在當時不僅是日本政府管理排灣族原住民重要據點，同時也是當時日本人、漢人經商的商業中心，總體發展在當時頗為興盛。後來國民政府接收台灣，將巴塱衛支廳大武、太麻里兩大區域獨立設鄉，鄰近的達仁鄉亦歸納部分原巴塱衛支廳管轄的山地，所以即便現代地圖上已經鮮少看到巴塱衛這個名字，卻能從許多歷史遺留的記錄尋得它之蹤跡。</p>
        <p></p>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>欣賞完巴塱衛山一等一的日出美景，我們取車駛往台東市。先是去了鄰近的台東海濱公園、朝聖似乎小有名氣的阿伯小白屋，接著進入市區覓食，採買烤肉用具和食材等，晃著晃著也消磨掉半天時間，才正式朝我們此行最主要目的地──「利嘉林道」出發。說是這樣說，其實我們原本是估計傍晚才要上山，但是要做的事情都已辦妥，肚子也填飽了，一時間想不到還有什麼想去的地方，乾脆早點上山尋找合適的紮營地點，說來這倒也契合這趟旅行的宗旨，要很Ｃｈｉｌｌ、很Ｆｒｅｅ的渡假。</p>
        <figure>
            <img src="/images/mtlogs/018/08.jpg">
        </figure>
        <p>利嘉林道是一條長達四十公里，在台灣多條林道中算是開闢比較年輕的一條的產業道路，主要在大巴六九山山區內蜿蜒，一直深入至雙鬼湖野生動植物自然保護區。利嘉此名源自卑南族語（Ｌｉｋａｖｕｎｇ），意思是「在肥沃的土地上長出茂盛的姑婆芋」，該山域過去曾是卑南族大巴六九山社的獵場與農墾地。不說不知道，說了嚇一跳，別看大巴六九山社好像默默無聞，這裡可是台灣歌壇經典傳奇，紅透台灣半邊天的歌后──張惠妹的故鄉。</p>
        <p>大巴六九山山林地形複雜、環境潮濕多霧，動、植物多樣性十分豐富，林相以亞熱帶闊葉林為主體，樹種包括台灣杉、紅檜、扁柏、牛樟、台灣櫸木．．．．．．等不勝枚舉。生物方面，除了常見的台灣獼猴、山羌等，還有長鬃山羊、台灣黑熊等大型哺乳動物在這裡也都有分布，更是台灣特有種橙腹樹蛙族群數量最密集的區域。為了保護野生動物的棲息環境，一般車輛只能通行到利嘉林道１１．５公里處，從這裡開始便是利嘉野生動物重要棲息環境的範圍。</p>
        <p>我們從１１．５Ｋ管制柵門折返，在距此不遠的分岔小路中盡頭找到一處名為「長尾尖櫧種子園」的空地，雖然雜草已經有些長長，地勢非常平坦很適合露營，大夥兒片刻間達成共識，決定今晚就在這裡度過。</p>
        <figure>
            <img src="/images/mtlogs/018/09.jpg">
        </figure>
        <p>這裡還設有一座觀景台，可以眺望台東市區街景，以及美麗的花東縱谷和太平洋。傍晚確認沒有其他遊客上來賞景，我們遂將帳篷轉移到觀景台上方，一邊吃酒，一邊閒話家常，平時大家都在為各自的生活奮鬥，沒什麼機會見面，難得一聚，聊東說西，繞過南北又說回東，總有說不完的話題。</p>
        <p>也不知喧騰了多久，當我們從夢鄉醒來時，已是準備迎接第二個日出。</p>
        <figure>
            <img src="/images/mtlogs/018/10.jpg">
        </figure>
        <p>遠方聳立的高山是花東縱谷最著名的「都蘭山」，祂是海岸山脈南端的最高山，寬厚的山體遠遠看過去十分雄壯，且氣勢非凡。據說在日治時代，曾有日本人形容其像富士山，指著祂說是「台東富士」，因此都蘭山也就被稱為台東富士山。</p>
        <p>昨天在觀景平台轉悠的時候發現平台後方有一條向下延伸的階梯，第二天早上醒來後便試著循石板鋪設的步道進入森林之中，只可惜走沒多久，路徑就被雜草和蜘蛛網所遮覆，顯然這裡鮮少有人來走，所以我們也就打消了繼續深入的念頭，回到平台收拾行裝。</p>
        <figure>
            <img src="/images/mtlogs/018/11.jpg">
        </figure>
        <p>後來回家查才得知，我們野營的觀景平台其實只是長尾尖櫧種子園的入口，它其實是一座面積寬廣的森林公園，栽種了由林務局提供的五百多株長尾尖櫧。長尾尖櫧中文學名亦稱作長尾栲、卡氏櫧，主要用於建築材料，樹皮也可提煉成栲膠，是製革業常用的植物鞣劑。在台灣，長尾尖櫧多半分布在中高海拔的山區，因其用途廣泛，被發掘後就開始被大量濫墾，目前由林務局接收的長尾尖櫧種子園，過去也曾是一片遭受濫墾的山坡地。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <div class="mtlogs-title" v-text="catalog[4].title"></div>
        <p>收拾完家當，我們開始討論接下來要怎麼走，最初的構想是繼續北上，到其中一名友人的台北家作客，第三天再返回台中，雖然是開車，但也是一趟環島之旅了。然而，興許是身心靈已全然進入慵懶頹靡的狀態，我們已經懶得穿越漫長的東部縱谷和蘇花公路，決定就這樣原路折返回西部。</p>
        <p>細數這兩天兩夜的東部之旅，其實我們並沒有去太多觀光景點，或許在外人眼中，從西部大老遠跑來東部一趟，卻幾乎什麼地方都沒有去──如此旅遊安排太過「奢侈」，不過對我們來說，此行原本就是一時興起，大家隨口應允進而成行的「意外」，但仔細想想，前一次這種說走就走的旅行，可能也得回溯到大學時期了吧。</p>
        <figure>
            <img src="/images/mtlogs/018/12.jpg">
        </figure>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>