<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：屯原登山口' },
    { id: 2, title: '2K：雲海保線所' },
    { id: 3, title: '3K：能高瀑布' },
    { id: 4, title: '4K：天池山莊' },
    { id: 5, title: '5K：天池' },
    { id: 6, title: '6K：奇萊南峰' },
    { id: 7, title: '7K：回程' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="19" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2018-10-13</strong></p>
        <p><span>行走總長：</span><strong>約 33 KM</strong></p>
        <p><span>累計耗時：</span><strong>兩天一夜</strong></p>
        <p><span>路程總覽：</span><strong>屯原登山口 → 雲海保線所 → 能高瀑布 → 天池山莊 → 天池 → 奇萊南峰</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>２０１８年的夏季尾聲，聊天群組捎來其中一名友人的訊息，大意是說今年國慶那週是否要挑戰為期兩天的高山縱走行程？雖然在那之前，我就有時不時去走登山步道的習慣，但多半都在住處附近的郊山活動，對登山這個項活動處於不排斥，但也沒有到很喜歡的階段，單純將其視作消耗卡路里的運動，頻率也不高。</p>
        <p>所以面對朋友邀請，起初個人內心是萬分猶豫的，一來是從來沒有爬過高海拔山岳的經驗，二來是他們計畫要挑戰的路線是「鼎鼎大名」的黑色奇萊──當然，在我知道他們目標其實是新手入門的奇萊南華已經是後面進一步解釋的事情了，這也是為什麼下定決心跟著加入的原因之一。總而言之，在有甫考取專業高山嚮導證照的朋友主持，以及順利申請到天池山莊的床位，並搭配尚可的天氣預報，天時地利人和三者俱全之下，我的登山里程碑張燈結綵地正式拉開序幕。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>禮拜五下午跟公司請了假，回家梳洗後強迫自己上床睡覺，縱然輾轉難眠，也只能試著秉持畜養一分體力是一分的想法催眠自己。因為我們這支自組小隊將於這個晚上行使「ＤＡＹ０」計畫──所謂ＤＡＹ０（第零日），指的是在正式行程之前的準備日，通常包含了提前抵達登山口或住宿點的交通路程，是岳界規畫登山計畫時常見的用語。</p>
        <p>我們三人於晚間九點於集合地點會合，清點彼此行囊確認該帶的物品都有齊全後，便從台中驅車前往埔里。不得不老實說下午的假根本白白浪費掉了，整個下午翻來覆去根本睡不著覺，畢竟這是我第一次挑戰過夜的爬山行程，而且也是扣除騎車上合歡山武嶺之外，首次以步行的方式攀登三千公尺級別的高海拔地區，從週一開始便心神不寧，處於既緊張又興奮的高亢狀態。</p>
        <p>我們在埔里進行最後一次補給，雖然只是短暫兩天兩夜與日常闊別，依然買了鹹酥雞和手搖飲爆吃一波才又悠悠哉哉繼續趕路，只是這些吃進肚子裡的炸物並沒有在我體內溫存太久，從進廬山與清境農場的分岔開始的台１４線，轉入產業道路直達屯原登山口，一路曲折蜿蜒，本就易暈體質的我毫無意外地在半道多次「抓兔子」，狀況之慘烈一度陷入自我懷疑，為什麼要大老遠跑來深山活受罪？但是事到如今也沒有辦法回頭了，只能拎著嘔吐袋咬著牙苦撐。</p>
        <figure>
            <img src="/images/mtlogs/019/01.jpg">
        </figure>
        <p>凌晨一點十五分，我們終於順利駕車抵達屯原登山口上方的停車場，令人意外的是這個時間點空位竟已寥寥無幾，至少超過十數台車輛，停駐在這個腹地還算寬敞的平坦空地。有些車子裡面還微微透出亮光，不難看出不少登山客和我們一樣，提前一個夜晚便上山備戰，印證了山界前輩、網路山友所述，奇萊南華這條路線的熱門程度，假日停車位往往是一位難求。</p>
        <p>儘管距離天亮剩不到六個小時，我們的隊長兼嚮導──榮哥，仍手腳俐落地在車子旁邊搭起帳篷。榮哥說，無論如何，就算躺在帳篷幾小時後就得花時間收帳，也比三人蜷縮在小車上都來的有價值。</p>
        <p>從入睡到醒來彷彿只是一瞬間，聽到帳篷外陸續傳來人們彼此交談、鍋具鏗鏘的聲響，帳篷篷布亦由原先的深黑漆染上淡淡的光彩。抬起手腕看看手錶，時間已是清晨五點，即使有些吵雜，被強烈睏意糾纏的我們，硬是賴到六點半才掀開營帳，十月的海拔兩千公尺，溫度已下降到十多度，唐突進犯的寒意令我等不由得直打哆嗦。</p>
        <figure>
            <img src="/images/mtlogs/019/02.jpg">
        </figure>
        <p>雖然陸陸續續仍有車輛上來，我們正式從「能高越嶺國家步道」屯原登山口的起登時間，比其他前一晚也睡在車上的登山口還來得遲些，但榮哥對此並不太擔憂，他說今天只需要走到住宿地點「天池山莊」即可，現在七點出發都還不算晚。那些凌晨三點、四點就開爬的隊伍，有的估計是到達天池山莊卸下重裝後，接著輕裝前往光被八表；或是一鼓作氣計畫在一天內完成奇萊南華的單攻客。</p>
        <p>「單攻指的是獨攀嗎？」</p>
        <p>「不是，單攻指的是一天內來回登山路線，獨攀是指自己一個人爬山。」</p>
        <p>獨攀可以是單攻，但單攻不見得是獨攀，過去我一直誤以為這兩者代表的是同一件事，只是用詞習慣的差異。幸好平常不怎麼會把這兩個詞掛在嘴邊說，差點鬧出笑話。</p>
        <figure>
            <img src="/images/mtlogs/019/03.jpg">
        </figure>
        <p>甫踏上能高越嶺古道沒多久，便看見平坦的碎石子步道上插著一根告示牌，上頭寫著「注意落石請勿逗留」之字樣，我們循著山徑延伸的方向望去，一條壯闊的銀灰色瀑布，將山體硬是切割成兩半，彷彿停滯了時間般，瀑布停止流動，宣洩之處滿是大小不一的石礫。</p>
        <p>這便是能高越嶺古道屯原段著名的崩壁地形，地質破碎裸露，在沒有任何防護措施的保護下，登山者失足摔落邊坡的憾事時有所聞，如此危險地形在號稱新手入門級的百岳路線竟不止一處，而且聽說一處比一處更加險峻。儘管實際通過沒有想像中來得可怕，但我們仍效法前方隊伍，先抬頭確認上方沒有任何碎石意圖打破凍結的時間，接著一前一後緊挨彼此，三步併兩步快速橫渡通過。在我們排隊穿越的等候過程中，聽到一名山友向所屬隊伍的領頭人拋出疑問：</p>
        <p>「這麼危險為什麼沒有繩索或護欄？」</p>
        <p>「因為落大雨時候，上頭崩落的土石就會把整條步道給淹沒了去，繩索、護欄沒路用。」</p>
        <p>領頭的大哥操著流利的台語腔如是說。</p>
        <figure>
            <img src="/images/mtlogs/019/04.jpg">
        </figure>
        <p>仔細一看，猶能看見崩壁下方還殘留著過去被沖壞的木棧道。</p>
        <p>後來榮哥也說，我們此行其實集結了很多「幸運」，第一個幸運是初次參加天池山莊床位的抽籤便順利中籤；第二個幸運則是今年沒有豪雨風災，古道並未被崩壁土石流無情沖壞，否則我們除了得改道高遶、多爬好幾公里的上坡之外，更甚者國家公園管理單位會斟酌災情勒令封山，不開放一般民眾進入山區。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>作為早年原住民賽德克族行獵、遷徙、貿易等往來的傳統路徑，能高越嶺古道是一條歷史溯源悠久的高山步道，到了日治時期因總督府政管需求而被改闢成警備交通要道，再之後國民政府接管台灣，將步道用作台電高壓電塔東西向輸電的保線便道，同一條路，不同時期，被賦予了截然不同的承載重任。</p>
        <figure>
            <img src="/images/mtlogs/019/05.jpg">
        </figure>
        <p>時至今日我們行走於這條步道，猶可輕易地發現沿途多處保有電力輸送的相關設施，例如台電建設的便橋、傳統舊電桿、廢棄纜線．．．．．．等等，而在這之中最著名的人工建物當屬「雲海保線所」。</p>
        <figure>
            <img src="/images/mtlogs/019/07.jpg">
        </figure>
        <p>正門上方牌匾題寫著「台中供電區營運處 雲海保線所」字樣，其建築前身乃日治時期於能高越嶺古道設立多個駐在所的其中一幢，是為「尾上駐在所」。而後台電沿用，雖然經歷多次翻修，但基本只針對內部裝潢改善，建築外觀基本保留原本駐在所的面貌。因夏秋雲海繁盛季節，該處地勢平坦、展望極佳，可輕而易舉地收穫大抹大抹的白浪洶湧景觀，「雲海保線所」命名之靈感便源自於此。</p>
        <p>而如今，能高越嶺古道是眾多登山隊伍列為一生必訪的路線之一，腹地寬大的雲海保線所自然而然也成為往來絕佳的中繼站。不只如此，我們這趟去程和回程，都在保線所周圍看見數顆帳篷升起，聽榮哥說他最一開始也想過第零日直接推進到雲海保線所紮營睡覺，如此一來，第一天起登就可以直接省掉四公里的路程，只是我們最終規劃抵達登山口的時間太晚，遂打消了念頭。</p>
        <p>休息十分鐘後我們繼續朝天池山莊邁進，雖說屯原登山口到天池山莊足足有十三公里長，但地勢平坦，爬升趨緩，行走起來和平常踢馬路差異無幾，若要說有什麼不同，大概就是背上多了十幾公斤的負重。由於此行是我第一次過夜爬山，特地跑去迪卡儂買了一顆５０升的登山背包使用，雖然跟榮哥和村長的ＧＲＥＧＯＲＹ相比肯定沒那麼舒適，作為入門款倒也還算堪用，整趟下來除了肩膀被勒得有點疼痛之外沒什麼其他嚴重缺點。</p>
        <figure>
            <img src="/images/mtlogs/019/08.jpg">
        </figure>
        <p>走著走著，隱隱約約聽見山林間傳來轟隆轟隆的引擎聲響，而且還是熟悉的野狼傳奇嚎叫聲，本以為是錯覺，但沒多久，便看見兩輛打檔車一前一後迎面駛來。</p>
        <p>「想不到這條路上竟然還能騎機車！」</p>
        <p>單論古道的路況，要騎車著實問題不大，但要穿越數道險象環生的大崩壁，那可是個大問題啊！即便知道騎著摩托車往來的勇士都是天池山莊的協作，對他們來說馳騁於這條碎石子路早已習以為常，可一想起時不時一場大雨就會土石崩塌，把狹窄的道路沖壞的大崩壁路段，仍不禁為他們捏一把冷汗。事實上，天池山莊的協作們利用摩托車穿梭兩地一直以來都是頗具爭議的話題，不僅曾經發生過機車打滑摔下山的憾事，也曾傳出部分協作利用機車之便提供女性登山客免費接駁的「沙必死」之醜聞。只是換位想一想，如果只能用徒步方式補給山莊的食材和日用品，每一次進出都得走上十幾公里，恐怕沒幾個人願意接下這樁苦差事吧？</p>
        <figure>
            <img src="/images/mtlogs/019/09.jpg">
        </figure>
    </div>
    <div class="text-block" :id="'act' + catalog[3].id">
        <div class="mtlogs-title" v-text="catalog[3].title"></div>
        <p>離開雲海保線所，一直走到能高越嶺古道下一處著名景點「能高瀑布」大約八公里的路程，過程基本上就是森林山徑與大崩壁碎石子路相互交錯，沿途沒有太大地形起伏。</p>
        <figure>
            <img src="/images/mtlogs/019/10.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/019/11.jpg">
        </figure>
        <p>對第一次參加百岳行程的我來說，能高越嶺古道沿途任何景致見聞都覺得既新鮮又驚奇，有壯觀且令人心驚膽跳的大崩壁、有崢嶸於靄靄雲霧間的層層山巒，又或是驀地回首發現來時的路就像網球上的縫線，細細長長蜿蜒於山壁與森林之間，豐富的林相、亂石嶙峋．．．．．．等等，相機的快門幾乎沒有獲得太多喘息的機會。</p>
        <p>十月的海拔兩千公尺正值秋高氣爽的時刻，體感很是舒適，因此我們腳步也踩得飛快，不消兩個半小時，便推進到能高瀑布。</p>
        <figure>
            <img src="/images/mtlogs/019/12.jpg">
        </figure>
        <p>能高瀑布高低落差約一百五十公尺，從天池山莊回程的方向去看，更能清楚地看見能高瀑布的樣貌。能高瀑布又被稱為「三疊瀑布」，此名稱原由來自於該瀑布分三層，在水量豐沛時期，瀑布如銀色絲帶於聳立山巒之間奔騰流瀉，蔚為壯觀。在日治時期因為能高瀑布中段的水流分成兩道，宛如一對並立的夫妻，故當時也有人稱能高瀑布為「夫妻瀧」。</p>
        <p>不過今年台灣屬於旱年，大雨稀缺，我們此行所看見的瀑布水量，並不若網路上其他山友分享的照片影像中那樣氣勢滂沱，算是這趟山旅的一小缺憾。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[4].id">
        <div class="mtlogs-title" v-text="catalog[4].title"></div>
        <p>抵達能高瀑布，距離天池山莊也就不遠了。早在走進能高瀑布區之前的髮夾彎，就能探見天池山莊在樹叢間的空隙探出頭腳來，而隨著腳步越來越接近山莊，各種此起彼落的交談、歡鬧聲也在空氣中越發鼎沸。</p>
        <figure>
            <img src="/images/mtlogs/019/13.jpg">
        </figure>
        <p>不過比起深山中竟坐落著如此巨大的木造建築，或是登山客數量多到山莊外圍盡是五顏六色的帳篷，更吸引目光的還是停放在山莊旁側的野狼們，同為「史帝田鐵」野狼騎士的我們，對能在這車輛難以通行的深山裡看見相同車系的老前輩們，自然是倍感親切，也驗證了野狼老歸老、慢歸慢，但只要路還能行，就沒有它們到不了的地方。</p>
        <figure>
            <img src="/images/mtlogs/019/14.jpg">
        </figure>
        <p>抵達山莊第一件事，就是立刻進去找莊主做報到登記的動作，我們都知道天池山莊很搶手，但一到現場，放眼望去山友數量仍遠超想像，山莊一樓內外幾乎已找不到一處空曠的位置讓我們卸下背包休息一番。</p>
        <p>和雲海保線所相同，天池山莊的前身也是日治時期於能高越嶺古道建立多個駐在所的其中之一，是為「能高駐在所」。不只是現在，能高駐在所在當時規模與設施都是相當完善的駐在所，時常用來接待前來視察的高階將領。隨著時空推移，能高駐在所已改建為提供登山客住宿服務為主的天池山莊，儘管近百年來遭受過數次祝融焚毀，但每歷經一次脫胎換骨，建築設施就又更加完善、便利一些。若要評比全台灣高山山屋有哪些夠資格名列五星級，那天池山莊的名字出現在榜單上絕對無庸置疑。</p>
        <figure>
            <img src="/images/mtlogs/019/15.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/019/16.jpg">
        </figure>
        <p>我們被分配到的床位是八人的大通鋪，沒有床墊和棉被，僅透過巧拼鋪在木板上方增加一些軟適感，至於棉被，可以向山莊租借睡袋，而我們則使用自行攜帶的睡袋。簡陋歸簡陋，但在這深山老林之中還有這樣的住宿環境，倒也沒什麼好苛求的，而且房間打掃得很乾淨，內部幾乎看不到灰塵聚集與蜘蛛網叢生。</p>
        <p>天池山莊還有其他高山山屋很難看見的「現代廁所」，想起隔年去爬南湖群峰，平平都是熱門路線，南湖山屋的廁所相比顯得非常「原汁原味」，大概十步之外就得捏著鼻子才能靠近，小解當下就立刻回憶起天池山莊的美好，不僅有小便斗和蹲式馬桶，還附帶自動沖水功能。</p>
        <p>我們原本預定辦理完天池山莊報到手續，卸下重裝稍作休息後要接著去「光被八表」──因紀念台灣東西輸電這項創舉而建造的巨大紀念碑，然而下午天候不佳，天池山莊不僅落下大雨，氣溫也暴跌地飛快，我們也不得不取消行程，待在山莊裡消磨時間。這次百岳行程除了登山過程，也讓我認識到高山和平地截然不同的作息，不僅晚餐要吃得早，覺也要睡得早，平常可能晚上六、七點甚至八點才吃晚餐都還在正常區間，倘若在山上已經抵達宿點，可能就會提前五點左右解決晚餐，然後早早睡覺備戰隔天的行程。</p>
        <figure>
            <img src="/images/mtlogs/019/17.jpg">
        </figure>
        <p>我們的晚餐是三人各自採買食材湊成的小火鍋，恰好可以為逐漸降低的氣溫解解寒氣。天池山莊的協作大哥很好心，見我們三人蜷縮在廚房角落處理食材，他們那邊團膳炊煮告一段落後，便招呼我們過去使用他們的料理台，還大方地告訴我們台子上剩餘的食材可以隨便拿、盡量加。</p>
        <p>「吃飽一點明天才有力氣爬山喔！」</p>
        <p>操著原住民的口音，協作大哥一邊說道，一邊端著裝滿菜肉的大鐵盆帥氣地走出廚房。</p>
        <figure>
            <img src="/images/mtlogs/019/18.jpg">
        </figure>
        <p>但五星級終究也是比較出來的，位處深山，高山山莊到底仍難以做到像平地飯店那般盡善盡美，除了不提供盥洗，電力供應時間也有限制。雖說是東西電力輸送的樞紐，天池山莊的電力卻全仰賴太陽能，很難支應全天候運作，因此過了晚上八點後除了大廳之外的房間電燈都會強制關閉。</p>
        <p>因為房間沒有燈光，網路訊號也非常不穩定，吃飽飯後回房間也只能鑽入睡袋躺平，望著昏暗的木造天花板，仔細想想，這還是這麼多年來頭一次早早就上床睡覺。但畢竟不是平常熟悉的作息，也不是習慣的床鋪，我睡得很淺，然後半夢半醒間聽見樓下大廳傳來吉他輕彈的旋律，一名男人哼著歌，沉穩又柔和的聲調中夾帶些許滄桑。這才猛然想起其他山友的登山心得裡有提到，入住天池山莊有機率可以聽到莊主的天籟之聲，和我們這些習慣使用電子產品的都市人相比，住在山上的莊主與協作們平日的消遣多半都是這樣簡單、純樸。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[5].id">
        <div class="mtlogs-title" v-text="catalog[5].title"></div>
        <p>從下午開始降下的雨直到入夜都不見一絲停歇跡象，在大廳吃晚餐的時候，包含我們在內，四處都聽得到其他隊伍議論著明天如果雨還是沒停，是否要取消攻頂奇萊南華的行程？有山友直接向人也在大廳的莊主提問，只見他一語不發默默地走到門口，像是卜卦又像是在配合演出似地抬頭瞧了瞧天空，然後斬釘截鐵地說「晚點雨就不會再下了」、「明天會出大景，要看日出的早點睡」等豪語，不曉得這份自信是憑藉他長年居住在天池山莊的經驗，還是純粹要安撫大家懸吊著的不安心情，但事實證明，一切都如莊主所料。</p>
        <p>自入夜的某一刻起，屋頂就再也沒聽見雨滴打落在木頭上所發出的滴答聲，我們和其他山友一樣，凌晨兩點多從溫暖的睡袋爬出，投身於冷冽寒氣侵擾之中，不只要對抗寒意，還得與睡意拉扯，只是這份睡意隨著走出寢室外，便被走廊上蜷縮著一大批山友的景象給震攝地一消二散。原來是半夜戶外太過濕冷，在外面搭帳的山友忍受不了寒意，紛紛躲到山莊內部避難，不僅走廊，就連樓梯也都蜷縮著很多毛毛蟲．．．．．．噢不是，是睡袋包裹著全身的山友。</p>
        <figure>
            <img src="/images/mtlogs/019/19.jpg">
        </figure>
        <p>許多山友用完早早餐後便輕裝上路，但我們因為早餐也是自理的緣故，除了炊煮還得收拾，都收拾好、打點完畢乃至整裝出發已是凌晨四點過半，基本上我們是最後一組出發前往奇萊南華看日出的隊伍。往奇萊南華的岔路就在天池山莊旁邊，一開始是行走在兩側都是森林的山徑之中，從天池山莊到奇萊南峰約三公里的路程，說長不長，不過礙於天色昏暗，身體也還沒醒，我們步伐放得很慢，等接上天池山莊名稱由來「天池」時，遠邊的天際已開始微微泛出白色的光痕。</p>
        <p>天池是奇萊南峰與南華山的分岔口，這兩座山都是百岳，而且從天池出發的里程都差不多，大約一至兩公里之間，兩座山的展望據說都非常良好，各自都有隊伍選擇上山等待日出。</p>
        <figure>
            <img src="/images/mtlogs/019/20.jpg">
        </figure>
        <p>我們選擇往奇萊南峰的方向前進，攀上稜線後，遠遠便能望見山腰上點綴著許多光點微粒，這些都是登山客頭燈所綻放的光芒。</p>
        <p>山頭距離我們還很遙遠，低頭估算一下時間，心想應該是沒辦法趕在日出之前登上奇萊南峰山頂，所以我們後來決定爬上半山腰欣賞日出，看著橘黃色的晨曦逐漸暈開，將山頭與雲海，乃至腳下的草原紛紛染上繽紛的色彩，既美麗又奇幻，儘管沒能直面捕捉那璀璨奪目的金芒，但此刻所見的景致也十分令人陶醉的了。</p>
        <figure>
            <img src="/images/mtlogs/019/21.jpg">
        </figure>
    </div>
    <div class="text-block" :id="'act' + catalog[6].id">
        <div class="mtlogs-title" v-text="catalog[6].title"></div>
        <p>不一眨眼功夫，原本還在對面的雲霧頃刻間便從這方鋪天蓋地襲湧上來，強烈冷意逼得我們決定趕緊啟程前進。</p>
        <p>但要說強龍不壓地頭蛇嗎？過路的雲靄只在奇萊南峰的腰身環繞，而沒有試圖將整座山頭吞噬，隨著我們的腳步靠近山頂，太陽撒落的光輝與蟄伏於大草原的雲霧交融一團，形成一幅如夢似幻的綺麗畫作。</p>
        <figure>
            <img src="/images/mtlogs/019/22.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/019/23.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/019/24.jpg">
        </figure>
        <p>帶著極度雀躍與興奮的心情，登上最後十幾公尺的直線，於一片人們歡聲喧鬧之中，我成功登上人生第一座百岳──奇萊南峰。</p>
        <p>奇萊南峰，海拔３３５８公尺，台灣百岳編號４１，因山體平坦寬廣，被評選為象徵「山高而大，有敦厚詳和之氣勢」的「十崇」之一。十崇這個分類名稱，源自於台灣登山界代表人物，岳界四天王之一──刑天正前輩，於其著作《邢天正登山講座》所提出的概念。而除了十崇之外，尚有五嶽、三尖、十峻、九嶂．．．．．．等，根據山形特質而將台灣百岳進一步分類的註記，雖然不是由官方政府明訂的地理名詞，不過在登山界中已是各路山友廣為納用且時常提及的用語。</p>
        <figure>
            <img src="/images/mtlogs/019/25.jpg">
        </figure>
        <p>本來我們是四人的群體，但其中一名友人不便參與，於是我們就突發奇想，把他的照片列印出來一起帶上山合影，讓他也能獲得一些參與感。幫忙拍照的山友起初看見我們拿出照片，還以為這名友人是不是已經過世了，鬧出一點笑話。</p>
        <figure>
            <img src="/images/mtlogs/019/26.jpg">
        </figure>
        <figure>
            <img src="/images/mtlogs/019/27.jpg">
        </figure>
        <p>雲開霧散之後，整個視野變得更加遼闊，遠近的埔里鎮到台中市區的城市風貌都能映入眼底。但若要說最引人入勝的，還是足下站立的這片大草原，這片隨著山形高低起伏的大草原是奇萊南峰最著名的風景，看見有山友放身縱躺於草地之中，我也有樣學樣，將背包、登山杖一甩，呈大字型往後一躺，只是昨夜累積的露水還沒消褪，因此不僅背部一陣濕潤，自矮箭竹叢脫落的葉片更是凌亂地黏在衣著上，我在村長拍下的畫面裡看上去十分狼狽，自以為很愜意，實際看起來反倒像是不小心摔倒在草地裡還故作自得的窘樣，不禁莞爾發笑。</p>
        <p>儘管和預想中的模樣不太一樣，但能像這樣躺在草地上感受陽光，這趟山旅帶給我的，不單單只是達成人生第一座百岳里程碑，更多的是長年在都市繁忙腳步所累積的疲倦，在這次行腳之中獲得洗滌，原本有些縈繞在心頭的大小煩惱，轉念一想，其實似乎沒那麼緊要。</p>
        <figure>
            <img src="/images/mtlogs/019/28.jpg">
        </figure>
        <p>奇萊南峰四面都有展望，北面是熟悉的合歡群峰，定睛細看還能發現蜿蜒在山脈之間的台１４線，彈丸般大小的車輛循著公路緩慢地向上或向下移動。</p>
        <p>視線投放地更深遠一些則可以收攬南湖群峰、雪山聖稜線、大小劍等，各個在岳界皆是赫赫有名的高山百岳，不過這時候的我還沒有培養認山頭的習慣，當下只覺得台灣高山層層疊疊，綿延數千里，其壯闊令人不由得驚嘆連連。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[7].id">
        <div class="mtlogs-title" v-text="catalog[7].title"></div>
        <p>再怎麼不捨，終將面對離別，人與人之間是如此，人與山之間亦然。</p>
        <p>考量今天就必須下山，且起登的時間比預計來的晚，我們商討一番後決定放棄前往南華山的行程，加上回到天池岔口時，從南華山回來的隊伍說南華山的風景跟奇萊南峰差不多，一句話輕如鴻毛實則重如泰山，直接把那匹還惦記著去南華山的駱駝徹底壓垮。當然，事後我們可是懊悔萬分，畢竟天池山莊的床位很難抽，下次再來又不知得等到猴年馬月才能順利成行。</p>
        <p>但不管怎麼樣這些都是後話了，我們當下回程更關心的是要如何大餐朵頤一頓，手搖飲料必不可少，那慶功宴要吃什麼便成為我們下山十五公里之間最首要且頭痛的課題。</p>
        <figure>
            <img src="/images/mtlogs/019/29.jpg">
        </figure>
        <p>凌晨因為烏漆嘛黑的所以沒能看見天池的樣貌，回程再次路過天池就看得很清楚了，誠如先前所說，今年台灣屬於旱年，即便昨天下了場雨，天池的水量依然少的可憐。據說水量豐沛的時候，天池宛如一面鏡子，映照著白雲藍天，與周圍的綠叢交織出美麗的景緻。</p>
        <figure>
            <img src="/images/mtlogs/019/30.jpg">
        </figure>
        <p>我們於九點半回到天池山莊，並在山莊休息一個多小時，吃些東西補充能量、整理行囊的同時，也把濕掉的衣服和裝備給曬一曬。第二天的天氣如此風光明媚，和昨天陰鬱的灰濛天氣相比簡直大相逕庭，看見有些山友直接把躺椅拉出帳篷外，身體仰躺、兩腳開開做起日光浴起來，好不自在。</p>
        <figure>
            <img src="/images/mtlogs/019/31.jpg">
        </figure>
        <p>雖說能高越嶺古道撇開大崩壁路段，整體而言是舒適又安全的步道，越野跑界甚至將這條路線稱為「高速公路」。然而，當我們回程快要到達屯原登山口的時候，突然聽見前方隊伍傳出呼救聲，當我們快步前往呼救聲發出的位置時，現場已聚集了大約十數名的山友，一問方才得知不久前有名山友不慎失足摔落步道，幸好步道邊緣有幾條管線，該名山友剛好卡在管線上，人包均安，並在其他山友的協助下順利爬回步道，結束這場驚魂記。</p>
        <p>縱然該名山友平安無事獲救，但他的經歷也恰好給了我們警訊，即使山徑看起來再怎樣安全，它仍然存在著一定風險，若要完全迴避這些風險，首先是我們必須始終保持警覺性，可以輕鬆，但不能隨便，一趟登山行程的結束，不是在手摸到山頂基石的那一刻，而是平安回到家才是真正的圓滿。</p>
        <figure>
            <img src="/images/mtlogs/019/32.jpg">
        </figure>
        <p>我們於下午三點半順利登出，出自於對平地美食的渴望，我們沒有在停車場逗留太久，換裝後便立即取車下山，先是馬不停蹄地一路駛回埔里市區買了五十嵐手搖飲，然後找了間網路評價不錯的甕仔雞，慶祝我們順利走完這趟兩天將近四十公里的百岳行程。或許奇萊南華路線只是百岳路線中的新手級路線，危險性、難度都不高，然而在跨出這一步之前的我，其實並不怎麼想過自己有朝一日會開始想著去蒐集包含百岳在內的台灣大小山岳，以前只是把爬山當作消耗卡路里的運動，可如今六年過去，登山蒐集山頭、留下記錄已成為我日常休閒的愛好之一。</p>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>