<script setup lang="ts">
import { reactive } from "vue";
import type { CatalogItem } from '@/stores/catalog';

// 引用組件
import BaseTextContent from '@/components/Common/BaseTextContent.vue';
import Title from "@/components/Common/BaseTextTitle.vue";

// 目錄
const catalog = reactive<CatalogItem[]>([
    { id: 0, title: '0K：楔子' },
    { id: 1, title: '1K：屯原登山口' },
    { id: 2, title: '2K：雲海保線所' },
    { id: 3, title: '3K：能高瀑布' },
    { id: 4, title: '4K：天池山莊' },
    { id: 5, title: '5K：天池' },
    { id: 6, title: '6K：奇萊南峰' },
    { id: 7, title: '7K：回程' },
    { id: 8, title: '8K：後記' },
]);
</script>

<template>
    <BaseTextContent>
        <Title :propValue="19" fileType="mountainsLogs" />
<!-- start -->
<div class="text-content">
    <div class="text-catalog">
        <ul>
            <li v-for="item in catalog" :key="item.id">
                <a :href="'#act' + item.id" v-text="item.title"></a>
            </li>
        </ul>
    </div>
    <div class="text-info">
        <p><span>登山日期：</span><strong>2018-10-13</strong></p>
        <p><span>行走總長：</span><strong>約 33 KM</strong></p>
        <p><span>累計耗時：</span><strong>兩天一夜</strong></p>
        <p><span>路程總覽：</span><strong>屯原登山口 → 雲海保線所 → 能高瀑布 → 天池山莊 → 天池 → 奇萊南峰</strong></p>
    </div>
    <div class="text-block" :id="'act' + catalog[0].id">
        <div class="mtlogs-title" v-text="catalog[0].title"></div>
        <p>２０１８年的夏季尾聲，聊天群組捎來其中一名友人的訊息，大意是說今年國慶那週是否要挑戰為期兩天的高山縱走行程？雖然在那之前，我就有時不時去走登山步道的習慣，但多半都在住處附近的郊山活動，對登山這個項活動處於不排斥，但也沒有到很喜歡的階段，單純將其視作消耗卡路里的運動，頻率也不高。</p>
        <p>所以面對朋友邀請，起初個人內心是萬分猶豫的，一來是從來沒有爬過高海拔山岳的經驗，二來是他們計畫要挑戰的路線是「鼎鼎大名」的黑色奇萊──當然，在我知道他們目標其實是新手入門的奇萊南華已經是後面進一步解釋的事情了，這也是為什麼下定決心跟著加入的原因之一。總而言之，在有甫考取專業高山嚮導證照的朋友主持，以及順利申請到天池山莊的床位，並搭配尚可的天氣預報，天時地利人和三者俱全之下，我的登山里程碑張燈結綵地正式拉開序幕。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[1].id">
        <div class="mtlogs-title" v-text="catalog[1].title"></div>
        <p>禮拜五下午跟公司請了假，回家梳洗後強迫自己上床睡覺，縱然輾轉難眠，也只能試著秉持補稱一分體力是一分的想法催眠自己。因為我們這支自組小隊將於這個晚上行使「ＤＡＹ０」計畫──所謂ＤＡＹ０（第零日），指的是在正式行程之前的準備日，通常包含了提前抵達登山口或住宿點的交通路程，是岳界規畫登山計畫時常見的用語。</p>
        <p>我們三人於晚間九點於集合地點會合，清點彼此行囊確認該帶的物品都有齊全後，便從台中驅車前往埔里。不得不老實說下午的假根本白請了，整個下午翻來覆去根本睡不著覺，畢竟這是我第一次挑戰過夜的爬山行程，而且也是扣除騎車上合歡山武嶺之外，首次以步行的方式攀登三千公尺級別的大山，自週一開始便心神不寧，處於既緊張又興奮的高亢狀態。</p>
        <p>我們在埔里進行最後一次補給，雖然只是短暫兩天兩夜與日常闊別，依然買了鹹酥雞和手搖飲爆吃一波才又悠悠哉哉繼續趕路，只是這些吃進肚子裡的炸物並沒有在我體內溫存太久，從進廬山與清境農場的分岔開始的台１４線，轉入產業道路直達屯原登山口，一路曲折蜿蜒，本就易暈體質的我毫無意外地在半道多次「抓兔子」，狀況之慘烈一度陷入自我懷疑，為什麼要大老遠跑來深山活受罪？但是事到如今也沒有辦法回頭了，只能拎著嘔吐袋咬著牙苦撐。</p>
        <figure>
            <img src="/images/mtlogs/019/01.jpg">
        </figure>
        <p>凌晨一點十五分，我們終於順利駕車抵達屯原登山口上方的停車場，令人意外的是這個時間點空位竟已寥寥無幾，至少超過十數台車輛，停駐在這個腹地還算寬敞的平坦空地。有些車子裡面還微微透出亮光，不難看出不少登山客和我們一樣，提前一個夜晚便上山備戰，印證了山界前輩、網路山友所述，奇萊南華這條路線的熱門程度，假日停車位往往是一位難求。</p>
        <p>儘管距離天亮剩不到六個小時，我們的隊長兼嚮導──榮哥，仍手腳俐落地在車子旁邊搭起帳篷。榮哥說，無論如何，就算躺在帳篷幾小時後就得花時間收帳，也比三人蜷縮在小車上都來的有價值。</p>
        <p>從入睡到醒來彷彿只是一瞬間，聽到帳篷外陸續傳來人們彼此交談、鍋具鏗鏘的聲響，帳篷篷布亦由原先的深黑漆染上淡淡的光彩。抬起手腕看看手錶，時間已是清晨五點，即使有些吵雜，被強烈睏意糾纏的我們，硬是賴到六點半才掀開營帳，十月的海拔兩千公尺，溫度已下降到十多度，唐突進犯的寒意令我等不由得直打哆嗦。</p>
        <figure>
            <img src="/images/mtlogs/019/02.jpg">
        </figure>
        <p>雖然陸陸續續仍有車輛上來，我們正式從「能高越嶺國家步道」屯原登山口的起登時間，比其他前一晚也睡在車上的登山口還來得遲些，但榮哥對此並不太擔憂，他說今天只需要走到住宿地點「天池山莊」即可，現在七點出發都還不算晚。那些凌晨三點、四點就開爬的隊伍，有的估計是到達天池山莊卸下重裝後，接著輕裝前往光被八表；或是一鼓作氣計畫在一天內完成奇萊南華的單攻客。</p>
        <p>「單攻指的是獨攀嗎？」</p>
        <p>「不是，單攻指的是一天內來回登山路線，獨攀是指自己一個人爬山。」</p>
        <p>獨攀可以是單攻，但單攻不見得是獨攀，過去我一直誤以為這兩者代表的是同一件事，只是用詞習慣的差異。幸好平常不怎麼會把這兩個詞掛在嘴邊說，差點鬧出笑話。</p>
        <figure>
            <img src="/images/mtlogs/019/03.jpg">
        </figure>
        <p>甫踏上能高越嶺古道沒多久，便看見平坦的碎石子步道上插著一根告示牌，上頭寫著「注意落石請勿逗留」之字樣，我們循著山徑延伸的方向望去，一條壯闊的銀灰色瀑布，將山體硬是切割成兩半，彷彿停滯了時間般，瀑布停止流動，宣洩之處滿是大小不一的石礫。</p>
        <p>這便是能高越嶺古道屯原段著名的崩壁地形，地質破碎裸露，在沒有任何防護措施的保護下，登山者失足摔落邊坡的憾事時有所聞，如此危險地形在號稱新手入門級的百岳路線竟不止一處，而且聽說一處比一處更加險峻。儘管實際通過沒有想像中來得可怕，但我們仍效法前方隊伍，先抬頭確認上方沒有任何碎石意圖打破凍結的時間，接著一前一後緊挨彼此，三步併兩步快速橫渡通過。在我們排隊穿越的等候過程中，我聽到一名山友向所屬隊伍的領頭人提問：</p>
        <p>「這麼危險為什麼沒有繩索或護欄？」</p>
        <p>「因為落大雨時候，上頭崩落的土石就會把整條步道給淹沒了去，繩索、護欄沒路用。」領頭的大哥操著流利的台語腔如是說。</p>
        <p>後來榮哥也說，我們此行其實集結了很多「幸運」，第一個幸運是初次參加天池山莊床位的抽籤便順利中籤；第二個幸運則是今年沒有豪雨風災，古道並未被崩壁土石流無情沖壞，否則我們除了得改道高遶，多爬好幾公里的上坡之外，更甚者說不定國家公園管理單位會勒令封山，連開放都不開放。</p>
        <figure>
            <img src="/images/mtlogs/019/04.jpg">
        </figure>
        <p>仔細一看，猶能看見崩壁下方還殘留著過去被沖壞的木棧道。</p>
    </div>
    <div class="text-block" :id="'act' + catalog[2].id">
        <div class="mtlogs-title" v-text="catalog[2].title"></div>
        <p>xxxx</p>
        <figure>
            <img src="/images/mtlogs/019/05.jpg">
        </figure>
    </div>
</div>
<!-- end -->
    </BaseTextContent>
</template>